
#Область СлужебныйПрограммныйИнтерфейс

// Определяет зависимости между константами
//
// Параметры:
//  ТаблицаЗависимостей - ТаблицаЗначений - см. НастройкиБЭД.НовыйТаблицаЗависимостейКонстант
//
Процедура ПриФормированииТаблицыЗависимостейКонстант(ТаблицаЗависимостей) Экспорт
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СервисДоставки") Тогда
		ОбщийМодульСервисДоставки = ОбщегоНазначения.ОбщийМодуль("СервисДоставки");
		ОбщийМодульСервисДоставки.ПриФормированииТаблицыЗависимостейКонстант(ТаблицаЗависимостей);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.СервисДоставки
	
	// ЭлектронноеВзаимодействие.СервисEDI
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СервисEDI") Тогда
		ОбщийМодульНастройкиEDI = ОбщегоНазначения.ОбщийМодуль("НастройкиEDI");
		ОбщийМодульНастройкиEDI.ПриФормированииТаблицыЗависимостейКонстант(ТаблицаЗависимостей);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
КонецПроцедуры

#КонецОбласти
