
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГЗ_ОбъемЗаключенныхКонтрактовПоКонтрагенту 
	Движения.ГЗ_ОбъемЗаключенныхКонтрактовПоКонтрагенту.Записывать = Истина;
	Движение = Движения.ГЗ_ОбъемЗаключенныхКонтрактовПоКонтрагенту.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Заказчик = Организация;
	Движение.Сумма = СуммаКонтракта;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
  
