///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ИнтеграцияСКоннект".
// ОбщийМодуль.ИнтеграцияСКоннектВызовСервера.
//
// Серверные процедуры интеграции с сервисом 1С-Коннект:
//  - настройки интеграции с 1С-Коннект.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Обновляет настройку использования интеграции с сервисом 1С-Коннект.
//
// Параметры:
//  Значение - Булево - новое значение настройки использования.
//
Процедура УстановитьИспользованиеИнтеграции(Значение) Экспорт
	
	ИнтеграцияСКоннект.УстановитьИспользованиеИнтеграции(Значение);
	
КонецПроцедуры

// Определяет пользовательские настройки интеграции с 1С-Коннект.
//
// Возвращаемое значение:
//  Структура - настройки интеграции текущего пользователя:
//   *ОтображатьКнопкуЗапуска - Булево - признак необходимости отображения кнопки интеграции;
//   *РасположениеФайла - Строка - расположение файла приложения 1С-Коннект.
//
Функция НастройкиИнтеграции() Экспорт 
	
	Возврат ИнтеграцияСКоннект.НастройкиИнтеграции();
	
КонецФункции

#КонецОбласти