#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение И Не ВариантыПриложений.ЭтоВерсияКОРП() Тогда
		Значение = Ложь;
	КонецЕсли;
	
	НастроитьЗависимыеНаборыСвойств(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НастроитьЗависимыеНаборыСвойств(Значение)
	
	УчетОбесцененияЗапасов.ВключитьНаборыСвойств(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли