#Область СлужебныйПрограммныйИнтерфейс

// Возвращает производственный календарь организации по умолчанию.
// Если производственный календарь организации не назначался - возвращается
// производственный календарь РФ.
//
// Параметры:
//	Организация	- СправочникСсылка.Организации
//
// ВозвращаемоеЗначение:
//	СправочникСсылка.ПроизводственныеКалендари
//
Функция ПроизводственныйКалендарьОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПроизводственныйКалендарь = Неопределено;
	
	Календарь = КалендарьОрганизации(Организация);
	Если ЗначениеЗаполнено(Календарь) Тогда
		
		Если ТипЗнч(Календарь) = Тип("СправочникСсылка.ПроизводственныеКалендари") Тогда
			ПроизводственныйКалендарь = Календарь;
		Иначе
			ПроизводственныйКалендарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Календарь, "ПроизводственныйКалендарь");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПроизводственныйКалендарь;
	
КонецФункции

Функция КалендарьОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Календари.Ссылка КАК Календарь
		|ИЗ
		|	Справочник.Календари КАК Календари
		|ГДЕ
		|	Календари.ВладелецГрафика = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Календарь) Тогда
		Календарь = Выборка.Календарь;
	Иначе
		Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Календарь;
	
КонецФункции

#КонецОбласти
