
// Возвращает идентификатор хранилища асинхронного получения данных.
// Копия старого метода БТС АсинхронноеПолучениеДанных.ИдентификаторХранилища().
// 
// Возвращаемое значение:
//   - Строка
//
Функция ИдентификаторХранилища() Экспорт
	
	Возврат "async";
	
КонецФункции

// Возвращает код ожидания выполнения.
// Этот метод в дальнейшем должен появится в программном интефрейсе БТС - АсинхронноеПолучениеДанныхСловарь.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
Функция КодВозвратаОжидание() Экспорт
	
	Возврат 10202;
	
КонецФункции

// Возвращает идентификатор хранилища интеграции в виде строки.
// Копия старого метода БТС ИнтеграцияОбъектовОбластейДанных.ИдентификаторХранилища()
// 
// Возвращаемое значение:
//   - Строка - идентификатор хранилища. 
//
Функция ИдентификаторХранилищаИнтеграцияОбъектов() Экспорт
	
	Возврат "integration";
	
КонецФункции

// Возвращает идентификатор команды "Выполнить"
// Копия старого метода БТС ИнтеграцияОбъектовОбластейДанныхСловарь.КомандаВыполнить()
//
// Возвращаемое значение:
//   - Строка - идентификатор команды.
//
Функция КомандаВыполнить() Экспорт
	
	Возврат "execute";
	
КонецФункции

//  Возвращает код состояния выполнения с предупреждениями.
// 
// Возвращаемое значение:
//   Число - код состояния по имени метода. 
//
Функция КодСостоянияВыполненоСПредупреждениями() Экспорт
	
	Возврат 10240;
    
КонецФункции

#Область СтруктураПолейЗапроса

Функция ПолеРезультат() Экспорт
	
	Возврат "result";
	
КонецФункции

Функция ПолеКодВозврата() Экспорт
	
	Возврат "response";
	
КонецФункции

Функция ПолеОшибка() Экспорт
	
	Возврат "error";
	
КонецФункции

Функция ПолеСообщениеОбОшибке() Экспорт
	
	Возврат "message";
	
КонецФункции

Функция ПолеХранилище() Экспорт
	
	Возврат "storage";
	
КонецФункции

Функция ПолеИдентификатор() Экспорт
	
	Возврат "id";
	
КонецФункции

Функция ПолеОсновнойРаздел() Экспорт
	
	Возврат "general";
	
КонецФункции

#КонецОбласти 

