#Область ПрограммныйИнтерфейс

// Возвращает список организаций, подключенных к сервису Мой налог.
//
// Возвращаемое значение:
//   Массив - массив организаций
//
Функция ПодключенныеОрганизации() Экспорт
	
	Возврат РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.ПодключенныеОрганизации();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИнтеграцияСПлатформойСамозанятыеКлиентСервер.ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,,,
		ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
