#Область СлужебныеПроцедурыИФункции

Процедура ПриЗаписиРегистраУчетаСтажаПФР(МенеджерВременныхТаблиц) Экспорт
	УчетСтажаПФРБазовый.ПриЗаписиРегистраУчетаСтажаПФР(МенеджерВременныхТаблиц);
КонецПроцедуры	

Функция РесурсыУчетаСтажаПФР() Экспорт
	Возврат УчетСтажаПФРБазовый.РесурсыУчетаСтажаПФР();	
КонецФункции

Функция НоваяЗаписьНабораРегистраУчетаСтажаПФР(НаборЗаписей) Экспорт
	Возврат УчетСтажаПФРБазовый.НоваяЗаписьНабораРегистраУчетаСтажаПФР(НаборЗаписей);	
КонецФункции

Процедура ДополнитьЗапросВТИсходныеДанныеУчетаСтажа(Запрос) Экспорт
	
КонецПроцедуры

Функция ТекстДополнительныхПолейЗапросаВТДанныеУчетаСтажаПФР() Экспорт
	Возврат УчетСтажаПФРБазовый.ТекстДополнительныхПолейЗапросаВТДанныеУчетаСтажаПФР();	
КонецФункции

Процедура СоздатьВТСоответствиеВидовСтажаПараметрамИсчисления2014(МенеджерВременныхТаблиц) Экспорт
	УчетСтажаПФРБазовый.СоздатьВТСоответствиеВидовСтажаПараметрамИсчисления2014(МенеджерВременныхТаблиц);	
КонецПроцедуры	

Процедура СоздатьВТСоответствиеВидовСтажаПараметрамИсчисления2013(МенеджерВременныхТаблиц) Экспорт
	УчетСтажаПФРБазовый.СоздатьВТСоответствиеВидовСтажаПараметрамИсчисления2013(МенеджерВременныхТаблиц);
КонецПроцедуры	

Процедура СоздатьВТПериодыРаботыСКоронавирусом(МенеджерВременныхТаблиц) Экспорт
	УчетСтажаПФРБазовый.СоздатьВТПериодыРаботыСКоронавирусом(МенеджерВременныхТаблиц);
КонецПроцедуры

#КонецОбласти
