#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьЗамерыВремени() Экспорт 
	
	Если Не РаспознаваниеДокументовЗамерыВремениСлужебный.ДоступнаОтправкаЗамеровВремени() Тогда 
		Возврат;
	КонецЕсли;
	
	КлючЗадания = "РаспознаваниеДокументовЗамерыВремениСлужебный.ОтправитьЗамерыВремени";
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если Задания.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(НомерСеансаИнформационнойБазы());
	
	Попытка
		ФоновыеЗадания.Выполнить(
			КлючЗадания,
			Параметры,
			КлючЗадания,
			НСтр("ru = 'Отправка замеров времени распознавания документов.'")
		);
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Невозможно выполнить отправку замеров времени распознавания документов
			           |Описание ошибки:
			           |%1'"),
			КлючЗадания,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки
		);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
