#Область ПрограммныйИнтерфейс

#Область ПараметрыВыбора

// Устанавливает параметры выбора номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой нужно установить параметры выбора
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС, Массив Из ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
//  ИмяПоляВвода - Строка - имя поля ввода номенклатуры.
Процедура УстановитьПараметрыВыбораНоменклатуры(Форма, ВидыПродукции = Неопределено, ИмяПоляВвода = "ТоварыНоменклатура") Экспорт
	
	ПараметрыВыбора = Новый Массив;
	
	Для Каждого ПараметрВыбора Из Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя <> "Отбор.Табак"
			И ПараметрВыбора.Имя <> "Отбор.Обувь"
			И ПараметрВыбора.Имя <> "Отбор.Велосипеды"
			И ПараметрВыбора.Имя <> "Отбор.Духи"
			И ПараметрВыбора.Имя <> "Отбор.КреслаКоляски"
			И ПараметрВыбора.Имя <> "Отбор.ЛегкаяПромышленность"
			И ПараметрВыбора.Имя <> "Отбор.МолочнаяПродукцияПодконтрольнаяВЕТИС"
			И ПараметрВыбора.Имя <> "Отбор.МолочнаяПродукцияБезВЕТИС"
			И ПараметрВыбора.Имя <> "Отбор.Фотоаппараты"
			И ПараметрВыбора.Имя <> "Отбор.АлкогольнаяПродукцияВоВскрытойТаре"
			И ПараметрВыбора.Имя <> "Отбор.АлкогольнаяПродукцияВоВскрытойТаре"
			И ПараметрВыбора.Имя <> "Отбор.Шины"
			И ПараметрВыбора.Имя <> "Отбор.АльтернативныйТабак"
			И ПараметрВыбора.Имя <> "Отбор.УпакованнаяВода" Тогда
			
			ПараметрыВыбора.Добавить(ПараметрВыбора);
		КонецЕсли;
	КонецЦикла;
	
	Если ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТабачнаяПродукция", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ОбувнаяПродукция", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Велосипеды") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Велосипеды", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Духи", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.КреслаКоляски", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ЛегкаяПромышленность", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.МолочнаяПродукцияПодконтрольнаяВЕТИС", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.МолочнаяПродукцияБезВЕТИС", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Фотоаппараты", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Шины", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.АльтернативныйТабак", Истина));
	ИначеЕсли ВидыПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода") Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.УпакованнаяВода", Истина));
	КонецЕсли;
	
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Услуга", Ложь));
	
	Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
