#Область СлужебныеПроцедурыИФункции

// Добавляет замер в статистику, хранящуюся в ПараметрыПриложения[БухгалтерияПредприятия.СтатистикаОткрытияФорм].
//
Процедура Подключаемый_ДобавитьСтатистикуОткрытия() Экспорт

	ОбщегоНазначенияБПКлиент.ДобавитьСтатистикуОткрытия();
	
КонецПроцедуры

// Запукает автообмен с СЭДО ФСС
//
Процедура ПолучитьИнформациюОВходящихСообщенияхСЭДОФСС() Экспорт
	
	Если НЕ ОбщегоНазначенияБПВызовСервера.ТекущемуПользователюСЭДОФССДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьИнформациюОВходящихСообщенияхЗавершениеСЭДОФСС", ОбщегоНазначенияБПКлиент);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти