#Область ПрограммныйИнтерфейс

Процедура ИзменитьПараметрыДлительнойОтправкиСервер(КлючПараметра, НовоеЗначение) Экспорт
	
	ДлительныеОперацииОбменаСБанкамиКлиентСервер.ИзменитьПараметрыДлительнойОтправки(КлючПараметра, НовоеЗначение);
	
КонецПроцедуры

Функция ОшибкиСервер() Экспорт
	
	ПараметрыОтправки = ДлительныеОперацииОбменаСБанкамиКлиентСервер.ЗначенияПараметровДлительнойОперации();
	Возврат ПараметрыОтправки["Ошибки"];
	
КонецФункции

Процедура СохранитьОшибкиПоследнегоОбмена(СведенияПоОшибкам, ИмяПользователя = Неопределено) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("БанкКоннект_ОшибкиПоследнегоОбмена",, СведенияПоОшибкам, , ИмяПользователя);

КонецПроцедуры

Функция ПолучитьОшибкиПоследнегоОбмена(ИмяПользователя = Неопределено) Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить("БанкКоннект_ОшибкиПоследнегоОбмена", , , ИмяПользователя);

КонецФункции

Процедура ОчиститьПараметрыДлительнойОтправкиСервер() Экспорт

	ДлительныеОперацииОбменаСБанкамиКлиентСервер.ОчиститьПараметрыДлительнойОтправки();

КонецПроцедуры

#КонецОбласти