#Область СлужебныеПроцедурыИФункции

Функция ФормыСоздаваемогоДокумента(ТипДокумента) Экспорт
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат Документы.СчетФактураВыданный.ПолучитьСоответствиеВидовСчетаФактурыФормам();
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Возврат Документы.СчетФактураПолученный.ПолучитьСоответствиеВидовСчетаФактурыФормам();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти