#Область СлужебныеПроцедурыИФункции

Функция СвойстваДолжности(Должность) Экспорт
	
	Свойства = Новый Структура("Представление,КодПоРееструДолжностей");
	
	Если ЗначениеЗаполнено(Должность) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Должность, "Наименование,НаименованиеДляЗаписейОТрудовойДеятельности");
		
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности) Тогда
			Свойства.Представление = ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности;
		Иначе
			Свойства.Представление = ЗначенияРеквизитов.Наименование;
		КонецЕсли;
		
		Свойства.КодПоРееструДолжностей = ЭлектронныеТрудовыеКнижки.КодДолжностиПоРееструГосударственнойСлужбы(Должность);
		
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

Функция ПредставлениеПодразделения(Подразделение) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Подразделение, "Наименование,НаименованиеДляЗаписейОТрудовойДеятельности");
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности) Тогда
		Возврат ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности;
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов.Наименование;
	
КонецФункции

Функция СвойстваОснованияУвольнения(ОснованиеУвольнения) Экспорт
	
	СвойстваОснования = Новый Структура(
		"ОснованиеУвольненияНаименованиеОснования,
		|ОснованиеУвольненияТекстОснования,
		|ОснованиеУвольненияСтатья,
		|ОснованиеУвольненияЧасть,
		|ОснованиеУвольненияПункт,
		|ОснованиеУвольненияПодпункт");
	
	Если ЗначениеЗаполнено(ОснованиеУвольнения) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ОснованиеУвольнения, "ТекстОснования,Статья,Часть,Пункт,Подпункт");
		
		СвойстваОснования.ОснованиеУвольненияТекстОснования = ЗначенияРеквизитов.ТекстОснования;
		СвойстваОснования.ОснованиеУвольненияСтатья = ЗначенияРеквизитов.Статья;
		СвойстваОснования.ОснованиеУвольненияЧасть = ЗначенияРеквизитов.Часть;
		СвойстваОснования.ОснованиеУвольненияПункт = ЗначенияРеквизитов.Пункт;
		СвойстваОснования.ОснованиеУвольненияПодпункт = ЗначенияРеквизитов.Подпункт;
		
		Если ТипЗнч(ОснованиеУвольнения) <> Тип("СправочникСсылка.ОснованияУвольненияПользовательские") Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ОснованиеУвольнения);
			
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Представления.ТекстОснования КАК ТекстОснования,
				|	Представления.Наименование КАК Наименование
				|ИЗ
				|	РегистрСведений.ПредставленияОснованийУвольнения КАК Представления
				|ГДЕ
				|	Представления.Использовать
				|	И Представления.Объект = &Ссылка";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СвойстваОснования.ОснованиеУвольненияНаименованиеОснования = Выборка.Наименование;
				СвойстваОснования.ОснованиеУвольненияТекстОснования = Выборка.ТекстОснования;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат СвойстваОснования;
	
КонецФункции

Функция НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности");
	Если ТипЗнч(ЗначениеРеквизита) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

Функция НастройкиЭлектронныхТрудовыхКнижек() Экспорт
	
	ЗаписьНастроек = РегистрыСведений.НастройкиЭлектронныхТрудовыхКнижек.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.Прочитать();
	
	Настройки = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(ЗаписьНастроек, Метаданные.РегистрыСведений.НастройкиЭлектронныхТрудовыхКнижек);
	
	Возврат Настройки;
	
КонецФункции

Функция ПредставлениеРазрядаКатегории(РазрядКатегория) Экспорт
	
	Если Не ЗначениеЗаполнено(РазрядКатегория) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ЭлектронныеТрудовыеКнижки.ПредставлениеРазрядаКатегории(РазрядКатегория);
	
КонецФункции

Функция ОрганизацияПоРегистрационномуНомеруПФР(РегистрационныйНомерПФР) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрационныйНомерПФР", РегистрационныйНомерПФР);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИсторияРегистрацийВОрганеПФР.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВОрганеПФР КАК ИсторияРегистрацийВОрганеПФР
		|ГДЕ
		|	НЕ ИсторияРегистрацийВОрганеПФР.Организация.ПометкаУдаления
		|	И ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР = &РегистрационныйНомерПФР";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Организация;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
