////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в учете
// Переопределяемое в пределах библиотеки поведение.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТУдержанияПоСотрудникамКонтрагент(МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеБазовый.СоздатьВТУдержанияПоСотрудникамКонтрагент(МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьТаблицуНДФЛ(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	// В базовой реализации не требуется дополнение.

КонецПроцедуры

Процедура ДополнитьТаблицуНачислений(ПериодРегистрации, Организация, МенеджерВременныхТаблиц, Сотрудники) Экспорт

	// В базовой реализации не требуется дополнение.

КонецПроцедуры

Процедура ДополнитьТаблицуУдержаний(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	// В базовой реализации не требуется дополнение.

КонецПроцедуры

Процедура ДополнитьМассивТиповНачисления(МассивТипов) Экспорт

	// В базовой реализации не требуется дополнение.
	
КонецПроцедуры

Функция ТипыПоляДокументОснование() Экспорт

	Возврат ОтражениеЗарплатыВУчетеБазовый.ТипыПоляДокументОснование();

КонецФункции

Функция ТипыПоляПервичныйРегистратор() Экспорт

	Возврат ОтражениеЗарплатыВУчетеБазовый.ТипыПоляПервичныйРегистратор();

КонецФункции

Процедура ДополнитьТаблицуНачислениеУдержаниеВидОперации(Таблица) Экспорт

	// В базовой реализации не требуется дополнение.

КонецПроцедуры

Процедура СоздатьВТРаспределениеНачисленийДляУдержаний(ОтборФизическиеЛица, ИсключаемыеРегистраторы, ПараметрыРаспределения) Экспорт

	ОтражениеЗарплатыВУчетеБазовый.СоздатьВТРаспределениеНачисленийДляУдержаний(ОтборФизическиеЛица, ИсключаемыеРегистраторы, ПараметрыРаспределения);

КонецПроцедуры

Функция ДанныеДляРаспределенияНДФЛ(ПараметрыРаспределения) Экспорт

	Возврат ОтражениеЗарплатыВУчетеБазовый.ДанныеДляРаспределенияНДФЛ(ПараметрыРаспределения);

КонецФункции

Процедура ДополнитьИсключаемыеРегистраторыБазыДляРаспределенияНДФЛ(ИсключаемыйРегистратор, ИсключаемыеРегистраторы, ПараметрыПолученияБазы) Экспорт
	
	// В базовой реализации не требуется дополнение.
	
КонецПроцедуры

Функция БазаРаспределенияНДФЛКУдержанию(ТаблицаУсловийОтбора, ПоСотрудникам) Экспорт

	Возврат ОтражениеЗарплатыВУчетеБазовый.БазаРаспределенияНДФЛКУдержанию(ТаблицаУсловийОтбора, ПоСотрудникам);

КонецФункции

Процедура ДополнитьБазуУдержанийПоУмолчаниюСтатьями(БазаПоУмолчанию, Организация, ПериодРегистрации) Экспорт

	ОтражениеЗарплатыВУчетеБазовый.ДополнитьБазуУдержанийПоУмолчаниюСтатьями(БазаПоУмолчанию, Организация, ПериодРегистрации);

КонецПроцедуры

Функция НДФЛПоРабочимМестамИСтатьям(ТаблицаНДФЛ, База, БазаВсеНачисления,
										СтрокиУжеУдержано, Организация, ПериодРегистрации) Экспорт
										
	Возврат ОтражениеЗарплатыВУчетеБазовый.НДФЛПоРабочимМестамИСтатьям(ТаблицаНДФЛ, База, БазаВсеНачисления,
										СтрокиУжеУдержано, Организация, ПериодРегистрации);
	
КонецФункции

#КонецОбласти
