#Область ПрограммныйИнтерфейс

// Обработчик события "ПриИзменении" списка.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма, в которой размещается список.
//	Элемент - ТаблицаФормы - Список.
//
Процедура ПриИзмененииСписка(Форма, Элемент) Экспорт
	
	Если НЕ Форма.ОтслеживатьПометкуУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Форма.ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПометки = ПомеченныеНаУдалениеВызовСервера.ПолучитьДанныеПометкиНаУдаление();
	Если ДанныеПометки <> Неопределено Тогда
		
		Оповестить("ПометкаНаУдаление_Установка");
		
		ПодключитьОбработчикОжидания("Подключаемый_ОповещениеОПометкеУдаления", 0.1, Истина);
		
		Если ДанныеПометки.НеПоказыватьВопросПриПометкеНаУдаление <> Истина Тогда
			ОткрытьФорму("ОбщаяФорма.ВопросПриПометкеНаУдаление",, Форма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти