#Область ПрограммныйИнтерфейс

Функция НачатьОбновлениеФинОтчетности(ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление данных сервиса отправки 1С:ФинОтчетности'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ФинОтчетностьВБанки.ОбновитьДанныеСервиса",
		Новый Структура, ПараметрыВыполнения);
	
КонецФункции

Функция ЭтоАрхивныйКомплект(Получатель, ИдентификаторКомплекта) Экспорт
	
	НастройкиКомплекта = ЗаполнениеФинОтчетностиВБанки.НастройкиКомплектаОтчетности(Получатель, ИдентификаторКомплекта);
	
	Если НастройкиКомплекта <> Неопределено Тогда
		Возврат НастройкиКомплекта.Архивный;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗакончитьВыполнениеПравила(Знач Правило) Экспорт
	
	ОкончаниеВыполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "ОкончаниеВыполнения");
	Если ЗначениеЗаполнено(ОкончаниеВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	// Текущий период считается заключительным.
	ОкончаниеВыполнения = НачалоМесяца(ОбщегоНазначенияБП.ТекущаяДатаНаСервере());
	Справочники.ПравилаФинОтчетности.УстановитьОкончаниеВыполнения(Правило, ОкончаниеВыполнения);
	
КонецПроцедуры

#КонецОбласти