Функция Идентификатор(Имя) Экспорт
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	ДлинаИмени = СтрДлина(Имя);
	Для Индекс = 0 По ДлинаИмени - 1 Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой) - 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция НомерКонтейнера(Индекс) Экспорт
	
	Возврат Формат(Индекс + 1, "ЧГ=0");
	
КонецФункции

Функция СсылкаНаИТС(Срок = Неопределено) Экспорт
	
	Если Срок = Неопределено Тогда
		Параметры = "";
	Иначе
		Параметры = "/?date=" + Формат(Срок, "ДФ=yyyyMMdd");
	КонецЕсли;
	
	Возврат "http://its.1c.ru/calendar" + Параметры;
	
КонецФункции

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Если ТипЗнч(ПараметрыКоманды.Правило) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.СписокНалоговОтчетов") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "ОбщаяФорма.НалогиИОтчеты");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СОтчетности") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СОтчетности", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СЭДО") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СЭДО", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "РегистрСведений.НастройкаЗаполненияФормСтатистики.Форма.НастройкаЗаполненияФормСтатистики");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ОплатитьЗадолженностьПоНалогамВзносам") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.ПомощникУплатыНалоговВзносовПрошлыхЛет.Форма.ФормаВводаНачальныхОстатковИнтеграцияСБанком");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыКоманды.Правило) = Тип("СправочникСсылка.ПроверкиКонтролирующимиОрганами") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",        ПараметрыКоманды.Правило);
		ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
		
		ОписаниеДействия = Новый Структура;
		ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.ПроверкиКонтролирующимиОрганами.Форма.ФормаПросмотра");
		ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
		
	Иначе
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтераВызовСервера.ОписаниеДействия(ПараметрыКоманды);
		
	КонецЕсли;
	
	Возврат ОписаниеДействия;
	
КонецФункции

Функция СрокПредупрежденияПриОграниченииСпособовОтправки() Экспорт
	
	Возврат 5; // 5 дней - достаточно дойти до учреждения или отправить почтой
	
КонецФункции

#Область КодыЗадач

Функция КодЗадачиНДС() Экспорт
	
	Возврат "НДС";
	
КонецФункции

Функция КодЗадачиУСН() Экспорт
	
	Возврат "УСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносы() Экспорт
	
	Возврат "СтраховыеВзносы";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП() Экспорт
	
	Возврат "СтраховыеВзносы_Предприниматель";
	
КонецФункции

Функция КодЗадачиНДФЛ() Экспорт
	
	Возврат "НДФЛ";
	
КонецФункции

Функция КодЗадачиНДФЛПоУплате() Экспорт
	
	Возврат "НДФЛ_Агент_Уплата";
	
КонецФункции

Функция КодЗадачиНДФЛПоОтчету() Экспорт
	
	Возврат "НДФЛ_Агент";
	
КонецФункции

Функция КодЗадачиНДФЛПредприниматель() Экспорт
	
	Возврат "НДФЛ_Предприниматель";
	
КонецФункции

Функция КодЗадачиСреднесписочнаяЧисленность() Экспорт
	
	Возврат "СведенияОСреднесписочнойЧисленности";
	
КонецФункции

Функция КодЗадачиСтатистика() Экспорт
	
	Возврат "СтатистическаяОтчетность";
	
КонецФункции

Функция КодЗадачиПатент() Экспорт
	
	Возврат "Патент";
	
КонецФункции

Функция КодЗадачиЕНВД() Экспорт
	
	Возврат "ЕНВД";
	
КонецФункции

Функция КодЗадачиТорговыйСбор() Экспорт
	
	Возврат "ТорговыйСбор";
	
КонецФункции

Функция КодЗадачиНалогНаПрофессиональныйДоход() Экспорт
	
	Возврат "НалогНаПрофессиональныйДоход";
	
КонецФункции

Функция КодЗадачиБухгалтерскаяОтчетность() Экспорт
	
	Возврат "БухгалтерскаяОтчетность";
	
КонецФункции

Функция КодЗадачиНалогНаИмущество() Экспорт
	
	Возврат "НалогНаИмущество";
	
КонецФункции

Функция КодЗадачиТранспортныйНалог() Экспорт
	
	Возврат "ТранспортныйНалог";
	
КонецФункции

Функция КодЗадачиЗемельныйНалог() Экспорт
	
	Возврат "ЗемельныйНалог";
	
КонецФункции

#КонецОбласти
