////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ОбменСБанкамиПоЗарплатнымПроектам.РазрешенаОтправкаОтдельнойВедомости
Функция РазрешенаОтправкаОтдельнойВедомости() Экспорт
	
	Использование = Истина;
	
	ОбменСБанкамиПоЗарплатнымПроектамПереопределяемый.ОпределитьДоступностьПередачиВБанкРеестровНаЗачислениеЗарплаты(Использование);
	
	Если Не Использование Тогда
		Возврат Использование;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		Модуль.РазрешитьОтправкуВБанкОтдельнойВедомости(Использование);
	КонецЕсли;
	
	Возврат Использование;
	
КонецФункции

#КонецОбласти

