#Область СлужебныйПрограммныйИнтерфейс

Функция ПредставлениеГруппировки(ЗначениеГруппировки) Экспорт
	
	Если ТипЗнч(ЗначениеГруппировки) = Тип("ПеречислениеСсылка.ВидыРасходовНУ") Тогда
		
		Возврат ПредставлениеВидаРасходовНУ(ЗначениеГруппировки);
		
	ИначеЕсли ТипЗнч(ЗначениеГруппировки) = Тип("ПеречислениеСсылка.ВидыПрочихДоходовИРасходов") Тогда
		
		Возврат ПредставлениеВидаПрочихДоходовИРасходов(ЗначениеГруппировки);
		
	ИначеЕсли Не ЗначениеЗаполнено(ЗначениеГруппировки) Тогда
		
		Возврат "<...>";
		
	Иначе
		Возврат Строка(ЗначениеГруппировки);
		
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеВидаРасходовНУ(ВидРасходовНУ) Экспорт
	
	Если ВидРасходовНУ = Перечисления.ВидыРасходовНУ.АмортизационнаяПремия Тогда
		
			Возврат НСтр("ru='Амортизационная премия (пп.3 п.2 ст. 253; ст. 256-259.3; ст. 318 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.Амортизация Тогда
		
		Возврат НСтр("ru='Амортизация (пп.3 п.2 ст. 253; ст. 256-259.3; ст. 318 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.АрендаФедеральногоИМуниципальногоИмущества Тогда
		
		Возврат НСтр("ru='Аренда федерального и муниципального имущества'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование Тогда
		
		Возврат НСтр("ru='Добровольное личное страхование, предусматривающее оплату страховщиками медицинских расходов (п.16 ст. 255 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности Тогда
		
		Возврат НСтр("ru='Добровольное личное страхование на случай наступления смерти или утраты трудоспособности (п.16 ст. 255 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников Тогда
		
		Возврат НСтр("ru='Добровольное страхование по договорам долгосрочного страхования жизни работников, пенсионного страхования и (или) негосударственного пенсионного обеспечения работников (п.16 ст. 255 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ЕСН Тогда
		
		Возврат НСтр("ru='ЕСН'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.КомандировочныеРасходы Тогда
		
		Возврат НСтр("ru='Командировочные расходы (пп.11 п 1 ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.МатериальныеРасходы Тогда
		
		Возврат НСтр("ru='Материальные расходы (ст. 254 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НалогиИСборы Тогда
		
		Возврат НСтр("ru='Налоги и сборы (пп.1 п.1 ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения Тогда
		
		Возврат НСтр("ru='Не учитываемые в целях налогообложения (ст. 270 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НИОКР Тогда
		
		Возврат НСтр("ru='НИОКР (ст. 262 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НИОКРПоПеречнюПравительстваРФ Тогда
		
		Возврат НСтр("ru='НИОКР по перечню Правительства РФ (п.7 ст.262 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ОбязательноеИДобровольноеСтрахованиеИмущества Тогда
		
		Возврат НСтр("ru='Обязательное и добровольное страхование имущества (ст. 263 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ОплатаТруда Тогда
		
		Возврат НСтр("ru='Оплата труда (ст. 255 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ОсвоениеПриродныхРесурсов Тогда
		
		Возврат НСтр("ru='Освоение природных ресурсов (пп.3 п.1 ст. 253; ст. 261 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы Тогда
		
		Возврат НСтр("ru='Представительские расходы (пп.22 п.1 ст. 264; п.2. ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы Тогда
		
		Возврат НСтр("ru='Прочие расходы (ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов Тогда
		
		Возврат НСтр("ru='Расходы на возмещение затрат работников по уплате процентов (пп. 24.1 ст. 255 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые Тогда
		
		Возврат НСтр("ru='Расходы на рекламу (нормируемые) (пп.28 п 1 ст. 264; п.4 ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.РемонтОсновныхСредств Тогда
		
		Возврат НСтр("ru='Ремонт основных средств (пп.2 п.1 ст. 253, ст. 260 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы Тогда
		
		Возврат НСтр("ru='Страховые взносы (пп.1 п.1 ст. 264 НК РФ)'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ТорговыйСбор Тогда
		
		Возврат НСтр("ru='Торговый сбор'");
		
	ИначеЕсли ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ТранспортныеРасходы Тогда
		
		Возврат НСтр("ru='Транспортные расходы (ст.320 НК РФ)'");
		
	Иначе
		
		Возврат Строка(ВидРасходовНУ);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеВидаПрочихДоходовИРасходов(ВидПрочихДоходовИРасходов)
	
	Если ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.БезвозмездноеПолучениеИмуществаРаботУслугИмущественныхПрав Тогда
		
		Возврат НСтр("ru='Безвозмездное получение имущества, работ, услуг, имущественных прав (п.8 ст.250 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ВозмещениеУбытковКПолучениюУплате Тогда
		
		Возврат НСтр("ru='Возмещение убытков к получению (уплате) (п.3 ст.250 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ВосстановлениеАмортизационнойПремии Тогда
		
		Возврат НСтр("ru='Восстановление амортизационной премии (п.9 ст.258 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ДолевоеУчастиеВИностранныхОрганизациях Тогда
		
		Возврат НСтр("ru='Долевое участие в иностранных организациях'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ДолевоеУчастиеВРоссийскихОрганизациях Тогда
		
		Возврат НСтр("ru='Долевое участие в российских организациях'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ИзлишкиПриИнвентаризации Тогда
		
		Возврат НСтр("ru='Излишки товаров, выявленные в результате инвентаризации (п.20 ст. 250 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.КорректировкаПрибылиДоРыночныхЦен Тогда
		
		Возврат НСтр("ru='Корректировка прибыли до рыночных цен'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы Тогда
		
		Возврат НСтр("ru='Курсовые разницы (п.2 ст. 250 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ Тогда
		
		Возврат НСтр("ru='Курсовые разницы по расчетам в у.е.'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ЛиквидацияОсновныхСредств Тогда
		
		Возврат НСтр("ru='Ликвидация основных средств (п.13 ст.250; п.8 ст.265 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.НалогиИСборы Тогда
		
		Возврат НСтр("ru='Налоги и сборы'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.НДСПоСписаннойКредиторскойЗадолженности Тогда
		
		Возврат НСтр("ru='НДС по списанной кредиторской задолженности'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок Тогда
		
		Возврат НСтр("ru='Операции с финансовыми инструментами срочных сделок, не обращающимися на организованном рынке'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР Тогда
		
		Возврат НСтр("ru='Операции с финансовыми инструментами срочных сделок, обращающимися на организованном рынке'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ОтчисленияВОценочныеРезервы Тогда
		
		Возврат НСтр("ru='Отчисления в оценочные резервы'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПереоценкаВнеоборотныхАктивов Тогда
		
		Возврат НСтр("ru='Переоценка внеоборотных активов'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПремияПокупателю Тогда
		
		Возврат НСтр("ru='Премия, выплаченная покупателю'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет Тогда
		
		Возврат НСтр("ru='Прибыль (убыток) прошлых лет'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучениюУплате Тогда
		
		Возврат НСтр("ru='Проценты к получению (уплате) (п.6 ст. 250; п. 2. ст. 265, ст. 269 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыНачисленныеПоСт269 Тогда
		
		Возврат НСтр("ru='Проценты, начисленные в соответствии со статьей 269 (п.6 ст. 250; п. 2. ст. 265, ст. 269 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагам Тогда
		
		Возврат НСтр("ru='Проценты по государственным ценным бумагам'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0 Тогда
		
		Возврат НСтр("ru='Проценты по государственным ценным бумагам по ставке 0%'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы Тогда
		
		Возврат НСтр("ru='Прочие внереализационные доходы (расходы) (ст. 265 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеКосвенныеРасходы Тогда
		
		Возврат НСтр("ru='Прочие косвенные расходы'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеОперационныеДоходыРасходы Тогда
		
		Возврат НСтр("ru='Прочие операционные доходы (расходы)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеУбыткиПриравненныеКВнереализационнымРасходам Тогда
		
		Возврат НСтр("ru='Прочие убытки, приравненные к внереализационным расходам'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам Тогда
		
		Возврат НСтр("ru='Разница между первоначальной и номинальной стоимостью по долговым ценным бумагам'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РасходыНаУслугиБанков Тогда
		
		Возврат НСтр("ru='Расходы на услуги банков'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РасходыОтСниженияСтоимостиАктивов Тогда
		
		Возврат НСтр("ru='Расходы от снижения стоимости активов'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд Тогда
		
		Возврат НСтр("ru='Расходы по передаче товаров (работ, услуг) безвозмездно и для собственных нужд'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования Тогда
		
		Возврат НСтр("ru='Реализация имущественных прав кроме права требования'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств Тогда
		
		Возврат НСтр("ru='Реализация имущественных прав по объектам обслуживающих производств и хозяйств'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов Тогда
		
		Возврат НСтр("ru='Реализация нематериальных активов'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства Тогда
		
		Возврат НСтр("ru='Реализация объектов строительства'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств Тогда
		
		Возврат НСтр("ru='Реализация основных средств'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа Тогда
		
		Возврат НСтр("ru='Реализация права требования до наступления срока платежа (ст. 279 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг Тогда
		
		Возврат НСтр("ru='Реализация права требования как оказания финансовых услуг (ст. 279 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа Тогда
		
		Возврат НСтр("ru='Реализация права требования после наступления срока платежа (ст. 279 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества Тогда
		
		Возврат НСтр("ru='Реализация прочего имущества'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг Тогда
		
		Возврат НСтр("ru='Реализация ценных бумаг'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду Тогда
		
		Возврат НСтр("ru='Сдача имущества в аренду или субаренду (п.4 ст. 250 НК РФ)'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности Тогда
		
		Возврат НСтр("ru='Списание дебиторской (кредиторской) задолженности'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.УчастиеВДругихОрганизациях Тогда
		
		Возврат НСтр("ru='Участие в других организациях'");
		
	ИначеЕсли ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате Тогда
		
		Возврат НСтр("ru='Штрафы, пени и неустойки по хозяйственным договорам к получению (уплате) (п.3 ст. 250 НК РФ)'");
		
	Иначе
		
		Возврат Строка(ВидПрочихДоходовИРасходов);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти