#Область СлужебныеПроцедурыИФункции

Функция ПеречисленияТипВсеСсылки() Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПеречисленияТипВсеСсылки();
	
КонецФункции

Функция ПолучитьИмяОткрываемойФормыПоТипу(ТипДокумента) Экспорт
	
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг")
		Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда
		
		ИмяФормы = "Обработка.ТОРГ12РаспознаваниеДокументов.Форма";
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату") Тогда
		ИмяФормы = "Обработка.СчетНаОплатуРаспознаваниеДокументов.Форма";
	Иначе
		ИмяФормы = "Документ.РаспознанныйДокумент.Форма.ФормаДокументаСОшибкой";
	КонецЕсли;
	
	Возврат ИмяФормы;
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт
	
	Возврат РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);
	
КонецФункции

#КонецОбласти