////////////////////////////////////////////////////////////////////////////////
//
// Серверные процедуры и функции регламентированных отчетов общего назначения 
// с кешируемым результатом на время сеанса.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ОтчетыНеОтправляемыеВКонтролирующиеОрганы() Экспорт 
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы = Новый Массив;
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетДеятельностьИнОргВРФ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетЖивотныйМирСведенияОВыданныхЛицензиях");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетИсполнениеКонтрактовГОЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетПодтверждениеРазмещенияОтчетаНИОКРвГИС");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРасчетПоОплатеЗаВоду");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрАкцизыВычетыВиноматериалы");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрАкцизыВычетыЭтиловыйСпирт");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФНаПереработкуБензина");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоАвиационномуКеросину");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоВиноматериалам");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоДенатурированномуЭтиловомуСпирту");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоНефтяномуСырью");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоСреднимДистиллятам");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСведенияОрублевыхСчетах");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСоответствиеУсловийТруда");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистика1Квотирование");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма1ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма4ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМприл");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтраховыеВзносыНСИПЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетФорма1ГОЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФормаМГОЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетФормаОН0001");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетФормаОН0002");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетФормаОН0003");
	Возврат РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы;
КонецФункции

Функция ПолучитьМассивФормСтатистикиТолькоДляОрганизации() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("РегламентированныйОтчетАвансыИмущество");
	Результат.Добавить("РегламентированныйОтчетДоходыЗаПределамиРФ");
	Результат.Добавить("РегламентированныйОтчетИмущество");
	Результат.Добавить("РегламентированныйОтчетПрибыль");
	Результат.Добавить("РегламентированныйОтчетПрибыльИностраннойОрганизации");
	Результат.Добавить("РегламентированныйОтчетПрибыльСколковоРасчетПрибыли");
	Результат.Добавить("РегламентированныйОтчетПрибыльСРП");
	Результат.Добавить("РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности");
	Результат.Добавить("РегламентированныйОтчетТранспортныйНалог");
	Результат.Добавить("РегламентированныйОтчетФинансовыйРезультатИнвестиционногоТоварищества");
	
	// Статистические отчеты.
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11К");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11НА");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11Сделка");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11ФСС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11ТЭР");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма12Строительство");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма12Ф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма14МЕТлом");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Автотранс");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Администрация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Алкоголь");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1АлкогольОпт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ВЭС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ГС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Закупки");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1И");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИЖС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Кадры");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Контракт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1КСРКраткая");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МБ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1НатураБМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1П");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1РабочаяСила");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1РП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1СХцены");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Т");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТГМС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТЕП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Технология");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТОРГ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТРавто");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Туст");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Тчзп");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Учет");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ФП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ФПинд");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХсв");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма24Энергетика");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма26ЖКХ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2ГСГЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2МС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2НаукаКр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2Приватизация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2СБСеверСр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Информ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Приватизация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3СБвывоз");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3ТОРГПМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Ф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4Запасы");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4Инновация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4ТЭР");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма57Т");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма5З");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма7Травматизм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма85К");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9КС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФОМС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФПФ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФСС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАППМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАФЛ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаИЖС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПЗдрав");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПКультура");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПНаука");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПОбразование");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПСоц");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПмсх");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1СХ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2инв");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2к");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП3");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП4");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП4НЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП5М");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП6");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПМТорг");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаС1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаС2");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТОРГм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПСП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВМП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВбюджет");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПУслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1СОНКО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1НКО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Тпроф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМГОЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХжилище");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Конъюнктура");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПМ1Автогруз");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ПР");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма6Нефть");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2Наука");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаИАП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТГС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТМС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1КХ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма18КС");
	
	// Прочее
	Результат.Добавить("РегламентированныйОтчетФормаОН0001");
	Результат.Добавить("РегламентированныйОтчетФормаОН0002");
	Результат.Добавить("РегламентированныйОтчетФормаОН0003");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивФормСтатистикиТолькоДляИП() Экспорт
	
	Результат = Новый Массив;
	
	// Статистические отчеты.
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПсвед");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Предприниматель");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПмес");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОтчетыФСГС() Экспорт 
	ОтчетыФСГС = Новый СписокЗначений;
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаБухОтчетность");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11К");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1П");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1РП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Т");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1И");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма3Информ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма3Ф");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма5З");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП1");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП1СХ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП2");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП2инв");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП2к");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП3");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП4");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП4НЗ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаП5М");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаПМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаПМПром");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаПМТорг");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаМПм");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПОбразование");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПКультура");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПНаука");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПСоц");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПЗдрав");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаС1");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаС2");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаДАС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХсв");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Автотранс");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Алкоголь");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1АлкогольОпт");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма9КС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПсвед");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Услуги");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАуслуги");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма65Автотранс");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Закупки");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма3СБвывоз");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11Сделка");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11ФСС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаДАППМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма3ТОРГПМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2НаукаКр");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТРавто");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Учет");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ВЭС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11ТЭР");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма4ТЭР");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1МБ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма12Ф");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТГМС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТОРГ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1НатураБМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма7Травматизм");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма26ЖКХ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма12Строительство");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма4Запасы");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Технология");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ИЖС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Администрация");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаДАФЛ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаМПмсх");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1МО");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма4Инновация");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма24Энергетика");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма14МЕТлом");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2МС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ГСГЗ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Туст");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма3Приватизация");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2Приватизация");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Тчзп");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма85К");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТЕП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ФПинд");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Кадры");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1КСРКраткая");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1КСР");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ДМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМприл");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма4ДМ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1РабочаяСила");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма9ФПФ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма9ФСС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма9ФОМС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ФП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1СХцены");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2СБСеверСр");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2МПинн");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Контракт");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма11НА");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1РЖ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1МС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ГС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаТОРГм");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаИЖС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма57Т");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Предприниматель");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаМПСП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПмес");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВМП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВбюджет");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаПУслуги");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаПрочиеФормы");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаМПмикронатура");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПуслуги");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1СОНКО");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1НКО");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Тпроф");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХжилище");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Фермер");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаМГОЗ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма4ОС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1Конъюнктура");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ЛХ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1РЦ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2РЦ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2ТПОхота");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаПМ1Автогруз");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ПР");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма6Нефть");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма14ФОМС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма2Наука");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФормаИАП");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТГС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1ТМС");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма1КХ");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма30");
	ОтчетыФСГС.Добавить("РегламентированныйОтчетСтатистикаФорма18КС");
	Возврат ОтчетыФСГС;
КонецФункции

Функция ПолучитьОтчетыРПН() Экспорт 
	ОтчетыРПН = Новый СписокЗначений;
	ОтчетыРПН.Добавить("РегламентированныйОтчетРасчетПлатыОкрСредаСвод");
	ОтчетыРПН.Добавить("РегламентированныйОтчетОтходыСубъектовМСП");
	ОтчетыРПН.Добавить("РегламентированныйОтчетФорма2ТПОтходы");
	ОтчетыРПН.Добавить("РегламентированныйОтчетСтатистикаФорма2ТПВоздух");
	ОтчетыРПН.Добавить("РегламентированныйОтчетРасчетЭкологическийСбор");
	ОтчетыРПН.Добавить("РегламентированныйОтчетДекларацияПлатаНВОС");
	ОтчетыРПН.Добавить("РегламентированныйОтчетЭкологическийКонтроль");
	ОтчетыРПН.Добавить("РегламентированныйОтчетДекларацияОВоздействииНаОкружающуюСреду");
	ОтчетыРПН.Добавить("РегламентированныйОтчетФорма2ТПРекультивация");
	ОтчетыРПН.Добавить("РегламентированныйОтчетКоличествоТоваровПодлежащихУтилизации");
	Возврат ОтчетыРПН;
КонецФункции

Функция ПолучитьОтчетыМинобороны() Экспорт 
	ОтчетыМинобороны = Новый СписокЗначений;
	ОтчетыМинобороны.Добавить("РегламентированныйОтчетИсполнениеКонтрактовГОЗ");
	Возврат ОтчетыМинобороны;
КонецФункции

Функция ПолучитьОтчетыБанкРоссии() Экспорт 
	ОтчетыБанкРоссии = Новый СписокЗначений;
	ОтчетыБанкРоссии.Добавить("РегламентированныйОтчетОперацииСДенежнымиСредствамиНФО");
	Возврат ОтчетыБанкРоссии;
КонецФункции

Функция ПолучитьОтчетыРВ3() Экспорт 
	ОтчетыРВ3 = Новый СписокЗначений;
	ОтчетыРВ3.Добавить("РегламентированныйОтчетРВ3");
	Возврат ОтчетыРВ3;
КонецФункции

Функция ПолучитьОтчетыРСВ2() Экспорт 
	ОтчетыРСВ2 = Новый СписокЗначений;
	ОтчетыРСВ2.Добавить("РегламентированныйОтчетРСВ2");
	Возврат ОтчетыРСВ2;
КонецФункции

Функция ПолучитьОтчетыЗаявления() Экспорт 
	ОтчетыЗаявления = Новый СписокЗначений;
	ОтчетыЗаявления.Добавить("РегламентированныйОтчетЗаявлениеОВвозеТоваров");
	Возврат ОтчетыЗаявления;
КонецФункции

Функция ПолучитьОтчетыФСС() Экспорт 
	ОтчетыФСС = Новый СписокЗначений;
	ОтчетыФСС.Добавить("РегламентированныйОтчет4ФСС");
	ОтчетыФСС.Добавить("РегламентированныйОтчет4аФСС");
	Возврат ОтчетыФСС;
КонецФункции

Функция ПолучитьОтчетыАлко() Экспорт 
	
	ОтчетыАлко = Новый СписокЗначений;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьПоАлкогольнойПродукции") Тогда
		ОбщийМодульРегламентированнаяОтчетностьАЛКО = ОбщегоНазначения.ОбщийМодуль("РегламентированнаяОтчетностьАЛКО");
		Если НЕ ОбщийМодульРегламентированнаяОтчетностьАЛКО = Неопределено Тогда		
			ОбщийМодульРегламентированнаяОтчетностьАЛКО.ПолучитьСписокРегламентированныхОтчетов(ОтчетыАлко);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ОтчетыАлко;
	
КонецФункции

Функция ПолучитьОтчетыБаланса() Экспорт 
	ОтчетыБаланса = Новый СписокЗначений;
	ОтчетыБаланса.Добавить("РегламентированныйОтчетБаланс");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетФорма2");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетФорма3");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетФорма4");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетФорма5");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетФорма6");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетБухОтчетность");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетБухОтчетностьМП");
	ОтчетыБаланса.Добавить("РегламентированныйОтчетБухОтчетностьСОНКО");
	ОтчетыБаланса.Добавить("БухгалтерскаяОтчетностьВБанк");
	Возврат ОтчетыБаланса;
КонецФункции

Функция РеглОтчетыИсполнителиТребований() Экспорт
	
	// У перечисленных здесь отчетов должен быть метод ДанныеРеглОтчета().
	
	ИсполнителиТребований = Новый Соответствие;
	
	// Бухгалтерская отчетность.
	ИсполнителиТребований.Вставить("БухгалтерскаяОтчетность",                                "РегламентированныйОтчетБухОтчетность");
	ИсполнителиТребований.Вставить("БухгалтерскаяОтчетность.2013_МалыеПредприятия",          "РегламентированныйОтчетБухОтчетностьМП");
	ИсполнителиТребований.Вставить("БухгалтерскаяОтчетность.2013_НекоммерческиеОрганизации", "РегламентированныйОтчетБухОтчетность");
	ИсполнителиТребований.Вставить("БухгалтерскаяОтчетность.2013_СоциальноОриентированные",  "РегламентированныйОтчетБухОтчетностьСОНКО");
	ИсполнителиТребований.Вставить("БухгалтерскаяОтчетность.2016_СоциальноОриентированные",  "РегламентированныйОтчетБухОтчетность");
	
	// Федеральные налоги.
	ИсполнителиТребований.Вставить("НалогНаПрибыль", "РегламентированныйОтчетПрибыль");
	
	ИсполнителиТребований.Вставить("УСН.2013_УплатаОрганизация",         "РегламентированныйОтчетУСН"); // БРО предоставляет инструменты только для "годовых" правил
	ИсполнителиТребований.Вставить("УСН.2013_ДекларацияОрганизация",     "РегламентированныйОтчетУСН");
	ИсполнителиТребований.Вставить("УСН.2013_УплатаПредприниматель",     "РегламентированныйОтчетУСН");
	ИсполнителиТребований.Вставить("УСН.2013_ДекларацияПредприниматель", "РегламентированныйОтчетУСН");
	ИсполнителиТребований.Вставить("УСН.2020_УведомлениеУСН",            "РегламентированноеУведомлениеПереходНаУСН");
	
	ИсполнителиТребований.Вставить("Патент.2020_ЗаявлениеНаПатент",      "РегламентированноеУведомлениеПолучениеПатента");
	ИсполнителиТребований.Вставить("Патент.2021_ЗаявлениеНаПатент",      "РегламентированноеУведомлениеПолучениеПатента");
	
	ИсполнителиТребований.Вставить("КосвенныеНалогиТамСоюз.2010_Декларация", "РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	ИсполнителиТребований.Вставить("КосвенныеНалогиТамСоюз.2010_Налог",      "РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	ИсполнителиТребований.Вставить("КосвенныеНалогиТамСоюз.2010_Статформа",  "РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС");
	
	ИсполнителиТребований.Вставить("НДС",                           "РегламентированныйОтчетНДС");
	ИсполнителиТребований.Вставить("НДФЛ_Предприниматель",          "РегламентированныйОтчет3НДФЛ");
	ИсполнителиТребований.Вставить("НДФЛ_ФизЛицо",                  "РегламентированныйОтчет3НДФЛ");
	ИсполнителиТребований.Вставить("НДФЛ_Агент.2016_6НДФЛ_Квартал", "РегламентированныйОтчет6НДФЛ");
	ИсполнителиТребований.Вставить("НДФЛ_Агент.2016_6НДФЛ_Год",     "РегламентированныйОтчет6НДФЛ");
	ИсполнителиТребований.Вставить("НДФЛ_Агент.2021_6НДФЛ_Квартал", "РегламентированныйОтчет6_НДФЛ");
	ИсполнителиТребований.Вставить("НДФЛ_Агент.2021_6НДФЛ_Год",     "РегламентированныйОтчет6_НДФЛ");
	
	ИсполнителиТребований.Вставить("ЕНВД", "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход");
	
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2013_ОтчетностьФСС",             	 "РегламентированныйОтчет4ФСС");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2014_ОтчетностьФССБумажная",     	 "РегламентированныйОтчет4ФСС");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2014_ОтчетностьФССЭлектронная",  	 "РегламентированныйОтчет4ФСС");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2017_ОтчетностьФССБумажная",     	 "РегламентированныйОтчет4ФСС");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2017_ОтчетностьФССЭлектронная",  	 "РегламентированныйОтчет4ФСС");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2013_ОтчетностьПФР",             	 "РегламентированныйОтчетРСВ1");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2014_ОтчетностьПФРБумажная",     	 "РегламентированныйОтчетРСВ1");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2014_ОтчетностьПФРЭлектронная",  	 "РегламентированныйОтчетРСВ1");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2017_ОтчетностьСтраховыеВзносы", 	 "РегламентированныйОтчетРасчетПоСтраховымВзносам");
	ИсполнителиТребований.Вставить("СтраховыеВзносы.2017_ПодтверждениеВидаДеятельности", "РегламентированныйОтчетПодтверждениеВидаДеятельности");
	
	ИсполнителиТребований.Вставить("ЕСХН",                 "РегламентированныйОтчетЕСХН");
	ИсполнителиТребований.Вставить("НДПИ",                 "РегламентированныйОтчетНДПИ");
	ИсполнителиТребований.Вставить("ВодныйНалог",          "РегламентированныйОтчетВода");
	ИсполнителиТребований.Вставить("НалогНаИгорныйБизнес", "РегламентированныйОтчетНалогНаИгорныйБизнес");
	ИсполнителиТребований.Вставить("РозничныеЦеныНаТабак", "РегламентированныйОтчетРозничныеЦеныНаТабак");
	
	// Росприроднадзор.
	ИсполнителиТребований.Вставить("Росприроднадзор.2014_ПлатаЗаНегативноеВоздействиеНаОкружающуюСреду", "РегламентированныйОтчетРасчетПлатыОкрСредаСвод");
	ИсполнителиТребований.Вставить("Росприроднадзор.2014_ПлатаЗаНегативноеВоздействиеУплата",            "РегламентированныйОтчетРасчетПлатыОкрСредаСвод");
	ИсполнителиТребований.Вставить("Росприроднадзор.2015_ПлатаЗаНегативноеВоздействиеУплата",            "РегламентированныйОтчетРасчетПлатыОкрСредаСвод");
	ИсполнителиТребований.Вставить("Росприроднадзор.2014_ОтходыМСП",                                     "РегламентированныйОтчетОтходыСубъектовМСП");
	ИсполнителиТребований.Вставить("Росприроднадзор.2014_2ТПОтходы",                                     "РегламентированныйОтчетФорма2ТПОтходы");
	ИсполнителиТребований.Вставить("Росприроднадзор.2018_ЭкологическийКонтроль",                         "РегламентированныйОтчетЭкологическийКонтроль");
	ИсполнителиТребований.Вставить("ЭкологическийСбор.2016_ЭкологическийСборРасчет",                     "РегламентированныйОтчетРасчетЭкологическийСбор");
	ИсполнителиТребований.Вставить("ЭкологическийСбор.2016_ЭкологическийСборУплата",                     "РегламентированныйОтчетРасчетЭкологическийСбор");
	ИсполнителиТребований.Вставить("ПлатаЗаНегативноеВоздействиеНаОкружающуюСреду",                      "РегламентированныйОтчетДекларацияПлатаНВОС");
	ИсполнителиТребований.Вставить("ДекларацияОВоздействииНаОкружающуюСреду",                            "РегламентированныйОтчетДекларацияОВоздействииНаОкружающуюСреду");
	ИсполнителиТребований.Вставить("Росприроднадзор.Форма2ТПРекультивация",                              "РегламентированныйОтчетФорма2ТПРекультивация");
	
	// Акцизы.
	ИсполнителиТребований.Вставить("Акцизы.2013_УплатаСвидетельство",       "РегламентированныйОтчетАкцизыПриложение1");
	ИсполнителиТребований.Вставить("Акцизы.2013_ДекларацияСвидетельство",   "РегламентированныйОтчетАкцизыПриложение1");
	ИсполнителиТребований.Вставить("Акцизы.2013_Декларация",                "РегламентированныйОтчетАкцизыПриложение1");
	ИсполнителиТребований.Вставить("Акцизы.2013_Уплата",                    "РегламентированныйОтчетАкцизыПриложение1");
	ИсполнителиТребований.Вставить("Акцизы.2016_ДекларацияАлкоголь1151084", "РегламентированныйОтчетАкцизыПриложение1");
	ИсполнителиТребований.Вставить("Акцизы.2016_УплатаАлкоголь1151084",     "РегламентированныйОтчетАкцизыПриложение1");
	
	ИсполнителиТребований.Вставить("Акцизы.2013_ДекларацияТабак", "РегламентированныйОтчетАкцизыТабак");
	ИсполнителиТребований.Вставить("Акцизы.2013_УплатаТабак",     "РегламентированныйОтчетАкцизыТабак");
	
	ИсполнителиТребований.Вставить("Акцизы.2013_ИзвещениеАванс", "РегламентированныйОтчетИзвещениеОбУплатеАвансовогоПлатежаАкциза");
	
	ИсполнителиТребований.Вставить("Акцизы.2013_ОсвобождениеАванс", "РегламентированныйОтчетИзвещениеОбОсвАвансовогоПлатежаАкциза");
	
	ИсполнителиТребований.Вставить("Акцизы.2016_ДекларацияАлкоголь",                           "РегламентированныйОтчетАкцизыАлкоголь");
	ИсполнителиТребований.Вставить("Акцизы.2016_УплатаАлкоголь",                               "РегламентированныйОтчетАкцизыАлкоголь");
	ИсполнителиТребований.Вставить("Акцизы.2016_ДекларацияСвидетельствоДенатурированныйСпирт", "РегламентированныйОтчетАкцизыАлкоголь");
	ИсполнителиТребований.Вставить("Акцизы.2016_УплатаСвидетельствоДенатурированныйСпирт",     "РегламентированныйОтчетАкцизыАлкоголь");
	
	ИсполнителиТребований.Вставить("Акцизы.2016_ДекларацияИныеТовары",              "РегламентированныйОтчетАкцизыГСМ");
	ИсполнителиТребований.Вставить("Акцизы.2016_УплатаИныеТовары",                  "РегламентированныйОтчетАкцизыГСМ");
	ИсполнителиТребований.Вставить("Акцизы.2016_ДекларацияСвидетельствоИныеТовары", "РегламентированныйОтчетАкцизыГСМ");
	ИсполнителиТребований.Вставить("Акцизы.2016_УплатаСвидетельствоИныеТовары",     "РегламентированныйОтчетАкцизыГСМ");
	ИсполнителиТребований.Вставить("Акцизы.2020_ДекларацияНефтяноеСырье",           "РегламентированныйОтчетАкцизыНефтяноеСырье");
	ИсполнителиТребований.Вставить("Акцизы.2020_УплатаНефтяноеСырье",               "РегламентированныйОтчетАкцизыНефтяноеСырье");
	
	// Региональные и местные налоги.
	ИсполнителиТребований.Вставить("НалогНаИмущество",                       "РегламентированныйОтчетИмущество");
	ИсполнителиТребований.Вставить("НалогНаИмущество.2013_Налоговый_расчет", "РегламентированныйОтчетАвансыИмущество");
	ИсполнителиТребований.Вставить("НалогНаИмущество.2013_Аванс",            "РегламентированныйОтчетАвансыИмущество");
	ИсполнителиТребований.Вставить("ТранспортныйНалог",                      "РегламентированныйОтчетТранспортныйНалог");
	ИсполнителиТребований.Вставить("ЗемельныйНалог",                         "РегламентированныйОтчетЗемельныйНалог");
	ИсполнителиТребований.Вставить("ЗемельныйНалог.2015_Декларация",         "РегламентированныйОтчетЗемельныйНалог");
	ИсполнителиТребований.Вставить("ЗемельныйНалог.2015_Налог_Год",          "РегламентированныйОтчетЗемельныйНалог");
	ИсполнителиТребований.Вставить("ЗемельныйНалог.2015_Аванс",              "РегламентированныйОтчетЗемельныйНалог");
	ИсполнителиТребований.Вставить("ЛьготыПоТранспортномуЗемельномуНалогу",  "РегламентированноеУведомлениеЛьготаТранспортЗемля");
	
	// Статистика.
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П1",                     "РегламентированныйОтчетСтатистикаФормаП1");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П1_3",                   "РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П1СХ",                   "РегламентированныйОтчетСтатистикаФормаП1СХ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П2",                     "РегламентированныйОтчетСтатистикаФормаП2");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П2инвест" ,              "РегламентированныйОтчетСтатистикаФормаП2инв");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П2краткая",              "РегламентированныйОтчетСтатистикаФормаП2к");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П3",                     "РегламентированныйОтчетСтатистикаФормаП3");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П4",                     "РегламентированныйОтчетСтатистикаФормаП4");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2018_П4Квартальная",          "РегламентированныйОтчетСтатистикаФормаП4");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2103_П5м",                    "РегламентированныйОтчетСтатистикаФормаП5М");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_5З",                     "РегламентированныйОтчетСтатистикаФорма5З");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П6",                     "РегламентированныйОтчетСтатистикаФормаП6");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Предприятие",           "РегламентированныйОтчетСтатистикаФорма1П");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ПМ",                     "РегламентированныйОтчетСтатистикаФормаПМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_МПМикро",                "РегламентированныйОтчетСтатистикаФормаМПм");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_МПМикроНатура",          "РегламентированныйОтчетСтатистикаФормаМПмикронатура");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Инвест",                "РегламентированныйОтчетСтатистикаФорма1И");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1РПКвартал",             "РегламентированныйОтчетСтатистикаФорма1РП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1РПГод",                 "РегламентированныйОтчетСтатистикаФорма1РП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_3Информ",                "РегламентированныйОтчетСтатистикаФорма3Информ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_3Ф",                     "РегламентированныйОтчетСтатистикаФорма3Ф");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ЗПНаука",                "РегламентированныйОтчетСтатистикаФормаЗПНаука");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ЗПОбразование",          "РегламентированныйОтчетСтатистикаФормаЗПОбразование");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ЗПЗдрав",                "РегламентированныйОтчетСтатистикаФормаЗПЗдрав");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ЗПКультура",             "РегламентированныйОтчетСтатистикаФормаЗПКультура");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ЗПСоц",                  "РегламентированныйОтчетСтатистикаФормаЗПСоц");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_11Краткая",              "РегламентированныйОтчетСтатистикаФорма11К");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_11",                     "РегламентированныйОтчетСтатистикаФорма11");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1торги",                 "РегламентированныйОтчетСтатистикаФорма1Т");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Квотирование",          "РегламентированныйОтчетСтатистика1Квотирование");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_П4НЗ",                   "РегламентированныйОтчетСтатистикаФормаП4НЗ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_С1",                     "РегламентированныйОтчетСтатистикаФормаС1");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_С2",                     "РегламентированныйОтчетСтатистикаФормаС2");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ДАП",                   "РегламентированныйОтчетСтатистикаФорма1ДАП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ДАС",                    "РегламентированныйОтчетСтатистикаФормаДАС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_22ЖКХсв",                "РегламентированныйОтчетСтатистикаФорма22ЖКХсв");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_22ЖКХжилище",            "РегламентированныйОтчетСтатистикаФорма22ЖКХжилище");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_22ЖКХресурсы",           "РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ПМПром",                 "РегламентированныйОтчетСтатистикаФормаПМПром");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ПМТорг",                 "РегламентированныйОтчетСтатистикаФормаПМТорг");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Автотранс",             "РегламентированныйОтчетСтатистикаФорма1Автотранс");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Алкоголь",              "РегламентированныйОтчетСтатистикаФорма1Алкоголь");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1АлкогольОпт",           "РегламентированныйОтчетСтатистикаФорма1АлкогольОпт");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ЦеныПриобр",            "РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_9КС",                    "РегламентированныйОтчетСтатистикаФорма9КС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ИПсвед",                "РегламентированныйОтчетСтатистикаФорма1ИПсвед");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Услуги",                "РегламентированныйОтчетСтатистикаФорма1Услуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ЦеныПроизвГодовая",     "РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ЦеныПроизвМесячная",    "РегламентированныйОтчетСтатистикаФорма1ЦеныПроизв");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ДАуслуги",              "РегламентированныйОтчетСтатистикаФорма1ДАуслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_65АвтотрансГодовая",     "РегламентированныйОтчетСтатистикаФорма65Автотранс");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_65АвтотрансКвартальная", "РегламентированныйОтчетСтатистикаФорма65Автотранс");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Закупки",               "РегламентированныйОтчетСтатистикаФорма1Закупки");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_3СБвывоз",               "РегламентированныйОтчетСтатистикаФорма3СБвывоз");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_11Сделка",               "РегламентированныйОтчетСтатистикаФорма11Сделка");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2018_11ФСС",                  "РегламентированныйОтчетСтатистикаФорма11ФСС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ДАППМ",                  "РегламентированныйОтчетСтатистикаФормаДАППМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_3ТОРГПМ",                "РегламентированныйОтчетСтатистикаФорма3ТОРГПМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2НаукаКр",               "РегламентированныйОтчетСтатистикаФорма2НаукаКр");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ТРавто",                "РегламентированныйОтчетСтатистикаФорма1ТРавто");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Учет",                  "РегламентированныйОтчетСтатистикаФорма1Учет");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1Фермер",                "РегламентированныйОтчетСтатистикаФорма1Фермер");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_8ВЭСуслуги",             "РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ВЭС",                   "РегламентированныйОтчетСтатистикаФорма1ВЭС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_11ТЭР",                  "РегламентированныйОтчетСтатистикаФорма11ТЭР");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_4ТЭР",                   "РегламентированныйОтчетСтатистикаФорма4ТЭР");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_4ТЭР",                   "РегламентированныйОтчетСтатистикаФорма4ТЭР");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1МБ",                    "РегламентированныйОтчетСтатистикаФорма1МБ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_12Ф",                    "РегламентированныйОтчетСтатистикаФорма12Ф");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ТГМС",                  "РегламентированныйОтчетСтатистикаФорма1ТГМС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ТОРГ",                  "РегламентированныйОтчетСтатистикаФорма1ТОРГ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_7Травматизм",            "РегламентированныйОтчетСтатистикаФорма7Травматизм");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_26ЖКХ",                  "РегламентированныйОтчетСтатистикаФорма26ЖКХ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ИЖС",                   "РегламентированныйОтчетСтатистикаФорма1ИЖС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_1ИПАвтогруз",            "РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Администрация",         "РегламентированныйОтчетСтатистикаФорма1Администрация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_ДАФЛ",                   "РегламентированныйОтчетСтатистикаФормаДАФЛ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_МПмсх",                  "РегламентированныйОтчетСтатистикаФормаМПмсх");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ЦеныПриобр",            "РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1МО",                    "РегламентированныйОтчетСтатистикаФорма1МО");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_1ДАуслуги",              "РегламентированныйОтчетСтатистикаФорма1ДАуслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_8ВЭСуслуги",             "РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1натураБМ",              "РегламентированныйОтчетСтатистикаФорма1НатураБМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2012_2ТПВоздух",              "РегламентированныйОтчетСтатистикаФорма2ТПВоздух");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2012_12Строительство",        "РегламентированныйОтчетСтатистикаФорма12Строительство");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2012_4Запасы",                "РегламентированныйОтчетСтатистикаФорма4Запасы");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Технология",            "РегламентированныйОтчетСтатистикаФорма1Технология");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_4Инновация",             "РегламентированныйОтчетСтатистикаФорма4Инновация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_24Энергетика",           "РегламентированныйОтчетСтатистикаФорма24Энергетика");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_14МЕТлом",               "РегламентированныйОтчетСтатистикаФорма14МЕТлом");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2МС",                    "РегламентированныйОтчетСтатистикаФорма2МС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ГСГЗ",                  "РегламентированныйОтчетСтатистикаФорма2ГСГЗ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Туст",                  "РегламентированныйОтчетСтатистикаФорма1Туст");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_3Приватизация",          "РегламентированныйОтчетСтатистикаФорма3Приватизация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_3Приватизация",          "РегламентированныйОтчетСтатистикаФорма3Приватизация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2Приватизация",          "РегламентированныйОтчетСтатистикаФорма2Приватизация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_2Приватизация",          "РегламентированныйОтчетСтатистикаФорма2Приватизация");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Тчзп",                  "РегламентированныйОтчетСтатистикаФорма1Тчзп");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_85К",                    "РегламентированныйОтчетСтатистикаФорма85К");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ТЕП",                   "РегламентированныйОтчетСтатистикаФорма1ТЕП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ФПинд",                 "РегламентированныйОтчетСтатистикаФорма1ФПинд");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Кадры",                 "РегламентированныйОтчетСтатистикаФорма1Кадры");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1КСРКраткая",            "РегламентированныйОтчетСтатистикаФорма1КСРКраткая");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1КСР",                   "РегламентированныйОтчетСтатистикаФорма1КСР");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ДМ",                    "РегламентированныйОтчетСтатистикаФорма1ДМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ДМДавальческоеСырье",   "РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ДМ",                    "РегламентированныйОтчетСтатистикаФорма2ДМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ДМприл",                "РегламентированныйОтчетСтатистикаФорма2ДМприл");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ДМПолугодие",           "РегламентированныйОтчетСтатистикаФорма2ДМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2ДМприлПолугодие",       "РегламентированныйОтчетСтатистикаФорма2ДМприл");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_4ДМ",                    "РегламентированныйОтчетСтатистикаФорма4ДМ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1РабочаяСила",           "РегламентированныйОтчетСтатистикаФорма1РабочаяСила");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_9ФПФ",                   "РегламентированныйОтчетСтатистикаФорма9ФПФ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_9ФСС",                   "РегламентированныйОтчетСтатистикаФорма9ФСС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_9ФОМС",                  "РегламентированныйОтчетСтатистикаФорма9ФОМС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ФП",                    "РегламентированныйОтчетСтатистикаФорма1ФП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_1СХцены",                "РегламентированныйОтчетСтатистикаФорма1СХцены");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2СБСеверСр",             "РегламентированныйОтчетСтатистикаФорма2СБСеверСр");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_2МПИнн",                 "РегламентированныйОтчетСтатистикаФорма2МПинн");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1Контракт",              "РегламентированныйОтчетСтатистикаФорма1Контракт");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_11НА",                   "РегламентированныйОтчетСтатистикаФорма11НА");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1РЖ",                    "РегламентированныйОтчетСтатистикаФорма1РЖ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1МС",                    "РегламентированныйОтчетСтатистикаФорма1МС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2013_1ГС",                    "РегламентированныйОтчетСтатистикаФорма1ГС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_ТОРГм",                  "РегламентированныйОтчетСтатистикаФормаТОРГм");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_ИЖС",                    "РегламентированныйОтчетСтатистикаФормаИЖС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_8ВЭСТРУСЛ",              "РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_57Т",                    "РегламентированныйОтчетСтатистикаФорма57Т");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_1Предприниматель",       "РегламентированныйОтчетСтатистикаФорма1Предприниматель");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_1МПСП",                  "РегламентированныйОтчетСтатистикаФормаМПСП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1Предприниматель",       "РегламентированныйОтчетСтатистикаФорма1Предприниматель");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_МПСП",                   "РегламентированныйОтчетСтатистикаФормаМПСП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_1_1",                    "РегламентированныйОтчетСтатистикаФорма1");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_1ИПмес",                 "РегламентированныйОтчетСтатистикаФорма1ИПмес");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_ТЗВМП",                  "РегламентированныйОтчетСтатистикаФормаТЗВМП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2016_ТЗВбюджет",              "РегламентированныйОтчетСтатистикаФормаТЗВбюджет");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_Пуслуги",                "РегламентированныйОтчетСтатистикаФормаПУслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_ПУслугиМесячная",        "РегламентированныйОтчетСтатистикаФормаПУслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2018_ПУслугиКвартальная",     "РегламентированныйОтчетСтатистикаФормаПУслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_МПМикроНатура",          "РегламентированныйОтчетСтатистикаФормаМПмикронатура");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_1ИПуслуги",              "РегламентированныйОтчетСтатистикаФорма1ИПуслуги");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_1СОНКО",                 "РегламентированныйОтчетСтатистикаФорма1СОНКО");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_1НКО",                   "РегламентированныйОтчетСтатистикаФорма1НКО");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_1ТПРОФ",                 "РегламентированныйОтчетСтатистикаФорма1Тпроф");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_МГОЗ",                   "РегламентированныйОтчетСтатистикаФормаМГОЗ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1Конъюнктура",           "РегламентированныйОтчетСтатистикаФорма1Конъюнктура");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2015_1КонъюнктураОпт",        "РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_4ОС",             	   "РегламентированныйОтчетСтатистикаФорма4ОС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_ЗПФизКультИСпорт",       "РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_1ЛХ",				       "РегламентированныйОтчетСтатистикаФорма1ЛХ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_1РЦ",				       "РегламентированныйОтчетСтатистикаФорма1РЦ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_2РЦ",				       "РегламентированныйОтчетСтатистикаФорма2РЦ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2018_2ТПОхота",			   "РегламентированныйОтчетСтатистикаФорма2ТПОхота");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_ПМ1Автогруз",
								   "РегламентированныйОтчетСтатистикаФормаПМ1Автогруз");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1ПР",
								   "РегламентированныйОтчетСтатистикаФорма1ПР");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_6Нефть",
								   "РегламентированныйОтчетСтатистикаФорма6Нефть");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2014_14ФОМС",
								   "РегламентированныйОтчетСтатистикаФорма14ФОМС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_2Наука",
								   "РегламентированныйОтчетСтатистикаФорма2Наука");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2017_ИАП",
								   "РегламентированныйОтчетСтатистикаФормаИАП");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1ТГС",
								   "РегламентированныйОтчетСтатистикаФорма1ТГС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1ТМС",
								   "РегламентированныйОтчетСтатистикаФорма1ТМС");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_1-КХ",
								   "РегламентированныйОтчетСтатистикаФорма1КХ");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2019_30",
								   "РегламентированныйОтчетСтатистикаФорма30");
	ИсполнителиТребований.Вставить("СтатистическаяОтчетность.2020_18КС",
								   "РегламентированныйОтчетСтатистикаФорма18КС");
	
	// Минюст
	ИсполнителиТребований.Вставить("Минюст.2019_ФормаОН0001",      "РегламентированныйОтчетФормаОН0001");
	ИсполнителиТребований.Вставить("Минюст.2019_ФормаОН0002",      "РегламентированныйОтчетФормаОН0002");
	ИсполнителиТребований.Вставить("Минюст.2019_ФормаОН0003",      "РегламентированныйОтчетФормаОН0003");
	
	// Алкогольные отчеты.
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьПоАлкогольнойПродукции") Тогда
		ОбщийМодульРегламентированнаяОтчетностьАЛКО = ОбщегоНазначения.ОбщийМодуль("РегламентированнаяОтчетностьАЛКО");
		Если НЕ ОбщийМодульРегламентированнаяОтчетностьАЛКО = Неопределено Тогда		
			ОбщийМодульРегламентированнаяОтчетностьАЛКО.РеглОтчетыИсполнителиТребований(ИсполнителиТребований);		
		КонецЕсли; 
	КонецЕсли;
	
	// Прочие отчеты.
	ИсполнителиТребований.Вставить("СведенияОСреднесписочнойЧисленности.2014_Отчет",
		"РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников");
	ИсполнителиТребований.Вставить("СведенияОСреднесписочнойЧисленности.2016_РегистрацияОрганизации",
		"РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников");
	ИсполнителиТребований.Вставить("ЕдинаяУпрощеннаяДекларация",          "РегламентированныйОтчетЕУНД");
	ИсполнителиТребований.Вставить("РасчетСуммыУтилизационногоСбора",     "РегламентированныйОтчетУтилизационныйСбор");
	ИсполнителиТребований.Вставить("СоответствиеУсловийТруда",            "РегламентированныйОтчетСоответствиеУсловийТруда");
	ИсполнителиТребований.Вставить("ПереченьЗаявленийОВвозеТоваров",      "РегламентированныйОтчетПереченьЗаявленийОВвозеТоваров");
	
	// Так как поиск в соответствии регистрозависимый, то приведем все ключи к верхнему регистру.
	ИсполнителиТребованийВРег = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ИсполнителиТребований Цикл
		ИсполнителиТребованийВРег.Вставить(ВРег(КлючИЗначение.Ключ), КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат ИсполнителиТребованийВРег;
	
КонецФункции

Функция ПолучитьНаименованиеЗаданияОбновленияШаблонов() Экспорт 
	Возврат НСтр("ru = 'Получение списка XML-шаблонов через веб-сервис Росстата'");
КонецФункции

Функция ПолучитьКлючЗаданияОбновленияШаблонов() Экспорт 
	Возврат "ОбновитьШаблоныСпискомЧерезВебСервисНаСервереВФоне";
КонецФункции

Функция НазваниеИВерсияПрограммы() Экспорт
	Возврат ВРЕГ(Лев(РегламентированнаяОтчетность.НазваниеПрограммы() + " " + РегламентированнаяОтчетность.ВерсияПрограммы(), 40));
КонецФункции
#КонецОбласти