#Область ПрограммныйИнтерфейс

// Проверяет номер банковского счета на соответствие реквизитам выбранного банка.
//   Предназначена для вызова из процедуры ОбработкаПроверкиЗаполнения справочника банковских счетов.
//
// Параметры:
//   Объект - СправочникОбъект.БанковскиеСчетаКонтрагентов
//   ИмяРеквизитаНомерСчета - Строка
//   ИмяРеквизитаБанк - Строка
//   Отказ - Булево
//
Процедура ПроверитьБанковскийСчет(Объект, ИмяРеквизитаНомерСчета, ИмяРеквизитаБанк, Отказ = Неопределено) Экспорт
	НомерСчета = Объект[ИмяРеквизитаНомерСчета];
	Банк = Объект[ИмяРеквизитаБанк];
	Если Не ЗначениеЗаполнено(НомерСчета) Или Не ЗначениеЗаполнено(Банк) Тогда
		Возврат; // Должна сработать проверка заполнения владельца.
	КонецЕсли;
	РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, "Код, КоррСчет");
	РезультатПроверки = РезультатПроверкиНомераСчета(НомерСчета, РеквизитыБанка.Код, РеквизитыБанка.КоррСчет);
	Если Не РезультатПроверки.Успех Тогда
		Текст = РезультатПроверки.Пояснение;
		СообщенияПользователюБЗК.СообщитьОбОшибкеВОбъекте(Отказ, Объект, ИмяРеквизитаНомерСчета, Текст);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// АПК:558-выкл Кандидаты в публичный программный интерфейс.
// АПК:559-выкл Кандидаты в публичный программный интерфейс.

// Проверяет номер расчетного счета на соответствие БИКу и корреспондентскому счету банка.
//
// Параметры:
//   НомерСчета - Строка
//   БИК - Строка
//   КорреспондентскийСчет - Строка
//
// Возвращаемое значение:
//   Структура - описание
//       * Успех - Булево - Если Истина, то номер счета прошел проверку. В пояснении будут подробности.
//       * Пояснение - Строка - Текст для вывода результатов в интерфейсе.
//
Функция РезультатПроверкиНомераСчета(Знач НомерСчета, Знач БИК, Знач КорреспондентскийСчет) Экспорт
	Возврат ПроверкиБЗККлиентСервер.РезультатПроверкиНомераСчета(НомерСчета, БИК, КорреспондентскийСчет);
КонецФункции

// АПК:559-вкл
// АПК:558-вкл

#КонецОбласти

