#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обслуживание полей аванса

Функция РазмерностьАванса(СпособРасчетаАванса) Экспорт
	Возврат РасчетЗарплатыКлиентСерверБазовый.РазмерностьАванса(СпособРасчетаАванса);
КонецФункции

Функция ПредставлениеСпособаРасчетаАванса(СпособРасчетаАванса, СжатыйФормат) Экспорт
	Возврат РасчетЗарплатыКлиентСерверБазовый.ПредставлениеСпособаРасчетаАванса(СпособРасчетаАванса, СжатыйФормат);
КонецФункции

Функция ИменаСпособовРасчетаАванса() Экспорт
	Возврат РасчетЗарплатыКлиентСерверБазовый.ИменаСпособовРасчетаАванса();
КонецФункции

Процедура ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	РасчетЗарплатыКлиентСерверБазовый.ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

Функция ОписаниеТабличнойЧастиКорректировкиВыплаты() Экспорт
	Возврат РасчетЗарплатыКлиентСерверБазовый.ОписаниеТабличнойЧастиКорректировкиВыплаты();
КонецФункции

Функция ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыКорректировкиВыплаты() Экспорт
	Возврат РасчетЗарплатыКлиентСерверБазовый.ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыКорректировкиВыплаты();
КонецФункции

#КонецОбласти
