
////////////////////////////////////////////////////////////////////////////////
// Универсальные методы для формы записи регистра и формы настройки налогов
//
// Серверные методы формы записи регистра сведений НастройкиСистемыНалогообложения
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Запись = Форма.НастройкиСистемыНалогообложения;
	
	Форма.ЭтоЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Запись.Организация);
	
	ПодготовитьФормуНаСервере(Форма);
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
	Запись = Форма.НастройкиСистемыНалогообложения;
	
	Форма.СистемаНалогообложенияПредставление = НастройкиСистемыНалогообложенияФормыКлиентСервер.ИндексСистемыНалогообложения(Запись.СистемаНалогообложения,
		Запись.ПрименяетсяУСНПатент,
		Запись.ПлательщикЕНВД,
		Запись.ОбъектНалогообложенияУСН);
	
	НастройкиСистемыНалогообложенияФормыКлиентСервер.ЗаполнитьСписокВыбораСистемНалогообложения(Форма);
	
	Форма.ПоложенияПереходногоПериодаУСН  = ЗначениеЗаполнено(Запись.ДатаПереходаНаУСН);
	
	НастройкиСистемыНалогообложенияФормыКлиентСервер.УправлениеФормой(Форма);
	
	ТарификацияБП.РазместитьИнформациюОбОграничении(Форма);
	
	Форма.ПрименяетсяТолькоЕНВДПослеОтменыНаМоментОткрытия = НастройкиСистемыНалогообложенияФормыКлиентСервер.ПрименяетсяТолькоЕНВДПослеОтмены(Форма);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Запись = Форма.НастройкиСистемыНалогообложения;
	
	Если Форма.ПоложенияПереходногоПериодаУСН И Не ЗначениеЗаполнено(Запись.ДатаПереходаНаУСН) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Дата перехода на УСН'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДатаПереходаНаУСН", "НастройкиСистемыНалогообложения", Отказ);
	КонецЕсли;
	
	Если Запись.ПрименяетсяОсобыйПорядокНалогообложения
		И Запись.ПлательщикЕНВД
		И Запись.Период >= УчетЕНВДКЛиентСервер.ДатаОтменыЕНВД() Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Основная система налогообложения'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СистемаНалогообложенияПредставление",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяДатаИзменения(Организация, СистемаНалогообложения = Неопределено) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользуетсяНалогНаПрофессиональныйДоход")
		Или СистемаНалогообложения = Перечисления.СистемыНалогообложения.НалогНаПрофессиональныйДоход;
	
КонецФункции

#КонецОбласти

#КонецОбласти