#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
    КонецЕсли;
	
	Если Значение Тогда
		Справочники.ВидыНоменклатуры.СоздатьЭлементыОС();
		КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(
			Справочники.СтатьиЗатрат,
			"ВедетсяУчетОсновныхСредствПростойИнтерфейс");
		КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(
			Справочники.ПрочиеДоходыИРасходы,
			"ВедетсяУчетОсновныхСредствПростойИнтерфейс");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
