#Область СлужебныйПрограммныйИнтерфейс

Процедура ПредставлениеИспользоватьПриИзменении(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Если Форма.Представление.Использовать Тогда
		Элементы.ПредставлениеНаименование.Видимость = Истина;
		Элементы.ПредставлениеТекстОснования.Видимость = Истина;
		Элементы.Наименование.Видимость = Ложь;
		Элементы.ТекстОснования.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеНаименование.Видимость = Ложь;
		Элементы.ПредставлениеТекстОснования.Видимость = Ложь;
		Элементы.Наименование.Видимость = Истина;
		Элементы.ТекстОснования.Видимость = Истина;
	КонецЕсли;
	
	Если Форма.Представление.Использовать
			И Не ЗначениеЗаполнено(Форма.Представление.Наименование)
			И Не ЗначениеЗаполнено(Форма.Представление.ТекстОснования) Тогда
		Форма.Представление.Наименование = Форма.Объект.Наименование;
		Форма.Представление.ТекстОснования = Форма.Объект.ТекстОснования;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти