
#Область ПрограммныйИнтерфейс

//Возвращает структуру параметров обработки штрихкодов.
//
// Возвращаемое значение:
//  Структура - Параметры обработки штрихкодов.
//
Функция ПараметрыОбработкиШтрихкодов() Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Штрихкоды",                               Неопределено);
	ПараметрыОбработки.Вставить("СтруктураДействийСДобавленнымиСтроками",  Неопределено);
	ПараметрыОбработки.Вставить("СтруктураДействийСИзмененнымиСтроками",   Неопределено);
	ПараметрыОбработки.Вставить("ИмяТЧ",                                   "Товары");
	ПараметрыОбработки.Вставить("НеизвестныеШтрихкоды",                    Новый Массив);
	ПараметрыОбработки.Вставить("ШтрихкодыВТЧ",                            Истина);
	ПараметрыОбработки.Вставить("МаркируемаяПродукцияВТЧ",                 Истина);
	
	//Возвращаемые параметры
	ПараметрыОбработки.Вставить("МассивСтрокССериями",          Новый Массив);
	ПараметрыОбработки.Вставить("МассивСтрокСАкцизнымиМарками", Новый Массив);
	ПараметрыОбработки.Вставить("ШтрихкодыТабачнойПродукции", Новый Массив);
	ПараметрыОбработки.Вставить("ТекущаяСтрока",       Неопределено);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
