
#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

// Открывате форму для выбора шаблона для печати этикетки
// 
// Параметры:
// 	ДанныеДляПечати - Структура - Структура данных для печатим
// 	Форма - УправляемаяФорма - Источник (фарма) команды печати
// 	СтандартнаяОбработка - Булево - Признак необходимости выполнять печать БГосИС
// 	ДополнительныеПараметры - Структура - Дополнительные параметры для открытия формы
Процедура ОткрытьФормуВыбораШаблонаЭтикеткиИСМППоДаннымПечати(
	ДанныеДляПечати, Форма, СтандартнаяОбработка, ДополнительныеПараметры=Неопределено) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
