////////////////////////////////////////////////////////////////////////////////////////
// СопоставлениеНоменклатурыКонтрагентовСлужебныйКлиентСервер:
// механизм сопоставления номенклатуры контрагентов с номенклатурой информационной базы.
//
///////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак разных данных между упаковкой и базовой единицей измерения.
//
// Параметры:
//  СвойстваУпаковки - Структура - см. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеСвойстваУпаковкиИБ.
//
// Возвращаемое значение:
//  Булево - признак обозначает, что упаковка отлична от базовой единицы измерения.
//
Функция УпаковкаИБазоваяЕдиницаИзмеренияРазличны(СвойстваУпаковки) Экспорт
	
	Возврат Не ((СвойстваУпаковки.КоличествоУпаковок = 1 И СвойстваУпаковки.КоличествоБазовойЕдиницыИзмерения = 1
		Или СвойстваУпаковки.КоличествоУпаковок = 0 И СвойстваУпаковки.КоличествоБазовойЕдиницыИзмерения = 0)
		И СвойстваУпаковки.НаименованиеУпаковки = СвойстваУпаковки.НаименованиеБазовойЕдиницыИзмерения);
		
КонецФункции

#КонецОбласти

