////////////////////////////////////////////////////////////////////////////////
// АВТОЗАПОЛНЯЕМЫЕ ПОКАЗАТЕЛИ БУХГАЛТЕРСКОЙ ОТЧЕТНОСТИ.
// Модуль предназначен для получения сведений об автозаполняемых показателях
// бухгалтерской отчетности.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция НомерЯчейки(ПрефиксРаздела, КодСтроки, КодГрафы) Экспорт
	
	// Структура номера: ПРРРРРСССССГГ, где
	// П - Префикс      - традиционный префикс, символ "П"
	// Р - НомерРаздела - условный номер раздела (листа, приложения и т.п.)
	// С - НомерСтроки  - условный номер строки
	// Г - НомерГрафы   - условный номер графы (колонки)
	// 
	// П+Р образуют префикс раздела
	
	// в БРО под номер строки зарезервировано 5 символов, но приложением N 4 к Приказу Минфина
	// от 2 июля 2010 г. N 66н предусмотрены 4-х значные коды
	УсловныйНомерСтроки = "0" + КодСтроки;
	
	Возврат ПрефиксРаздела + УсловныйНомерСтроки + КодГрафы;
	
КонецФункции

Процедура УстановитьЗначениеПоказателя(РазделКонтейнера, ПрефиксРаздела, НомерСтроки, КодГрафы, Значение) Экспорт
	
	НомерЯчейки = ЗаполнениеБухгалтерскойОтчетностиПоказатели.НомерЯчейки(ПрефиксРаздела, НомерСтроки, КодГрафы);
	
	// БРО предоставляет контейнер, инициализированный номерами ячеек
	Если Не РазделКонтейнера.Свойство(НомерЯчейки) Тогда
		Возврат;
	КонецЕсли;
	
	// В ходе заполнения нельзя менять тип значения в контейнере
	ТекущееЗначение = РазделКонтейнера[НомерЯчейки];
	ДопустимыйТип   = ТипЗнч(ТекущееЗначение);
	
	Если ТипЗнч(Значение) = ДопустимыйТип Тогда
		РазделКонтейнера.Вставить(НомерЯчейки, Значение);
	Иначе
		// очистим значение
		ОписаниеТипов = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДопустимыйТип));
		РазделКонтейнера.Вставить(НомерЯчейки, ОписаниеТипов.ПривестиЗначение(Значение));
	КонецЕсли;
	
КонецПроцедуры

#Область ОЦИС // Служебная структура отчета об использовании целевых средств

Функция ПрефиксЯчейкиОЦИС() Экспорт
	Возврат "П00010"; // Код формы - "10"
КонецФункции

Функция ГрафыОЦИС(Упрощенная = Ложь) Экспорт
	
	// Описывает графы, содержащие суммовые данные
	
	Графы = Новый Структура;
	Графы.Вставить("ТекущийПериод",                    "04");
	Графы.Вставить("АналогичныйПериодПредыдущегоГода", "05");
	
	Если Упрощенная Тогда
		Графы.ТекущийПериод                    = "03";
		Графы.АналогичныйПериодПредыдущегоГода = "04";
	КонецЕсли;
	
	Возврат Графы;

КонецФункции

Функция УкрупненныеСтрокиУпрощеннойФормыОЦИС() Экспорт
	
	// В упрощенной форме номера некоторых строк определяются динамически -
	// по показателю, имеющему наибольший удельный вес в составе укрупненного показателя.
	// Поэтому используется условный код строки, в который записывается
	// итоговое значение укрупненного показателя и код строки, определенный динамически.
	
	СтрокаЦелевыеПоступления = УсловныйНомерСтрокиЦелевыеПоступления();
	
	УкрупненныеСтроки = Новый Соответствие;
	
	УкрупненныеСтроки.Вставить("6210", СтрокаЦелевыеПоступления);
	УкрупненныеСтроки.Вставить("6215", СтрокаЦелевыеПоступления);
	УкрупненныеСтроки.Вставить("6220", СтрокаЦелевыеПоступления);
	УкрупненныеСтроки.Вставить("6230", СтрокаЦелевыеПоступления);
	
	Возврат УкрупненныеСтроки;
	
КонецФункции

Функция ЗаголовкиУкрупненныхСтрокУпрощеннойФормыОЦИС() Экспорт
	
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить(
		УсловныйНомерСтрокиЦелевыеПоступления(),
		НСтр("ru = 'Взносы и иные целевые поступления'", Метаданные.ОсновнойЯзык.КодЯзыка));
		
	Возврат Заголовки;
	
КонецФункции

Функция ГрафаКодСтрокиУпрощеннойФормыОЦИС() Экспорт
	
	Возврат "02"; // Отображает код укрупненной строки
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв1(ПоказателиОтчета) Экспорт
	
	// Бухгалтерский баланс.
	Префикс = "П00010";
	Графы = "04, 05, 06";
	
	Строки = "1110, 1120, 1130, 1140, 1150, 1160, 1170,
	         |1210, 1220, 1230, 1240, 1250, 1260,
	         |1310, 1320, 1340, 1350, 1360, 1370,
	         |1410, 1420,
	         |1510, 1520, 1530, 1540, 1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	// Отчет о прибылях и убытках.
	Префикс = "П00010";
	Графы = "04, 05";
	
	Строки = "2110, 2120, 2210, 2220, 2310, 2320, 2330,
	         |2340, 2350, 2410, 2421, 2430, 2450, 2460";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв3(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс(ПоказателиОтчета, ПараметрыОтчета);
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОФР(ПоказателиОтчета, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	ИмяСекцииПоказателей = ПараметрыОтчета.СтруктураОтчета.Баланс.ИмяСекцииПоказателей;
	
	Если ИмяСекцииПоказателей = "Баланс_КО" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "Баланс_НКО" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "Баланс_2012Кв1" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв1(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "БалансНКО_2012Кв1" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв1(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "Баланс_2012Кв4" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "БалансНКО_2012Кв4" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "Баланс_2012Кв4_2" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4_2(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "БалансНКО_2012Кв4_2" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4_2(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "Баланс_2012Кв4_3" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4_3(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ИмяСекцииПоказателей = "БалансНКО_2012Кв4_3" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4_3(ПоказателиОтчета, ПараметрыОтчета);
	Иначе
		ЗаписьЖурналаРегистрации("Заполнение бухгалтерской отчетности", УровеньЖурналаРегистрации.Ошибка, , , "Неизвестный идентификатор набора автозаполняемых показателей бухгалтерского баланса - """ + ИмяСекцииПоказателей + """");
		ВызватьИсключение "Неизвестный идентификатор набора автозаполняемых показателей для бухгалтерского баланса";
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураОтчета.ОПУ.ИмяСекцииПоказателей = "ФормаОтчетаНеЕНВД" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОФР(ПоказателиОтчета, ПараметрыОтчета);
	ИначеЕсли ПараметрыОтчета.СтруктураОтчета.ОПУ.ИмяСекцииПоказателей = "ФормаОтчетаЕНВД" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОФРЕНВД(ПоказателиОтчета, ПараметрыОтчета);
	Иначе
		ВызватьИсключение "Неизвестный идентификатор набора автозаполняемых показателей для отчета о прибылях и убытках";
	КонецЕсли;
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОИК(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОДДС(ПоказателиОтчета, ПараметрыОтчета);
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения1(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения2(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения4(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения5(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения6(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения7(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения8(ПоказателиОтчета, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	ИмяСекцииПоказателей = ПараметрыОтчета.СтруктураОтчета.Баланс.ИмяСекцииПоказателей;
	
	// Бухгалтерский баланс.
	Если ИмяСекцииПоказателей = "Баланс" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_Баланс(ПоказателиОтчета, ПараметрыОтчета);
		
	ИначеЕсли ИмяСекцииПоказателей = "БалансНКО" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_БалансНКО(ПоказателиОтчета, ПараметрыОтчета);
		
	КонецЕсли;
	
	// Отчет о финансовых результатах.
	Если ПараметрыОтчета.СтруктураОтчета.ОФР.ИмяСекцииПоказателей = "ОФР_НеЕНВД" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФР(ПоказателиОтчета, ПараметрыОтчета);
		
	ИначеЕсли ПараметрыОтчета.СтруктураОтчета.ОФР.ИмяСекцииПоказателей = "ОФР_ЕНВД" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФРЕНВД(ПоказателиОтчета, ПараметрыОтчета);
		
	ИначеЕсли ПараметрыОтчета.СтруктураОтчета.ОФР.ИмяСекцииПоказателей = "ОФР_НеЕНВД_2020Кв1" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФР_2020Кв1(ПоказателиОтчета, ПараметрыОтчета);
		
	ИначеЕсли ПараметрыОтчета.СтруктураОтчета.ОФР.ИмяСекцииПоказателей = "ОФР_ЕНВД_2020Кв1" Тогда
		ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФРЕНВД_2020Кв1(ПоказателиОтчета, ПараметрыОтчета);
		
	КонецЕсли;
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОИК(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОДДС(ПоказателиОтчета, ПараметрыОтчета);
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения1(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения2(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения4(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2019Кв4_Пояснения5(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения6(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения7(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения8(ПоказателиОтчета, ПараметрыОтчета);
	
	// Отчет о целевом использовании средств
	ДобавитьПоказателиБО_ОЦИС(ПоказателиОтчета, Ложь);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_МПФормаОтчета2012Кв4(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04, 05";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0007, 0008, 0009, 0010, 0011, 0012";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Префикс = "П00002";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0006";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_МПФормаОтчета2012Кв4_2(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Префикс = "П00001";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04, 05";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0007, 0008, 0009, 0010, 0011, 0012";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Префикс = "П00002";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0006";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОИК(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОДДС(ПоказателиОтчета, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_МПФормаОтчета2015Кв4(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Префикс = "П00001";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04, 05";
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.ЭтоБалансНекоммерческойОрганизации = Истина Тогда
		Строки = "0001, 0002, 0003, 0004, 0005, 0071, 0072, 0008, 0009, 0010, 0011, 0012";
	Иначе
		Строки = "0001, 0002, 0003, 0004, 0005, 0007, 0008, 0009, 0010, 0011, 0012";
	КонецЕсли;
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Префикс = "П00002";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0006";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОИК(ПоказателиОтчета, ПараметрыОтчета);
	ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОДДС(ПоказателиОтчета, ПараметрыОтчета);
	
	// Отчет о целевом использовании средств
	ДобавитьПоказателиБО_ОЦИС(ПоказателиОтчета, Истина);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_СОНКОФормаОтчета2012Кв4(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Префикс = "П00001";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "03, 04";
	Иначе
		Графы = "03, 04, 05, 06";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0006, 0007, 0008, 0009, 0010";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Префикс = "П00002";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "02, 03";
	Иначе
		Графы = "02, 03, 04";
	КонецЕсли;
	
	Строки = "0001, 0002, 0003, 0004, 0005, 0006";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

#Область ПоказателиФормаОтчета2011Кв4

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130, 11301, 11302, 11303, 11304, 11305, 11306, 11307, 11308,
	         |1140, 11401, 11402, 11403, 11404,
	         |1150, 11501,
	         |1160,
	         |1170, 11701, 11702, 11703";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1430,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130, 11301, 11302, 11303, 11304, 11305, 11306, 11307, 11308,
	         |1140, 11401, 11402, 11403, 11404,
	         |1150, 11501,
	         |1160,
	         |1170, 11701, 11702, 11703";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310, 1320, 1350, 1360, 1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1430,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв1(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв1(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1350,
	         |1360,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610, 12611";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1350,
	         |1360,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4_2(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4_2(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12605, 12606, 12607, 12608, 12609";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1350,
	         |1360,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15302, 15303, 15304, 15305,
	         |1540,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Баланс2012Кв4_3(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508, 11509,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312, 12313,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540, 15401, 15402,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_БалансНКО2012Кв4_3(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508, 11509,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312, 12313,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1350,
	         |1360,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15302, 15303, 15304, 15305,
	         |1540, 15401, 15402,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОФР(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = Ложь;
	ПрименениеУСН1 = Ложь;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН0") Тогда
		ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН1") Тогда
		ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	КонецЕсли;
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05";
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511, 23512,
	         |23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522, 23523, 23524,
	         |23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533, 23534";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	НомерСтроки = "02421";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02430";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02450";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24601";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24603";
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2016-01-01'
	   И НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2017-01-01'
	   И НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОФРЕНВД(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = Ложь;
	ПрименениеУСН1 = Ложь;
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН0") Тогда
		ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН1") Тогда
		ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	КонецЕсли;
	
	НачалоПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	КонецПериодаОтчета  = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	
	НачалоПериодаПредыдущегоГода = ДобавитьМесяц(НачалоПериодаОтчета, -12);
	КонецПериодаПредыдущегоГода  = КонецМесяца(ДобавитьМесяц(КонецПериодаОтчета, -12));
	
	ПрименениеЕНВД_0 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
		Организация, НачалоПериодаОтчета, КонецПериодаОтчета);
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(НачалоПериодаОтчета);
	
	ГрафыЕНВД = "";
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = "04";
		КонецЕсли;
		
	Иначе
		Графы = "04, 05";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 04";
		КонецЕсли;
		ПрименениеЕНВД_1 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
			Организация, НачалоПериодаПредыдущегоГода, КонецПериодаПредыдущегоГода);
		Если ПрименениеЕНВД_1 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 05";
		КонецЕсли;
		ГрафыЕНВД = Сред(ГрафыЕНВД, 3);
		
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511,
	         |23512, 23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522,
	         |23523, 23524, 23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24601, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	НомерСтроки = "02421";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02430";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02450";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24603";
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2016-01-01'
	   И НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2017-01-01'
	   И НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	// Показатели для раздельного отражения деятельности с основной системой налогообложения и деятельности, облагаемой ЕНВД.
	Строки = "21101, 21102, 21201, 21202, 22101, 22102, 22201, 22202";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, ГрафыЕНВД);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОИК(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100310003", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100310004", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100310005", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100310006", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100310007", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100320003", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100320004", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100320005", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100320006", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100320007", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100321107", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100321205", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100322107", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100322205", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100322707", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100324006", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340003", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340004", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340006", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340103", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340104", Истина, Истина);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100340106", Истина, Истина);
		
	КонецЕсли;
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100330003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100330004", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100330005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100330006", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100330007", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100331107", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100331205", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100332107", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100332205", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100332707", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100334006", Истина, Истина);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_ОДДС(ПоказателиОтчета, ПараметрыОтчета) Экспорт
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "03";
	Иначе
		Графы = "03, 04";
	КонецЕсли;
	
	Строки = "4111, 4112, 4113, 4119, 4121, 4122, 4123, 4124, 4129, 4211, 4212, 4213, 4214, 4219,
	         |4221, 4222, 4223, 4224, 4229, 4311, 4312, 4313, 4314, 4319, 4321, 4322, 4323, 4329, 4450, 4490";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения1(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5110", "04,05,06,07,08,09,11,12,13,14");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5130", "04,05");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5150", "04,05,06,07,08,09,10,11");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5170", "04,05,06,07,08");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5190", "04,05,06,07,08");
	КонецЕсли;
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5100", "04,05,06,07,08,09,11,12,13,14");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5130", "03");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5140", "04,05,06,07,08,09,10,11");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5160", "04,05,06,07,08");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5180", "04,05,06,07,08");
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения2(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5210", "04,05,06,07,08,09,10,11,12,13");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5230", "04,05,06,07,08,09,10,11,12,13");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5250", "04,05,06,07,08");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5260", "04");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5281", "04,05");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5283", "04,05");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5284", "04,05");
	КонецЕсли;
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5200", "04,05,06,07,08,09,10,11,12,13");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5220", "04,05,06,07,08,09,10,11,12,13");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5240", "04,05,06,07,08");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5260", "03");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5281", "03");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5283", "03");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5284", "03");
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения4(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5420", "04,05,06,07,08,09,11,12");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5421", "04,05,06,07,08,09,10,11,12");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5422", "04,05,06,07,08,09,10,11,12");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5423", "04,05,06,07,08,09,10,11,12");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5424", "04,06,07,11");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5425", "04,05,06,07,08,09,11,12");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5426", "04,06,07,11");
	КонецЕсли;
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5400", "04,05,06,07,08,09,11,12");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5401", "04,05,06,07,08,09,10,11,12");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5402", "04,05,06,07,08,09,10,11,12");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5403", "04,05,06,07,08,09,10,11,12");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5404", "04,06,07,11");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5405", "04,05,06,07,08,09,11,12");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5406", "04,06,07,11");
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения5(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5522", "04,05,06,08,09,10,12,13,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5523", "04,05,06,08,09,10,12,13");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5524", "04,05,06,08,09,10,12,13,21,22");
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5531", "04,05,06,07,08,09,10,12,13,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5532", "04,05,06,07,08,09,10,12,13,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5533", "04,05,06,07,08,09,10,12,13");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5534", "04,05,06,07,08,09,10,12,13,21,22");
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5572", "04,05,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5573", "04,05,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5574", "04,05,07,08,10,21,22");
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5580", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5581", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5582", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5583", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5584", "04,05,06,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5585", "04,05,06,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5586", "04,05,06,07,08,10,21,22");
		
	КонецЕсли;
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5502", "04,05,06,08,09,10,12,13,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5503", "04,05,06,08,09,10,12,13");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5504", "04,05,06,08,09,10,12,13,21,22");
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5511", "04,05,06,07,08,09,10,12,13,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5512", "04,05,06,07,08,09,10,12,13,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5513", "04,05,06,07,08,09,10,12,13");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5514", "04,05,06,07,08,09,10,12,13,21,22");
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5552", "04,05,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5553", "04,05,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5554", "04,05,07,08,10,21,22");
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5560", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5561", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5562", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5563", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5564", "04,05,06,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5565", "04,05,06,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5566", "04,05,06,07,08,10,21,22");
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения6(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "03";
	Иначе
		Графы = "03, 04";
	КонецЕсли;
	
	Строки = "5610, 5620, 5630, 5640, 5650";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	НачалоПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	КонецПериодаОтчета  = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	НачалоПредшествующегоПериодаОтчета = ДобавитьМесяц(НачалоПериодаОтчета, -12);
	КонецПредшествующегоПериодаОтчета  = ДобавитьМесяц(КонецПериодаОтчета, -12);
	
	Если ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.РасходыУчитываютсяПоЭлементамЗатрат(НачалоПериодаОтчета, КонецПериодаОтчета, Организация) Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100566503", Истина, Истина);
	Иначе
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100567003", Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100568003", Истина, Истина);
	КонецЕсли;
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Если ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.РасходыУчитываютсяПоЭлементамЗатрат(НачалоПредшествующегоПериодаОтчета, КонецПредшествующегоПериодаОтчета, Организация) Тогда
			РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100566504", Истина, Истина);
		Иначе
			РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100567004", Истина, Истина);
			РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100568004", Истина, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения7(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5700", "03,04,05,06,07");
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2011Кв4_Пояснения8(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	Если РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		Графы = "03";
	Иначе
		Графы = "03, 04, 05";
	КонецЕсли;
	
	Строки = "5800, 5810";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
КонецПроцедуры

#КонецОбласти

#Область ПоказателиФормаОтчета2019Кв1

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_Баланс(ПоказателиОтчета, ПараметрыОтчета)
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	Префикс = "П00010";
	
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508, 11509,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312, 12313,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1320,
	         |1340, 13401, 13402, 13403,
	         |1350,
	         |1360, 13601, 13602,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15301, 15302, 15303, 15304, 15305,
	         |1540, 15401, 15402,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	// Разделение авансов по строкам актива бухгалтерского баланса.
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	мДатаКонцаПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	КонецОтчетногоПериода = мДатаКонцаПериодаОтчета;
	КонецОтчетногоПериода_1 = КонецГода(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -12));
	КонецОтчетногоПериода_2 = КонецГода(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -24));
	
	РазделятьАвансы = РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, КонецОтчетногоПериода);
	
	Если РазделятьАвансы Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "04");
	КонецЕсли;
	
	Если НЕ ЭтоРасширенныйПериодОтчета 
		И РазделятьАвансы Тогда
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "05");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "06");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_БалансНКО(ПоказателиОтчета, ПараметрыОтчета)
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	Префикс = "П00010";
	
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05, 06";
	КонецЕсли;
	
	Строки = "1110, 11101, 11102,
	         |1120, 11201, 11202,
	         |1130,
	         |1140,
	         |1150, 11501, 11502, 11503, 11504, 11505, 11506, 11507, 11508, 11509,
	         |1160, 11601, 11602, 11603, 11604,
	         |1170, 11701,
	         |1180,
	         |1190, 11901, 11902, 11903";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1210, 12101, 12102, 12103, 12104, 12105, 12106, 12107, 12108, 12109, 12110, 12111, 12112,
	         |1220, 12201, 12202, 12203, 12204, 12205, 12206, 12207,
	         |1230, 12301, 12302, 12303, 12304, 12305, 12306, 12307, 12308, 12309, 12310, 12311, 12312, 12313,
	         |1240, 12401, 12402, 12403, 12404, 12405, 12406, 12407,
	         |1250, 12501, 12502, 12503, 12504, 12505, 12506, 12507, 12508, 12509, 12510, 12511, 12512,
	         |1260, 12601, 12602, 12603, 12604, 12606, 12607, 12608, 12609, 12610";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1310,
	         |1350,
	         |1360,
	         |1370";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1410, 14101, 14102, 14103, 14104,
	         |1420,
	         |1450";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "1510, 15101, 15102, 15103, 15104, 15105, 15106, 15107, 15108, 15109, 15110, 15111, 15112,
	         |1520, 15201, 15202, 15203, 15204, 15205, 15206, 15207, 15208, 15209,
	         |1530, 15302, 15303, 15304, 15305,
	         |1540, 15401, 15402,
	         |1550";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	// Разделение авансов по строкам актива бухгалтерского баланса.
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	мДатаКонцаПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	КонецОтчетногоПериода = мДатаКонцаПериодаОтчета;
	КонецОтчетногоПериода_1 = КонецГода(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -12));
	КонецОтчетногоПериода_2 = КонецГода(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -24));
	
	РазделятьАвансы = РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, КонецОтчетногоПериода);
	
	Если РазделятьАвансы Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "04");
	КонецЕсли;
	
	Если НЕ ЭтоРасширенныйПериодОтчета 
		И РазделятьАвансы Тогда
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "05");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "11904, 12611, 12612", "06");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФР(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = Ложь;
	ПрименениеУСН1 = Ложь;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН0") Тогда
		ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН1") Тогда
		ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	КонецЕсли;
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05";
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511, 23512,
	         |23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522, 23523, 23524,
	         |23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533, 23534";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	НомерСтроки = "02421";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02430";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02450";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24601";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24603";
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2016-01-01'
	   И НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета >= '2017-01-01'
	   И НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФРЕНВД(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = Ложь;
	ПрименениеУСН1 = Ложь;
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН0") Тогда
		ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН1") Тогда
		ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	КонецЕсли;
	
	НачалоПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	КонецПериодаОтчета  = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	
	НачалоПериодаПредыдущегоГода = ДобавитьМесяц(НачалоПериодаОтчета, -12);
	КонецПериодаПредыдущегоГода  = КонецМесяца(ДобавитьМесяц(КонецПериодаОтчета, -12));
	
	ПрименениеЕНВД_0 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
		Организация, НачалоПериодаОтчета, КонецПериодаОтчета);
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(НачалоПериодаОтчета);
	
	ГрафыЕНВД = "";
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = "04";
		КонецЕсли;
		
	Иначе
		Графы = "04, 05";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 04";
		КонецЕсли;
		ПрименениеЕНВД_1 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
			Организация, НачалоПериодаПредыдущегоГода, КонецПериодаПредыдущегоГода);
		Если ПрименениеЕНВД_1 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 05";
		КонецЕсли;
		ГрафыЕНВД = Сред(ГрафыЕНВД, 3);
		
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511,
	         |23512, 23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522,
	         |23523, 23524, 23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24601, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	НомерСтроки = "02421";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02430";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "02450";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	НомерСтроки = "24603";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "04", Истина, Истина);
	КонецЕсли;
	
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + НомерСтроки + "05", Истина, Истина);
	КонецЕсли;
	
	// Показатели для раздельного отражения деятельности с основной системой налогообложения и деятельности, облагаемой ЕНВД.
	Строки = "21101, 21102, 21201, 21202, 22101, 22102, 22201, 22202";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, ГрафыЕНВД);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФР_2020Кв1(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = Ложь;
	ПрименениеУСН1 = Ложь;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН0") Тогда
		ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	КонецЕсли;
	
	Если ПараметрыОтчета.СтруктураРеквизитовФормы.Свойство("ПрименениеУСН1") Тогда
		ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	КонецЕсли;
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	КонецПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	КонецПериодаПредыдущегоГода = КонецМесяца(ДобавитьМесяц(КонецПериодаОтчета, -12));
	
	ПрименениеПБУ18_0 =
		РегламентированнаяОтчетностьПереопределяемый.ПрименяетсяПБУ18(Организация, КонецПериодаОтчета);
	ПрименениеПБУ18_1 =
		РегламентированнаяОтчетностьПереопределяемый.ПрименяетсяПБУ18(Организация, КонецПериодаПредыдущегоГода);
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
	Иначе
		Графы = "04, 05";
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511, 23512,
	         |23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522, 23523, 23524,
	         |23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533, 23534";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24601, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Графа = "04";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02411" + Графа, Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02412" + Графа, Истина, Истина);
	КонецЕсли;
	
	Если ПрименениеПБУ18_0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02530" + Графа, Истина, Истина);
	КонецЕсли;
	
	Графа = "05";
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02411" + Графа, Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02412" + Графа, Истина, Истина);
	КонецЕсли;
	
	Если ПрименениеПБУ18_1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02530" + Графа, Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв1_ОФРЕНВД_2020Кв1(ПоказателиОтчета, ПараметрыОтчета)
	
	Префикс = "П00010";
	
	ПрименениеУСН0 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН0;
	ПрименениеУСН1 = ПараметрыОтчета.СтруктураРеквизитовФормы.ПрименениеУСН1;
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	
	НачалоПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	КонецПериодаОтчета  = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	
	НачалоПериодаПредыдущегоГода = ДобавитьМесяц(НачалоПериодаОтчета, -12);
	КонецПериодаПредыдущегоГода  = КонецМесяца(ДобавитьМесяц(КонецПериодаОтчета, -12));
	
	ПрименениеПБУ18_0 =
		РегламентированнаяОтчетностьПереопределяемый.ПрименяетсяПБУ18(Организация, КонецПериодаОтчета);
	ПрименениеПБУ18_1 =
		РегламентированнаяОтчетностьПереопределяемый.ПрименяетсяПБУ18(Организация, КонецПериодаПредыдущегоГода);
	
	ПрименениеЕНВД_0 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
		Организация, НачалоПериодаОтчета, КонецПериодаОтчета);
	
	ЭтоРасширенныйПериодОтчета = РасширенныйПериодОтчета(НачалоПериодаОтчета);
	
	ГрафыЕНВД = "";
	Если ЭтоРасширенныйПериодОтчета Тогда
		Графы = "04";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = "04";
		КонецЕсли;
		
	Иначе
		Графы = "04, 05";
		
		Если ПрименениеЕНВД_0 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 04";
		КонецЕсли;
		ПрименениеЕНВД_1 = РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(
			Организация, НачалоПериодаПредыдущегоГода, КонецПериодаПредыдущегоГода);
		Если ПрименениеЕНВД_1 Тогда
			ГрафыЕНВД = ГрафыЕНВД + ", 05";
		КонецЕсли;
		ГрафыЕНВД = Сред(ГрафыЕНВД, 3);
		
	КонецЕсли;
	
	Строки = "2110, 2120,
	         |2210, 2220,
	         |2310, 23101, 23102, 23103,
	         |2320, 23201, 23202, 23203,
	         |2330, 23301, 23302";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2340,
	         |23401, 23402, 23403, 23404, 23405, 23406, 23407, 23408, 23409, 23410, 23411, 23412, 23413,
	         |23414, 23415, 23416, 23417, 23418, 23419, 23420, 23421, 23422, 23423, 23424, 23425, 23426";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2350,
	         |23501, 23502, 23503, 23504, 23505, 23506, 23507, 23508, 23509, 23510, 23511,
	         |23512, 23513, 23514, 23515, 23516, 23517, 23518, 23519, 23520, 23521, 23522,
	         |23523, 23524, 23525, 23526, 23527, 23528, 23529, 23530, 23531, 23532, 23533";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Строки = "2410,
	         |2460, 24601, 24602,
	         |2510, 25101, 25102";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы);
	
	Графа = "04";
	Если НЕ ПрименениеУСН0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02411" + Графа, Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02412" + Графа, Истина, Истина);
	КонецЕсли;
	
	Если ПрименениеПБУ18_0 Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02530" + Графа, Истина, Истина);
	КонецЕсли;
	
	Графа = "05";
	Если НЕ ПрименениеУСН1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02411" + Графа, Истина, Истина);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02412" + Графа, Истина, Истина);
	КонецЕсли;
	
	Если ПрименениеПБУ18_1 И НЕ ЭтоРасширенныйПериодОтчета Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, Префикс + "02530" + Графа, Истина, Истина);
	КонецЕсли;
	
	// Показатели для раздельного отражения деятельности с основной системой налогообложения и деятельности, облагаемой ЕНВД.
	Строки = "21101, 21102, 21201, 21202, 22101, 22102, 22201, 22202";
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, ГрафыЕНВД);
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ОЦИС(ПоказателиОтчета, Упрощенная = Ложь)
	
	Префикс = ПрефиксЯчейкиОЦИС();
	
	Графы = Новый Массив;
	Для Каждого ОписаниеГраф Из ГрафыОЦИС(Упрощенная) Цикл
		Графы.Добавить(ОписаниеГраф.Значение);
	КонецЦикла;
	
	Строки  = "";
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ЗаполнитьОписаниеСтрокОЦИС(Строки, Упрощенная);
	
	ОсновныеГрафыСтрокой = СтрСоединить(Графы, ",");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, ОсновныеГрафыСтрокой);
	
	// В упрощенной форме используется укрупненная строка с переменным кодом, записываемым в отдельную графу
	Если Упрощенная И Не ПустаяСтрока(Строки) Тогда
		Графы.Добавить(ГрафаКодСтрокиУпрощеннойФормыОЦИС());
		ГрафыУпрощенногоОтчетаСтрокой = СтрСоединить(Графы, ",");
		ВставитьПоказателиВСтруктуру(
			ПоказателиОтчета,
			Префикс,
			УсловныйНомерСтрокиЦелевыеПоступления(),
			ГрафыУпрощенногоОтчетаСтрокой);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиБО_ФормаОтчета2019Кв4_Пояснения5(ПоказателиОтчета, ПараметрыОтчета)
	
	Организация = ПараметрыОтчета.СтруктураРеквизитовФормы.Организация;
	мДатаКонцаПериодаОтчета = ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	КонецОтчетногоПериода = мДатаКонцаПериодаОтчета;
	
	ЗаполнятьСтроку5503 = НЕ РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, КонецОтчетногоПериода);
	ЗаполнятьСтроку5523 = НЕ РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(Организация, КонецОтчетногоПериода);
	
	Префикс = "П00010";
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5502", "04,05,06,08,09,10,12,13,21,22");
	Если ЗаполнятьСтроку5503 Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5503", "04,05,06,08,09,10,12,13");
	КонецЕсли;
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5504", "04,05,06,08,09,10,12,13,21,22");
	
	// Идентификаторы строк 5510-5513 сдвинуты относительно печатной формы на единицу.
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5511", "04,05,06,07,08,09,10,12,13,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5512", "04,05,06,07,08,09,10,12,13,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5513", "04,05,06,07,08,09,10,12,13");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5514", "04,05,06,07,08,09,10,12,13,21,22");
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5552", "04,05,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5553", "04,05,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5554", "04,05,07,08,10,21,22");
	
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5560", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5561", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5562", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5563", "04,05,06,07,08,10,21,22");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5564", "04,05,06,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5565", "04,05,06,07,08,10");
	ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5566", "04,05,06,07,08,10,21,22");
	
	Если НЕ РасширенныйПериодОтчета(ПараметрыОтчета.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5522", "04,05,06,08,09,10,12,13,21,22");
		Если ЗаполнятьСтроку5523 Тогда
			ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5523", "04,05,06,08,09,10,12,13");
		КонецЕсли;
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5524", "04,05,06,08,09,10,12,13,21,22");
		
		// Идентификаторы строк 5530-5533 сдвинуты относительно печатной формы на единицу.
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5531", "04,05,06,07,08,09,10,12,13,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5532", "04,05,06,07,08,09,10,12,13,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5533", "04,05,06,07,08,09,10,12,13");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5534", "04,05,06,07,08,09,10,12,13,21,22");
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5572", "04,05,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5573", "04,05,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5574", "04,05,07,08,10,21,22");
		
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5580", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5581", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5582", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5583", "04,05,06,07,08,10,21,22");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5584", "04,05,06,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5585", "04,05,06,07,08,10");
		ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, "5586", "04,05,06,07,08,10,21,22");
		
	КонецЕсли;
	
КонецПроцедуры

Функция УсловныйНомерСтрокиЦелевыеПоступления() Экспорт
	Возврат "6201";
КонецФункции

#КонецОбласти

Процедура ВставитьПоказателиВСтруктуру(ПоказателиОтчета, Префикс, Строки, Графы)
	
	ПереченьСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строки);
	ПереченьГраф  = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Графы);
	
	Для Каждого НомерСтроки Из ПереченьСтрок Цикл
		Строка = СокрЛП(НомерСтроки);
		Строка = Лев("00000", 5 - СтрДлина(Строка)) + Строка;
		Для Каждого Графа Из ПереченьГраф Цикл
			ИмяПоказателя = Префикс + Строка + СокрЛП(Графа);
			РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, ИмяПоказателя, Истина, Истина);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#Область ОберткиФункцийИПроцедур

Функция РасширенныйПериодОтчета(ДатаНачалаПериодаОтчета)
	
	Возврат ЗаполнениеБухгалтерскойОтчетности.РасширенныйПериодОтчета(ДатаНачалаПериодаОтчета);
	
КонецФункции

#КонецОбласти

#КонецОбласти
