
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуСотрудникаНаРеквизите(Сотрудник, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Сотрудник);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаЭлемента", ПараметрыФормы, , , , , ОбработчикЗакрытияФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуРуководителя(Организация, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель");
	
	ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуГлБухгалтера(Организация, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер");
	
	ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы)
	
	ЗначенияЗаполнения = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо,Должность",
		Организация,
		ОтветственноеЛицо,
		ОбщегоНазначенияБПВызовСервера.ПодобратьВероятнуюДолжностьОтветственногоЛица(ОтветственноеЛицо));
	
	РуководительКлючЗаписи = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПолучитьКлючЗаписиРегистраОтветственныеЛицаОрганизаций(Организация,ОтветственноеЛицо); 	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",			РуководительКлючЗаписи);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",	ЗначенияЗаполнения);
	
	ОткрытьФорму("РегистрСведений.ОтветственныеЛицаОрганизаций.ФормаЗаписи", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


