#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяРеквизита(Идентификатор) Экспорт
	
	Возврат "ДополнительныйПоказатель_" + Идентификатор;
	
КонецФункции

Функция ИмяАдресаЗначений(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_АдресЗначений";
	
КонецФункции

Функция ИмяПредставления(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Представление";
	
КонецФункции

Функция ИмяПереключателя(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Переключатель";
	
КонецФункции

Функция ИмяСвязанногоЭлементаПереключателя(ИмяПереключателя) Экспорт
	
	Возврат СтрЗаменить(ИмяПереключателя, "_Переключатель", "");
	
КонецФункции

Функция ИмяЗаглушки(ИмяЭлемента) Экспорт
	
	Возврат ИмяЭлемента + "_Заглушка";
	
КонецФункции

Функция РазделительЭлементовСтроки() Экспорт
	
	Возврат "#!#";
	
КонецФункции

Функция НаименованиеПравилаФинОтчетности(Получатель, ПредставлениеКомплекта, Организация) Экспорт
	
	Возврат СтрШаблон("%1 - %2 (%3)", Получатель, ПредставлениеКомплекта, Организация);
	
КонецФункции

Функция СсылкаНаИнструкциюПоУстановкеЭлектроннойПодписи() Экспорт
	
	Возврат "https://its.1c.ru/bmk/metod81_csp_setup";
	
КонецФункции

Функция СсылкаНаИнструкцииПоРаботеСПрограммамиЭлектроннойПодписи() Экспорт
	
	Возврат "https://its.1c.ru/bmk/metod81_crypt";
	
КонецФункции

Функция СсылкаОписание1СПодпись() Экспорт
	
	Возврат "https://portal.1c.ru/applications/31";
	
КонецФункции

#КонецОбласти