#Область ПрограммныйИнтерфейс

// Возвращает строку пустого глобального уникального идентификатора GUID.
//
// Возвращаемое значение:
//  Строка - строка, содержащая пустой уникальный идентификатор.
//
Функция ПустойУникальныйИдентификатор() Экспорт
	Возврат "00000000-0000-0000-0000-000000000000" // АПК:1297 Не локализуется
КонецФункции

// Из переданной строки создает новую, содержащую только цифры.
// Иные символы отбрасываются.
//
// Параметры:
//  Значение - Строка - исходная строка.
//
// Возвращаемое значение:
//   Строка - строка, содержащая только цифры.
//
Функция СкопироватьЦифры(Знач Значение) Экспорт
	Возврат СкопироватьСимволы(Значение, "0123456789") // АПК:1297 Не локализуется, перечень всех цифр
КонецФункции

// Из переданной строки создает новую, содержащую только указанные символы.
// Иные символы отбрасываются.
//
// Параметры:
//  Значение - Строка - исходная строка.
//  Символы  - Строка - допустимые символы.
//
// Возвращаемое значение:
//   Строка - строка, содержащая только указанные символы.
//
Функция СкопироватьСимволы(Знач Значение, Знач Символы) Экспорт
	// Справа налево:
	// 1. Разбиваем исходную строку, используя допустимые символы как разделители.
	//    Получим массив со строками, состоящими из недопустимых символов.
	// 2. Соединяем недопустимые символы в строку лишних букв.
	// 3. Разбиваем исходную строку, используя лишние символы как разделители.
	//    Получим массив со строками, состоящими из допустимых символов.
	// 4. Соединяем разрешенные символы в итоговую строку.
	Возврат СтрСоединить(СтрРазделить(Значение, СтрСоединить(СтрРазделить(Значение, Символы))))
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Разделяет строку с именами свойств на части по разделителю-запятой.
//
// Параметры:
//	СписокСвойств - Строка - имена свойств,  разделенные запятыми. 
//
// Возвращаемое значение:
//	Булево - Массив, строки, которые получились в результате разделения списка свойств.
// 
Функция РазделитьИменаСвойств(СписокСвойств) Экспорт
	ИменаСвойств = Новый Массив;
	Для Каждого Свойство Из Новый Структура(СписокСвойств) Цикл
	    ИменаСвойств.Добавить(Свойство.Ключ)
	КонецЦикла;	
	Возврат ИменаСвойств
КонецФункции

// Получает числовой номер объекта.
//
// Параметры:
//    НомерОбъекта - Строка - Строковый номер объекта.
//
// Возвращаемое значение:
//     Неопределено - Не удалось преобразовать номер объекта в число.
//     Число - Числовой номер объекта.
//
Функция НомерОбъектаЧислом(Знач НомерОбъекта) Экспорт
	Номер = СокрЛП(НомерОбъекта);
	
	// Удаление пользовательских префиксов.
	Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьПользовательскиеПрефиксыИзНомераОбъекта(Номер);
	
	// Удаление лидирующих нулей.
	Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер);
	
	// Удаление префикса организации и префикса информационной базы.
	Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Номер, Истина, Истина);
	
	Возврат СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Номер);
КонецФункции

// Убирает цифры из строки.
//
// Параметры:
//    Строка - Исходная строка.
//
// Возвращаемое значение:
//     Строка - Строка без цифр.
//
Функция УдалитьЦифрыИзСтроки(Строка) Экспорт
	Возврат СтрСоединить(СтрРазделить(Строка, "0123456789", Ложь), "");
КонецФункции

#КонецОбласти
