Функция НайтиПлощадкуПоКодуГЗ (РеквизитыПлощадки) Экспорт
	
	НайденнаяПлощадка = Справочники.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка.ПустаяСсылка();
	
	GZcode = Неопределено;
	
	Если Не РеквизитыПлощадки.Свойство("GZcode", GZcode) Тогда
		Возврат НайденнаяПлощадка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГЗ_ETP_ЭлектроннаяТорговаяПлощадка.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка КАК ГЗ_ETP_ЭлектроннаяТорговаяПлощадка
		|ГДЕ
		|	ГЗ_ETP_ЭлектроннаяТорговаяПлощадка.GZcode = &GZcode";
	
	Запрос.УстановитьПараметр("GZcode", РеквизитыПлощадки.GZcode);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		НайденнаяПлощадка = Выборка.Ссылка;
	КонецЕсли;
		
	Возврат НайденнаяПлощадка;

КонецФункции
