#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОбособленноеПодразделение.Видимость = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	
	РежимПовторногоВыбораВидаОрганизации = Параметры.РежимПовторногоВыбораВидаОрганизации;
	РежимПовторногоВыбораСистемыНалогообложения = Параметры.РежимПовторногоВыбораСистемыНалогообложения;
	
	РежимПростогоИнтерфейса = Параметры.Свойство("РежимПростогоИнтерфейса");
	
	Если Параметры.Свойство("ВидОрганизации") Тогда
		ВидОрганизации = Параметры.ВидОрганизации;
	КонецЕсли;
	
	ПараметрыУчетнойПолитики = Новый Структура;
	ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.ПустаяСсылка());
	ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН", Перечисления.ОбъектыНалогообложенияПоУСН.ПустаяСсылка());
	ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД", Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент", Ложь);
	
	Если Параметры.Свойство("СистемаНалогообложения") Тогда
		ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения", Параметры.СистемаНалогообложения);
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектНалогообложенияУСН") Тогда
		ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН", Параметры.ОбъектНалогообложенияУСН);
	КонецЕсли;
	
	Если Параметры.Свойство("ПлательщикЕНВД") Тогда
		ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД", Параметры.ПлательщикЕНВД);
	КонецЕсли;

	Если Параметры.Свойство("ПрименяетсяУСНПатент") Тогда
		ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент", Параметры.ПрименяетсяУСНПатент);
	КонецЕсли;
	
	ДатаНормативныхСведений = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	// Ограничение по доходам
	ЛимитДоходовУСН = Окр(КонтрольПраваПримененияСпецрежимаКлиентСервер.ГраницаДоходовДляПримененияПовышеннойСтавкиУСН(
			ДатаНормативныхСведений) / 1000000, 2); // в млн. рублей
	
	ТекстОграниченияДоходыУСН = СтрШаблон(НСтр("ru='%1 млн руб'"), ЛимитДоходовУСН);
	
	ТекстОграниченияДоходыПСН = СтрШаблон(НСтр("ru='%1 млн руб'"),
		Формат(КонтрольПраваПримененияСпецрежима.ГраницаДоходовОграничивающаяПравоПримененияПСН(), "ЧДЦ=; ЧС=6"));
	
	Элементы.НадписьДоходыУСНИП.Заголовок    = ТекстОграниченияДоходыУСН;
	Элементы.НадписьДоходыУСНЮЛ.Заголовок    = ТекстОграниченияДоходыУСН;
	Элементы.НадписьДоходыПатентИП.Заголовок = ТекстОграниченияДоходыПСН;
	
	// Ограничение по стоимости основных средств
	ТекстОграниченияОС = СтрШаблон(НСтр("ru='%1 %2'"),
		Формат(КонтрольПраваПримененияСпецрежима.ГраницаСтоимостиОсновныхСредствОграничивающаяПравоПримененияУСН(ДатаНормативныхСведений),"ЧС=6"),
		НСтр("ru='млн руб'"));
	Элементы.НадписьОсновныеСредстваУСНЮЛ.Заголовок = ТекстОграниченияОС;
	
	// Ограничение по среднесписочной численности работников
	ТекстОграничениеРаботникиУСН = СтрШаблон(НСтр("ru='%1 человек'"),
		КонтрольПраваПримененияСпецрежимаКлиентСервер.ГраницаЧисленностиРаботниковДляПримененияПовышеннойСтавкиУСН(
			ДатаНормативныхСведений));
	Элементы.НадписьРаботникиУСНИП.Заголовок = ТекстОграничениеРаботникиУСН;
	Элементы.НадписьРаботникиУСНЮЛ.Заголовок = ТекстОграничениеРаботникиУСН;
	
	ТекстОграничениеРаботникиПатент = СтрШаблон(НСтр("ru='%1 %2'"),
		КонтрольПраваПримененияСпецрежима.ГраницаСреднесписочнойЧисленностиРаботниковОграничивающаяПравоПримененияПатент(),
		"человек");
	Элементы.НадписьРаботникиПатентИП.Заголовок = ТекстОграничениеРаботникиПатент;
	
	ТекстОграничениеРаботникиЕНВД = СтрШаблон(НСтр("ru='%1 %2'"),
		КонтрольПраваПримененияСпецрежима.ГраницаСреднесписочнойЧисленностиРаботниковОграничивающаяПравоПримененияЕНВД(),
		"человек");
	Элементы.НадписьРаботникиЕНВДИП.Заголовок = ТекстОграничениеРаботникиЕНВД;
	
	// Ограничения тарифа
	РазрешенУчетРегулярнойДеятельности = ТарификацияБПВызовСервераПовтИсп.РазрешенУчетРегулярнойДеятельности();
	
	Элементы.НадписьПатент.Видимость                       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентПояснение.Видимость              = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕдиныйНалог.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьСтоимостьПатента.Видимость             = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка6СтоимостьПатента.Видимость   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка15СтоимостьПатента.Видимость  = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентСтоимостьПатента.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДСтоимостьПатента.Видимость         = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьОбщаяСистемаСтоимостьПатента.Видимость = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕНВД.Видимость                   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНДС.Видимость                    = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНДФЛ.Видимость                   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНалогНаИмущество.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьДоходыПатентИП.Видимость               = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьРаботникиПатентИП.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.СистемаНалогообложенияПатентнаяИП.Видимость   = РазрешенУчетРегулярнойДеятельности;
	
	ЕстьНПД = РазрешенУчетРегулярнойДеятельности И (ОбщегоНазначенияБП.ТекущаяДатаНаСервере() >= НалогНаПрофессиональныйДоходКлиентСервер.ДатаНачалаЭксперимента());
	
	ИменаЭлементовНПДИП = ИменаЭлементовНПДИП();
	Для Каждого ИмяЭлемента Из ИменаЭлементовНПДИП.СистемаНалогообложения Цикл
		Элементы[ИмяЭлемента].Видимость = ЕстьНПД;
	КонецЦикла;
	Для Каждого ИмяЭлемента Из ИменаЭлементовНПДИП.ВхождениеНалога Цикл
		Элементы[ИмяЭлемента].Видимость = ЕстьНПД;
	КонецЦикла;
	Элементы[ИменаЭлементовНПДИП.НазваниеНалога].Видимость = ЕстьНПД;
	Элементы[ИменаЭлементовНПДИП.КомандаВыбрать].Видимость = ЕстьНПД;
	
	РазрешеноПрименениеЕНВД = ОбщегоНазначенияБП.ТекущаяДатаНаСервере() < УчетЕНВДКлиентСервер.ДатаОтменыЕНВД();
	
	Элементы.НадписьЕНВД.Видимость                  = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДПояснение.Видимость         = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДЕдиныйНалог.Видимость       = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДСтрока.Видимость            = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНПД.Видимость               = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка6ЕНВД.Видимость        = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка15ЕНВД.Видимость       = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДСтоимостьПатента.Видимость  = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕНВД.Видимость            = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьОбщаяСистемаЕНВД.Видимость      = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДЕНВД.Видимость              = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНДС.Видимость               = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНДФЛ.Видимость              = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНалогНаИмущество.Видимость  = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьДоходыЕНВДИП.Видимость          = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьРаботникиЕНВДИП.Видимость       = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	Элементы.СистемаНалогообложенияЕНВДИП.Видимость = РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ГиперссылкаСравнениеСистемНалогообложенияИП);
	МассивЭлементов.Добавить(Элементы.НадписьОграниченияЮЛ);
	Для каждого Элемент Из МассивЭлементов Цикл
		Элемент.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 29, 25);
	КонецЦикла;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ГруппаСравенениеСистемНалогообложенияИП);
	МассивЭлементов.Добавить(Элементы.ГруппаОграничениеИП);
	Для каждого Элемент Из МассивЭлементов Цикл
		Элемент.Ширина = ?(РазрешеноПрименениеЕНВД И РазрешенУчетРегулярнойДеятельности, 73, 67);
	КонецЦикла;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.НадписьДоходыУСНИП);
	МассивЭлементов.Добавить(Элементы.НадписьРаботникиУСНИП);
	Для каждого Элемент Из МассивЭлементов Цикл
		Элемент.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 29, 51);
	КонецЦикла;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15ИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6ИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6ПояснениеИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15ПосянениеИП);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаПояснениеИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6ЕдиныйНалогИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15ЕдиныйНалогИП);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаЕдиныйНалогИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6СтоимостьПатента);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15СтоимостьПатента);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаСтоимостьПатента);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6НДСИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15НДСИП);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаНДСИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6НДФЛ);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15НДФЛ);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаНДФЛ);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка6НалогНаИмуществоИП);
	МассивЭлементов.Добавить(Элементы.НадписьУпрощенка15НалогНаИмуществоИП);
	МассивЭлементов.Добавить(Элементы.НадписьОбщаяСистемаНалогНаИмуществоИП);
	МассивЭлементов.Добавить(Элементы.ДекорацияБезОграниченияИП);
	МассивЭлементов.Добавить(Элементы.СистемаНалогообложенияУСНДоходыИП);
	МассивЭлементов.Добавить(Элементы.СистемаНалогообложенияУСНДоходыМинусРасходыИП);
	МассивЭлементов.Добавить(Элементы.СистемаНалогообложенияОбщаяИП);
	Для каждого Элемент Из МассивЭлементов Цикл
		Элемент.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 14, 25);
	КонецЦикла;
	
	Если ЕстьНПД Тогда
		ШиринаЭлементов = ?(РазрешенУчетРегулярнойДеятельности, 14, 25);
		Для Каждого ИмяЭлемента Из ИменаЭлементовНПДИП.СистемаНалогообложения Цикл
			Элементы[ИмяЭлемента].Ширина = ШиринаЭлементов;
		КонецЦикла;
		Для Каждого ИмяЭлемента Из ИменаЭлементовНПДИП.ВхождениеНалога Цикл
			Элементы[ИмяЭлемента].Ширина = ШиринаЭлементов;
		КонецЦикла;
		Элементы[ИменаЭлементовНПДИП.КомандаВыбрать].Ширина = ШиринаЭлементов;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.НазадИП);
	МассивЭлементов.Добавить(Элементы.НадписьРаботникиИП);
	МассивЭлементов.Добавить(Элементы.ДекорацияНадписьДоходыИП);
	МассивЭлементов.Добавить(Элементы.НадписьНалогНаИмуществоИП);
	МассивЭлементов.Добавить(Элементы.НадписьНДФЛ);
	МассивЭлементов.Добавить(Элементы.НадписьНДСИП);
	МассивЭлементов.Добавить(Элементы.НадписьСтоимостьПатента);
	МассивЭлементов.Добавить(Элементы.НадписьЕдиныйНалогУСНИП);
	МассивЭлементов.Добавить(Элементы.ДекорацияУплачиваетсяИП);
	МассивЭлементов.Добавить(Элементы.НадписьСистемаНалогообложенияИП);
	Для каждого Элемент Из МассивЭлементов Цикл
		Элемент.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	КонецЦикла;
	
	Если ЕстьНПД Тогда
		ШиринаЭлементов = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
		Элементы[ИменаЭлементовНПДИП.НазваниеНалога].Ширина = ШиринаЭлементов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидОрганизации <> "ОбособленноеПодразделение" Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГоловнаяОрганизация");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = ПолучитьЗаголовокФормы();
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		ИнициализироватьФормуВРежимеПовторногоВыбораВидаОрганизации();
	ИначеЕсли РежимПовторногоВыбораСистемыНалогообложения Тогда
		ИнициализироватьФормуВРежимеПовторногоВыбораСистемыНалогообложения();
	ИначеЕсли РежимПростогоИнтерфейса Тогда
		ИнициализироватьФормуВРежимеПростогоИнтерфейса();
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОткрытиеФормыНовойОрганизации" 
	   И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИП(Команда)
	
	ВидОрганизации = "ИндивидуальныйПредприниматель";
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		Закрыть(ВидОрганизации);
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияИП;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЮЛ(Команда)
	
	ВидОрганизации = "ЮридическоеЛицо";
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		Закрыть(ВидОрганизации);
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияЮЛ;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОП(Команда)
	
	ВидОрганизации = "ОбособленноеПодразделение";
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияОП;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияОбщая(Команда)
	
	СистемаНалогообложения = "Общая";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПатентная(Команда)
	
	СистемаНалогообложения = "Патентная";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияЕНВД(Команда)
	
	СистемаНалогообложения = "ЕНВД";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияУСНДоходы(Команда)
	
	СистемаНалогообложения = "УпрощеннаяДоходы";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияУСНДоходыМинусРасходы(Команда)
	
	СистемаНалогообложения = "УпрощеннаяДоходыМинусРасходы";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияНалогНаПрофессиональныйДоход(Команда)
	
	СистемаНалогообложения = "НалогНаПрофессиональныйДоход";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрганизацию(Команда)
	
	ОткрытьФормуОрганизации();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГиперссылкаСравнениеСистемНалогообложенияНажатие(Элемент)

	ЮридическоеФизическоеЛицо = ?(ВидОрганизации = "ИндивидуальныйПредприниматель",
		ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"),
		ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОрганизации", ЮридическоеФизическоеЛицо);
	
	ОткрытьФорму("Обработка.СравнениеРежимовНалогообложения.Форма", СтруктураПараметров, ЭтаФорма, ВидОрганизации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, РежимПовторногоВыбораСистемыНалогообложения)
	
	Если ВидОрганизации = "ЮридическоеЛицо" Тогда
		ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияЮЛ";
	ИначеЕсли ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
		ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияИП";
	ИначеЕсли ВидОрганизации = "ОбособленноеПодразделение" Тогда
		Если РежимПовторногоВыбораСистемыНалогообложения Тогда
			ВызватьИсключение "Для обособленного подразделения система налогообложения определяется головной организацией.";
		Иначе
			ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияОП";
		КонецЕсли;
	Иначе
		ТекущаяСтраницаФормы = "СтраницаВидОрганизации";
	КонецЕсли;
	Возврат ТекущаяСтраницаФормы;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗаголовокФормы()
	
	Если РежимПовторногоВыбораСистемыНалогообложения Тогда
		
		ЗаголовокФормы = НСтр("ru='Система налогообложения'");
		
	Иначе
	
		ЗаголовокФормы = НСтр("ru = 'Вид организации'");
		
		Если Элементы.СтраницыФормы.ТекущаяСтраница <> Элементы.СтраницаВидОрганизации Тогда
			Если ВидОрганизации = "ЮридическоеЛицо" Тогда
				ЗаголовокФормы = НСтр("ru = 'Юридическое лицо'");
			ИначеЕсли ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
				ЗаголовокФормы = НСтр("ru = 'Индивидуальный предприниматель'");
			ИначеЕсли ВидОрганизации = "ОбособленноеПодразделение" Тогда
				ЗаголовокФормы = НСтр("ru = 'Обособленное подразделение'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗаголовокФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИННГоловнойОрганизации(Организация)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН")	
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОрганизации()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураУчетнойПолитики = ПолучитьСтруктуруУчетнойПолитики(ВидОрганизации,
		СистемаНалогообложения,
		ПараметрыУчетнойПолитики.ПлательщикЕНВД,
		ПараметрыУчетнойПолитики.ПрименяетсяУСНПатент);
	
	Модифицированность = Ложь;
	
	Если РежимПовторногоВыбораСистемыНалогообложения Тогда
		
		Закрыть(СтруктураУчетнойПолитики);
		
	Иначе
	
		ЗначенияЗаполнения = Новый Структура;
		Если ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
			ЗначенияЗаполнения.Вставить("ЮридическоеФизическоеЛицо",
				ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));
		Иначе
			ЗначенияЗаполнения.Вставить("ЮридическоеФизическоеЛицо",
				ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"));
		КонецЕсли;
		
		ЗначенияЗаполнения.Вставить("ОбособленноеПодразделение", (ВидОрганизации = "ОбособленноеПодразделение"));
		Если ВидОрганизации = "ОбособленноеПодразделение" Тогда
			ЗначенияЗаполнения.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
			ЗначенияЗаполнения.Вставить("ИНН", ПолучитьИННГоловнойОрганизации(ГоловнаяОрганизация));
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗначенияЗаполнения",       ЗначенияЗаполнения);
		СтруктураПараметров.Вставить("СтруктураУчетнойПолитики", СтруктураУчетнойПолитики);
		
		ОткрытьФорму("Справочник.Организации.Форма.ФормаОрганизации", СтруктураПараметров, ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПовторногоВыбораВидаОрганизации()
		
	Элементы.ГруппаОбособленноеПодразделение.Видимость = Ложь;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	
	КнопкаПоУмолчанию = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]               = "ВыбратьЮЛ";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"] = "ВыбратьИП";
	
	ЭлементФормыПоУмолчанию = Элементы[КнопкаПоУмолчанию[ВидОрганизации]];
	Если ЭлементФормыПоУмолчанию <> Неопределено Тогда
		ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПовторногоВыбораСистемыНалогообложения()

	Если ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная") Тогда
		СистемаНалогообложения = ?(ПараметрыУчетнойПолитики.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.Доходы"),
			"УпрощеннаяДоходы", "УпрощеннаяДоходыМинусРасходы");
	ИначеЕсли ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок")
		    И ПараметрыУчетнойПолитики.ПрименяетсяУСНПатент Тогда
		СистемаНалогообложения = "Патентная";
	ИначеЕсли ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок")
		    И ПараметрыУчетнойПолитики.ПлательщикЕНВД Тогда
		СистемаНалогообложения = "ЕНВД";
	ИначеЕсли ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.НалогНаПрофессиональныйДоход") Тогда
		СистемаНалогообложения = "НалогНаПрофессиональныйДоход";
	Иначе
		СистемаНалогообложения = "Общая";
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы[ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, Истина)];
	Элементы.НазадЮЛ.Доступность = Ложь;
	Элементы.НазадЮЛ.ЦветТекста = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаФормы");
	Элементы.НазадИП.Доступность = Ложь;
	Элементы.НазадИП.ЦветТекста = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаФормы");
	
	КнопкаПоУмолчанию = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]                                               = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["УпрощеннаяДоходы"]                           = "СистемаНалогообложенияУСНДоходыЮЛ";
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["УпрощеннаяДоходыМинусРасходы"]               = "СистемаНалогообложенияУСНДоходыМинусРасходыЮЛ";
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["Общая"]                                      = "СистемаНалогообложенияОбщаяЮЛ";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]                                 = Новый Соответствие;
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["УпрощеннаяДоходы"]             = "СистемаНалогообложенияУСНДоходыИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["УпрощеннаяДоходыМинусРасходы"] = "СистемаНалогообложенияУСНДоходыМинусРасходыИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["Патентная"]                    = "СистемаНалогообложенияПатентнаяИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["ЕНВД"]                         = "СистемаНалогообложенияЕНВДИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["НалогНаПрофессиональныйДоход"] = "СистемаНалогообложенияНалогНаПрофессиональныйДоходИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["Общая"]                        = "СистемаНалогообложенияОбщаяИП";
	
	ЭлементФормыПоУмолчанию = Элементы[КнопкаПоУмолчанию[ВидОрганизации][СистемаНалогообложения]];
	Если ЭлементФормыПоУмолчанию <> Неопределено Тогда
		ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПростогоИнтерфейса()
	
	ВидОрганизации = "ИндивидуальныйПредприниматель";
	СистемаНалогообложения = "УпрощеннаяДоходы";
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы[ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, Истина)];
	Элементы.НазадЮЛ.Доступность = Ложь;
	Элементы.НазадЮЛ.ЦветТекста = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаФормы");
	Элементы.НазадИП.Доступность = Ложь;
	Элементы.НазадИП.ЦветТекста = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаФормы");
	
	ЭлементФормыПоУмолчанию = Элементы.СистемаНалогообложенияУСНДоходыИП;
	ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруУчетнойПолитики(ВидОрганизации, СистемаНалогообложения, ПлательщикЕНВД, ПрименяетсяУСНПатент)
	
	Возврат РегистрыСведений.НастройкиСистемыНалогообложения.СтруктураУчетнойПолитики(ВидОрганизации, СистемаНалогообложения, ПлательщикЕНВД, ПрименяетсяУСНПатент);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИменаЭлементовНПДИП()
	
	СистемаНалогообложения = "НадписьНПД,НадписьНПДПояснение,НадписьНПДЕдиныйНалог,НадписьНПДСтоимостьПатента,НадписьНПДЕНВД,"
		+ "НадписьНПДНПД,НадписьНПДНДС,НадписьНПДНДФЛ,НадписьНПДНалогНаИмущество,НадписьДоходыНПДИП,НадписьРаботникиНПДИП";
	НазваниеНалога = "НадписьНПДИП";
	ВхождениеНалога = "НадписьУпрощенка6НПДИП,НадписьУпрощенка15НПДИП,НадписьПатентНПД,НадписьЕНВДНПД,НадписьНПДНПД,НадписьОбщаяСистемаНПДИП";
	КомандаВыбрать = "СистемаНалогообложенияНалогНаПрофессиональныйДоходИП";
	
	СтуктураИмен = Новый Структура;
	СтуктураИмен.Вставить("СистемаНалогообложения", СтрРазделить(СтрЗаменить(СистемаНалогообложения, " ", ""), ","));
	СтуктураИмен.Вставить("ВхождениеНалога", СтрРазделить(СтрЗаменить(ВхождениеНалога, " ", ""), ","));
	СтуктураИмен.Вставить("НазваниеНалога", НазваниеНалога);
	СтуктураИмен.Вставить("КомандаВыбрать", КомандаВыбрать);
	
	Возврат СтуктураИмен;
	
КонецФункции

#КонецОбласти
