
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	  ОтправитьСообщениеЧерезСистемуВзаимодействия();
КонецПроцедуры

&НаСервере 
Процедура ОтправитьСообщениеЧерезСистемуВзаимодействия()
	//ВсеБоты  = СистемаВзаимодействия.ПолучитьБотов();	
	
	ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьБотов()[0].Пользователь;
			
	// Напоминание кадровику о сотрудниках с истекающим испытательным сроком

	
	
	КлючОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия("45d2a8fa-9ac3-445a-968a-40aeed1d4b71");
	
	//ОтборОбсуждений = Новый ОтборОбсужденийСистемыВзаимодействия();
	//ОтборОбсуждений.Интеграция = истина;
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсуждения);
	
	Если Обсуждение = Неопределено Тогда
		
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		
		Обсуждение.Ключ = КлючОбсуждения;
		
		Обсуждение.Заголовок = "GZ_InfoBot";
		
		Обсуждение.Участники.Добавить(ИдентификаторПользователя);	
			
		Обсуждение.Записать();
			
	КонецЕсли;
			
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
	
	Текст = "Тестовое сообщение со списком закупок" + Символы.ПС;
	
	Сообщение.Текст = Новый ФорматированнаяСтрока(Текст);
	
	// заполняем данные сообщения списком ссылок сотрудников на прием

	Для Каждого ИдПользователя Из Обсуждение.Участники Цикл
		Сообщение.Получатели.Добавить(ИдПользователя);
	КонецЦикла;	
	// добавляем действия сообщения для кадровика
	
	//Сообщение.Действия.Добавить("Request", "Запросить результаты у руководителя");
	
	Сообщение.Записать();

КонецПроцедуры
