
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураДополнительныхПараметров = Новый Структура("ЗаголовокФормы", Нстр("ru ='Инструкция ""Как создать факсимиле подписи""'"));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ФизическиеЛица",
		"НапечататьПомощникСозданияФаксимилеПодписи",
		ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"),
		ПараметрыВыполненияКоманды,
		СтруктураДополнительныхПараметров);
	
КонецПроцедуры
