
 Процедура СоздатьДокументПротоколПо44ФЗ(ДанныеЗаполнения) Экспорт 
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ДанныеЗаполнения.protocolNumber <> "" Тогда 
			НайденныйДокумент = Документы.ГЗ_Протокол44ФЗ.НайтиПоРеквизиту("protocolNumber", ДанныеЗаполнения.protocolNumber) ;
		Иначе 
			НайденныйДокумент	= документы.ГЗ_Протокол44ФЗ.ПустаяСсылка();
		КонецЕсли;	
		
		Если НайденныйДокумент.Пустая() Тогда 
			ДокументГЗ = Документы.ГЗ_Протокол44ФЗ.СоздатьДокумент();
		Иначе 	
			ДокументГЗ = НайденныйДокумент.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументГЗ,ДанныеЗаполнения);

		Попытка
			ДокументГЗ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументГЗ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("ГЗ.СозданиеПротокола", УровеньЖурналаРегистрации.Ошибка,,,"Пустая структура для заполнения документа проект контракта");
	КонецЕсли;	
	//Возврат ДокументСсылка;

КонецПроцедуры
