#Область СлужебныеПроцедурыИФункции


Функция ОписаниеКлиентскогоПриложения() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация; 
	ВерсияПлатформы = СтрШаблон("%1%2", "1C/", СистемнаяИнформация.ВерсияПриложения);
	
	ВариантРаботы = ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), "File", "ClientServer");
	РежимРазделения = ?(ОбщегоНазначения.РазделениеВключено(),"; Splitted","");
	РежимРаботы = СтрШаблон("%1%2%3%4", "(", ВариантРаботы, РежимРазделения, ")");
	
	Приложение = СтрШаблон("%1%2%3", ОбщегоНазначения.ИдентификаторИнтернетПоддержкиКонфигурации(), "/", Метаданные.Версия);
	
	Возврат СтрШаблон("%1 %2 %3", ВерсияПлатформы, РежимРаботы, Приложение);

КонецФункции

#КонецОбласти
