#Область ПрограммныйИнтерфейс

Процедура УстановитьВидимостьСсылкиНаОтчетРосстатаИПанелиПредупреждения(Форма) Экспорт

	// Вид отчета.
	ЭтоГодовойОтчетВФНС = 
		КонецМесяца(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 
		КонецГода(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
	ПредставляетсяВРосстат = Год(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) < 2019;
		
	Если ЭтоГодовойОтчетВФНС И ПредставляетсяВРосстат Тогда
		
		ОтчетВРосстат = Форма.ОтчетностьВРосстат;
		
		ВидимостьКраснойПанели = ОтправкаБухгалтерскойОтчетностиВРосстатВызовСервера.ВидимостьКраснойПанели(
			Форма.СтруктураРеквизитовФормы, 
			ОтчетВРосстат);
			
		Форма.Элементы.ГруппаБухгалтерскаяОтчетностьВРосстат.Видимость = НЕ ВидимостьКраснойПанели;
		Форма.Элементы.ПанельПредупрежденияОНеобходимостиОтправкиВРосстат.Видимость = ВидимостьКраснойПанели;
		
	Иначе
		Форма.Элементы.ГруппаБухгалтерскаяОтчетностьВРосстат.Видимость = Ложь;
		Форма.Элементы.ПанельПредупрежденияОНеобходимостиОтправкиВРосстат.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти