#Область ПрограммныйИнтерфейс

// Конструктор для коллекции, описывающий реализацию конкретной формы документа.
// 
// Возвращаемое значение:
//  Структура - см. тело функции
//
Функция НовыйОписаниеФормы() Экспорт
	
	ОписаниеФормы = Новый Структура;
	
	// Форма должна содержать следующие реквизиты (стандартные имена указаны в значениях структуры):
	
	// Булево, наличие в документе загруженных чеков
	ОписаниеФормы.Вставить("РеквизитЕстьЗагруженныеЧеки", "ОтображатьНаименованиеИзЧека"); 
	// Строка, имя действия, которое может быть выполнено с чеками к загрузке.
	// См. УчетКассовыхЧековПодотчетныхЛиц.СледующееДействие
	ОписаниеФормы.Вставить("РеквизитСледующееДействие",   "КассовыеЧекиПодотчетныхЛицДействие");
	// Строка, адрес в хранилище, в котором сохраняются данные о чеках к загрузке и иная информация,
	// нужная для подбора чеков
	ОписаниеФормы.Вставить("РеквизитДанныеФормы",         "КассовыеЧекиПодотчетныхЛицАдрес");
	// Строка, текст баннера о наличии чеков к загрузке
	ОписаниеФормы.Вставить("РеквизитТекстБаннера",        "БаннерЧекиПодотчетныхЛицТекст");
	
	// Форма должна содержать группу с баннером, имя которой указано ниже
	ОписаниеФормы.Вставить("Баннер",                      "ГруппаБаннерЧекиПодотчетныхЛиц");
	
	// Форма должна содержать подключаемый обработчик ожидания, имя которого указано ниже
	ОписаниеФормы.Вставить(
		"ОбработчикОжидания",
		"Подключаемый_ОбновитьЧекиКЗагрузке");
	
	// Форма должна содержать команды загрузки чеков.
	// Команд может быть несколько, если несколько списков.
	// Здесь следует указать имена кнопок формы
	ОписаниеФормы.Вставить("КнопкиЗагрузитьЧеки",         Новый Массив);
	
	Возврат ОписаниеФормы;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Актуализирует на форме документа баннер про чеки, доступные к загрузке.
// Баннер должен быть предварительно инициализирован в УчетКассовыхЧековПодотчетныхЛиц.НастроитьФорму
// Вызывается в контексте клиента или сервера.
//
// Параметры:
//  Форма         - УправляемаяФорма - настраиваемая форма документа, в которую можно загружать чеки подотчетных лиц,
//                                     должна соответствовать описанию
//  ОписаниеФормы - Структура - см. НовыйОписаниеФормы
//  ТекстБаннера  - Строка - устанавливаемый текст, см. УчетКассовыхЧековПодотчетныхЛиц.ТекстБаннера
//
Процедура ОбновитьБаннерЧекиКЗагрузке(Форма, ОписаниеФормы, ТекстБаннера) Экспорт
	
	Форма[ОписаниеФормы.РеквизитТекстБаннера] = ТекстБаннера;
	ПолеБаннера = Форма.Элементы[ОписаниеФормы.Баннер];
	ПолеБаннера.Видимость = Не ПустаяСтрока(ТекстБаннера);
	
КонецПроцедуры

#КонецОбласти
