#Область ПрограммныйИнтерфейс

Функция ОпределитьСтавкуНДС(Всего, СуммаНДС) Экспорт
	
	Делитель = Всего - СуммаНДС;
	Если Делитель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Ставка = Окр(СуммаНДС * 100 / Делитель);
	СтруктураСтавкиНДС = Новый Структура("Числом", Ставка);
	
	Если Ставка = 20 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли Ставка = 18 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли Ставка = 10 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли Ставка = 0 Тогда
		СтавкаСсылкой = Перечисления.СтавкиНДС.БезНДС;
	Иначе
		СтавкаСсылкой = Неопределено;
	КонецЕсли;
	
	Если СтавкаСсылкой = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		СтруктураСтавкиНДС.Вставить("Ссылкой", СтавкаСсылкой);
		Возврат СтруктураСтавкиНДС;
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область ПраваДоступа

// Настраивает в профиле групп доступа роли, предоставляющие право интеграции.
// Описывает соответствующие роли подсистемы.
//
// Параметры:
//  ОписаниеПрофиля - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - описание профиля

Процедура РазрешитьИнтеграцию(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеДокументов");
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.РаспознанныйДокумент, Истина);
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецОбласти
