#Область ПрограммныйИнтерфейс

#Область Антикризис

// Открывает форму настроек налогов и отчетов на закладке Антикризис.
// Для интерфейса интеграции с банком открывает форму настроек антикризисных мер.
//
// Параметры:
//  Организация                - СправочникСсылка.Организации
//  ИнтерфейсИнтеграцииСБанком - Булево - Признак, указывающий, что форма открыта в интерфейсе интеграции с банком
//
Процедура ОткрытьНастройкиАнтикризис(Организация, ИнтерфейсИнтеграцииСБанком = Ложь) Экспорт
	
	Если Не ИнтерфейсИнтеграцииСБанком Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Организация",     Организация);
		ПараметрыОткрытия.Вставить("ТекущаяЗакладка", "Антикризис");
		ОткрытьФорму("ОбщаяФорма.НалогиИОтчеты", ПараметрыОткрытия, , Организация);
	Иначе
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Организация", Организация);
		ИмяФормы = "РегистрСведений.НастройкиПродленияСроковНалоговОтчетов.Форма.ФормаАнтикризисИнтеграцияСБанком";
		НавигационнаяСсылка = "e1cib/command/РегистрСведений.НастройкиПродленияСроковНалоговОтчетов.Команда.НастройкиИнтеграцияСБанком";
		ОткрытьФорму(ИмяФормы, ПараметрыОткрытия, , Организация, , НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Описывает поля правила распределения для редактирования в форме
// См. Метаданные.Справочники.НастройкиУчетаЗатрат.ТабличныеЧасти.ОсобыеПравилаРаспределения.Реквизиты
// 
// Возвращаемое значение:
//  Структура - Ключ - имя поля (реквизита)
//
Функция ПоляПравилаРаспределения() Экспорт
	
	Правило = Новый Структура;
	
	Правило.Вставить("Счет");
	Правило.Вставить("Подразделение");
	Правило.Вставить("СтатьяЗатрат");
	Правило.Вставить("БазаРаспределения");
	Правило.Вставить("СписокСтатейЗатрат");
	Правило.Вставить("СчетПрямыхЗатрат");
	Правило.Вставить("ПодразделениеЗатрат");
	
	Возврат Правило;
	
КонецФункции

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Универсальные методы для формы записи регистра и формы настройки налогов
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаНавигационнойСсылкиСистемаНалогообложения(Форма, Организация, Период) Экспорт
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Период) Тогда
		КлючЗаписиУчетнойПолитики = НастройкиУчетаВызовСервера.КлючЗаписиУчетнойПолитики("НастройкиСистемыНалогообложения", Организация, Период);
	КонецЕсли;
	
	Если КлючЗаписиУчетнойПолитики <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", КлючЗаписиУчетнойПолитики);
		
		ОткрытьФорму("РегистрСведений.НастройкиСистемыНалогообложения.ФормаЗаписи", ПараметрыФормы, Форма);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
		
		ОткрытьФорму("РегистрСведений.НастройкиСистемыНалогообложения.ФормаСписка", ПараметрыФормы, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти