#Область СлужебныеПроцедурыИФункции

Процедура ОтменитьПрименениеВычетов(Регистратор, Сотрудник) Экспорт
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Увольнение") Тогда
		
		Заявление = Регистратор.ПолучитьОбъект();
		Заявление.ПрименятьВычетыПослеУвольнения = Истина;
		Заявление.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		Заявление = Регистратор.ПолучитьОбъект();
		Заявление.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти