#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак того, что организация должна сдавать отчетность в Министерство Юстиции
// 
// Параметры:
//   Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//   Булево
//
Функция НеобходимоСдаватьОтчетностьВМинюст(Организация) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Вызывается при записи новой организации.
// Используется для включения специфичных для конфигурации настроек учета.
// 
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на создаваемую новую организацию
//
Процедура ПриЗаписиНовойОрганизации(Организация) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли