
#Область СлужебныйПрограммныйИнтерфейс

Функция НачатьПолучениеОповещенийВФоне(Знач Организация) Экспорт
	
	ПараметрыМетода = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.НовыеПараметрыМетодаВзаимодействия("СписокОповещений");
	ПараметрыМетода.Организация = Организация;
	ПараметрыМетода.ПолучатьПрочитанные = Истина;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение сообщений из сервиса Мой налог.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатформойСамозанятые.ВыполнитьМетодВзаимодействияВФоне",
		ПараметрыМетода,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Функция ПолучитьРезультатЗапросаОповещенийВФоне(Запрос) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение сообщений из сервиса Мой налог.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ДополнительныйРезультат = Запрос.ДополнительныйРезультат;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатформойСамозанятые.ПолучитьРезультатВыполненияВФоне",
		Запрос,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ПоказатьОповещенияВФоне(ПараметрыЧата, РезультатЗапроса) Экспорт
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("РезультатЗапроса", ПолучитьИзВременногоХранилища(РезультатЗапроса.Результат.АдресВременногоХранилища));
	ПараметрыМетода.Вставить("ПараметрыЧата", ПараметрыЧата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение сообщений из сервиса Мой налог.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительныеОперации.ВыполнитьВФоне(
		"ОповещенияПлатформыСамозанятые.ПоказатьОповещения",
		ПараметрыМетода,
		ПараметрыВыполнения);
	
КонецПроцедуры

Функция НачатьУдалениеОповещения(Знач Организация, ДанныеСообщения) Экспорт
	
	ПараметрыМетода = 
		ИнтеграцияСПлатформойСамозанятыеКлиентСервер.НовыеПараметрыМетодаВзаимодействия("ПоместитьОповещениеВАрхив");
	
	ПараметрыМетода.Организация = Организация;
	ПараметрыМетода.Оповещения = Новый Массив;
	ПараметрыМетода.Оповещения.Добавить(ОповещенияПлатформыСамозанятые.ЗначениеИзJSON(ДанныеСообщения).Идентификатор);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление сообщения в сервисе Мой налог.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатформойСамозанятые.ВыполнитьМетодВзаимодействияВФоне",
		ПараметрыМетода,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Функция ПолучитьРезультатУдаленияОповещения(Запрос) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление сообщения в сервисе Мой налог.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатформойСамозанятые.ПолучитьРезультатВыполненияВФоне",
		Запрос,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура УдалитьСообщение(ИдентификаторСообщения) Экспорт
	
	ОповещенияПлатформыСамозанятые.УдалитьОповещение(ИдентификаторСообщения);
	
КонецПроцедуры

#КонецОбласти
