#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ПерсонализированныеДанные.ОбновитьДанные(
		Справочники.Организации.ПустаяСсылка(),
		Дата(1, 1, 1),
		,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Перечисления.РазделыПерсонализированныхДанных.НастройкаПечатиАртикулов));
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли