
////////////////////////////////////////////////////////////////////////////////
// Универсальные методы для формы записи регистра и формы настройки налогов
//
// Клиент-серверные методы формы записи регистра сведений НастройкиУчетаНДС
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УправлениеФормой(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Запись   = Форма.НастройкиУчетаНДС;
	
	Элементы.СложныйУчетНДС.Видимость       = Истина;
	
	Элементы.ГруппаРаздельныйУчетНДСНаСчете19.Видимость = Запись.РаздельныйУчетНДСДо2014Года;
	Элементы.РаздельныйУчетНДСНаСчете19.Доступность = Запись.СложныйУчетНДС;
	
	Если НЕ Запись.РаздельныйУчетНДСДо2014Года Тогда
		Элементы.СложныйУчетНДС.Заголовок = НСтр("ru = 'Ведется раздельный учет входящего НДС по способам учета'");
	КонецЕсли;
	
	Элементы.ГруппаОткрытияДокументовВводОстатков.Видимость = НЕ Запись.РаздельныйУчетНДСДо2014Года И Запись.СложныйУчетНДС И Форма.ЕстьВводОстатковПоРУ;
	
	Элементы.УпрощенныйУчетНДС.Видимость   = Запись.Период < '20120101';
	Элементы.УпрощенныйУчетНДС.Доступность = Не Запись.СложныйУчетНДС;
	
	Элементы.НачислятьНДСПриПередачеНедвижимости.Видимость = Запись.Период >= '20110101' И Запись.Период < '20140701';
	
	Элементы.БезопаснаяДоляВычета.Доступность = Запись.КонтролироватьДолюВычета;
	
КонецПроцедуры

#КонецОбласти