
#Область СлужебныеПроцедурыИФункции

// РСВ

Процедура ОписаниеПоказателей_РСВ_2020Кв1(ПоказателиОтчета) Экспорт
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000110000101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002102", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002103", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002104", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004501", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004502", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004503", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004504", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005102", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006102", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006202", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006204", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004501", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004502", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004503", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004504", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006004", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М100101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105004", Истина, Истина);
		
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М100101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М100201", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105004", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М100101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М102002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М103002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М105002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00111М105004", Истина, Истина);
		
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М100101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М100201", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101501", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101502", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101503", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М101504", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М102002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М103002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М104001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М104002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М104003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М104004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М105501", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М105502", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М105503", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М105504", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М106001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М106002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М106003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00012М106004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008004", Истина, Истина);

	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М102001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М103001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М104001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М105001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М106001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М107001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М108001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М108002", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М108003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00018М108004", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030004001", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310002001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310003001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310004001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310005001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310006001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310007001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310008001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310009001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310010001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310011001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310011002", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М112001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М113001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М114001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М115001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М116001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М117001", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М118001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М119001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М120001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М121001", Истина, Истина);
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ_2020Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	ДатаАктуальности = Макс(ОкончаниеПериода, КонецДня(ПараметрыОтчета.ДатаПодписи));
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеДокументовВУчетеСтраховыхВзносов");
		Модуль.ОтразитьДокументыВУчетеСтраховыхВзносов(Организация);
	КонецЕсли;
	
	// очищаем разделы
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_РСВ_2020Кв1(ПоказателиОтчета);
	
	Раздел1Прил1 = Контейнер.Раздел1Прил1.Строки;
	СтруктураПолейПрил1Подразделы1и2 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[0].Строки[0].Данные);
	СтруктураПолейПрил1Подраздел3_1 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[1].Строки[0].ДанныеМногострочныхЧастей.П11131М1.Строки[0].Данные);
	СтруктураПолейПрил1Подраздел3_2 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[2].Строки[0].ДанныеМногострочныхЧастей.П11132М1.Строки[0].Данные);
	Раздел1Прил1.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подразделы1и2);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подраздел3_1);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подраздел3_2);
	
	Раздел1Прил11 = Контейнер.Раздел1Прил1_1.Строки[0].ДанныеМногострочныхЧастей.П00111М1.Строки;
	СтруктураПолейПрил11 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил11[0].Данные);
	Раздел1Прил11.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил11);
	
	Раздел1Прил2 = Контейнер.Раздел1Прил2.Строки[0];
	Раздел1Прил2ПоТарифам = Раздел1Прил2.ДанныеМногострочныхЧастей.П00012М1.Строки;
	СтруктураПолейПрил2 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил2ПоТарифам[0].Данные);
	Раздел1Прил2ПоТарифам.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил2);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, Раздел1Прил2.Данные);
	
	Раздел1Прил8 = Контейнер.Раздел1Прил8.Строки[0].ДанныеМногострочныхЧастей.П00018М1.Строки;
	СтруктураПолейПрил8 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил8[0].Данные);
	Раздел1Прил8.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил8);
	
	Раздел3 = Контейнер.Раздел3.Строки;
	СтруктураПолейРаздел3 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].Данные);
	СтруктураПолейПодраздел321 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].ДанныеМногострочныхЧастей.П00321М1.Строки[0].Данные);
	СтруктураПолейПодраздел322 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].ДанныеМногострочныхЧастей.П00322М1.Строки[0].Данные);
	Раздел3.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейРаздел3);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПодраздел321);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПодраздел322);
	
	// Сбор данных 
	
	МассивФизическихЛиц = Неопределено;
	Если ПараметрыОтчета.Свойство("ФормированиеПерсонифицированныхСведенийОЗастрахованныхЛицах") Тогда
		ПараметрыОтчета.Свойство("МассивФизическихЛиц", МассивФизическихЛиц);
		КлючиСтруктурыОписанийТаблиц = "ДоходыВРазрезеТарифов2020,ВзносыВРазрезеТарифов2020,ВсеТарифы2020,Подраздел3Физлица2020,Подраздел321Доходы2020,Подраздел322Доходы2020";
	Иначе
		КлючиСтруктурыОписанийТаблиц = "ЧисленностьВРазрезеТарифов2020,ДоходыВРазрезеТарифов2020,ВзносыВРазрезеТарифов2020,ВсеТарифы2020,Подраздел31Доходы2020,Подраздел31Численность2020,Подраздел31Взносы2020,Подраздел32Основания2020,Подраздел32Численность2020,Подраздел32Доходы2020,Подраздел32Взносы2020,ЧисленностьЗастрахованныхВРазрезеТарифов2020,Иностранцы,Подраздел3Физлица2020,Подраздел321Доходы2020,Подраздел322Доходы2020,Приложение11Доходы2020,Приложение11Численность2020,Приложение11Взносы2020,ДоходыФСС2020,РасходыФСС2020";
	КонецЕсли;
	ОписаниеТаблиц = Новый Структура(КлючиСтруктурыОписанийТаблиц);
	ОписаниеТаблиц.Вставить("НомерКорректировки", НомерКорректировки);	
	РасчетПоказателей_РСВ_2020(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, Ложь, ДатаАктуальности, МассивФизическихЛиц);
	
	// Проверяем собранные данные
	
	ВсеТарифы = ОписаниеТаблиц.ВсеТарифы2020;
	ТаблицаДоходов = ОписаниеТаблиц.ДоходыВРазрезеТарифов2020;
	ТаблицаВзносов = ОписаниеТаблиц.ВзносыВРазрезеТарифов2020;
	ВсеФизлица = ОписаниеТаблиц.Подраздел3Физлица2020;
	
	ПроверяемыеПоляВзносов = Новый Массив;
	Для каждого Колонка Из ТаблицаВзносов.Колонки Цикл
		Если Найти(Колонка.Имя, "П011") > 0 Тогда
			ПроверяемыеПоляВзносов.Добавить(Колонка.Имя)
		КонецЕсли;	
	КонецЦикла;	
	ТарифыСПроблемамиУчета = Новый Массив;
	Для каждого СтрокаРезультата Из ВсеТарифы Цикл
		
		СтрокаДоходов = ТаблицаДоходов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
		СтрокаВзносов = ТаблицаВзносов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
		
		Если СтрокаДоходов = Неопределено И СтрокаВзносов = Неопределено Тогда // По текущему тарифу нет данных.
			Продолжить;
		ИначеЕсли СтрокаДоходов = Неопределено Тогда 
			НайденыСуммыВзносов = Ложь;
			Для каждого ИмяПоля Из ПроверяемыеПоляВзносов Цикл
				НайденыСуммыВзносов = ЗначениеЗаполнено(СтрокаВзносов[ИмяПоля]);
				Если НайденыСуммыВзносов Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденыСуммыВзносов Тогда // По текущему тарифу есть проблемы учета.
				ТарифыСПроблемамиУчета.Добавить(СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ФизлицаСПроблемамиУчета = Новый Массив;
	Если ВсеФизлица.Количество() > 0 Тогда
		Для каждого СтрокаРезультата Из ВсеФизлица.НайтиСтроки(Новый Структура("ЕстьОшибкаСНИЛС", Истина)) Цикл
			Если ЗначениеЗаполнено(СтрЗаменить(СтрокаРезультата.П000310003001, "-", "")) Тогда
				ФизлицаСПроблемамиУчета.Добавить(СтрокаРезультата);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Прекращаем работу, если выявлены ошибки учета.
	Если ТарифыСПроблемамиУчета.Количество() > 0 Или ФизлицаСПроблемамиУчета.Количество() > 0 Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выявлены ошибки ведения учета по страховым взносам%1'"), Символы.ПС);
		Если ТарифыСПроблемамиУчета.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- по следующим тарифам отсутствуют доходы, но зарегистрированы взносы:%1'"), Символы.ПС);
			Для каждого Тариф Из ТарифыСПроблемамиУчета Цикл
				ТекстСообщения = ТекстСообщения + "  " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"), Тариф, Символы.ПС);
			КонецЦикла; 	
		КонецЕсли;
		Если ФизлицаСПроблемамиУчета.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- по следующим СНИЛС в Раздел 3 отчета попадает более одной страницы; возможно, не указан СНИЛС или задвоены элементы справочника Физические лица:%1'"), Символы.ПС);
			Для каждого СтрокаФизлица Из ФизлицаСПроблемамиУчета Цикл
				ТекстСообщения = ТекстСообщения + "  " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '""%1"" со страницы %2 (код %3) повторяется на странице %4 (код %5)%6'"), 
					СтрокаФизлица.П000310003001, 
					СтрокаФизлица.ФИО, 
					СтрокаФизлица.Код, 
					СтрокаФизлица.ФИОДругогоФизическогоЛица, 
					СтрокаФизлица.КодДругогоФизическогоЛица, 
					Символы.ПС);
			КонецЦикла; 	
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отчет не заполнен.'");
		
		// Создадим листы пустого отчета.
		НоваяСтрока = Раздел1Прил1.Добавить();
		НоваяСтрока.Данные = Новый Структура("П000110000101","01");
		НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
		СтрокаПодразделов1и2 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
		СтрокаПодразделов1и2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подразделы1и2); 
		СтрокаПодразделов1и2.ДанныеМногострочныхЧастей = Новый Структура();
		СтрокаПодраздела3_1 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
		СтрокаПодраздела3_1.Данные = Новый Структура(); 
		СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
		НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
		НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
		СтрокаПодраздела3_2 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
		СтрокаПодраздела3_2.Данные = Новый Структура(); 
		СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
		НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
		НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
		СтрокаПрил2 = Раздел1Прил2ПоТарифам.Добавить();
		СтрокаПрил2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил2);
		СтрокаПрил2.Данные.П00012М100101 = "01";
		СтрокаПрил2.ДанныеМногострочныхЧастей = Новый Структура();
		СтрокаПриложения11 = Раздел1Прил11.Добавить();
		СтрокаПриложения11.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил11); 
		СтрокаПриложения11.ДанныеМногострочныхЧастей = Новый Структура();
		НоваяСтрока = Раздел1Прил8.Добавить();
		НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил8);
		НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
		НоваяСтрока = Раздел3.Добавить();
		НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейРаздел3);
		НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура("П00321М1,П00322М1", НовоеПустоеДеревоДляРСВ(), НовоеПустоеДеревоДляРСВ());
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Вывод данных в отчет
	
	// Раздел 1
	Если Не ПараметрыОтчета.Свойство("ФормированиеПерсонифицированныхСведенийОЗастрахованныхЛицах") Тогда
		
		// Приложения 1 и 2 
		
		КоличествоЗастрахованных = Новый Структура;
		Если ОписаниеТаблиц.ЧисленностьЗастрахованныхВРазрезеТарифов2020.Количество() > 0 Тогда
			КоличествоЗастрахованных = ОписаниеТаблиц.ЧисленностьЗастрахованныхВРазрезеТарифов2020[0];
		КонецЕсли;
		
		ТаблицаВсегоЗастрахованных = ОписаниеТаблиц.ЧисленностьЗастрахованныхВРазрезеТарифов2020;
		ТаблицаКоличеств = ОписаниеТаблиц.ЧисленностьВРазрезеТарифов2020;
		ТаблицаДоходовБезСпецОценки = ОписаниеТаблиц.Подраздел31Доходы2020;
		ТаблицаКоличествБезСпецОценки = ОписаниеТаблиц.Подраздел31Численность2020;
		ТаблицаВзносовБезСпецОценки = ОписаниеТаблиц.Подраздел31Взносы2020;
		ВсеОснованияСпецОценки = ОписаниеТаблиц.Подраздел32Основания2020;
		ТаблицаДоходовСоСпецОценкой = ОписаниеТаблиц.Подраздел32Доходы2020;
		ТаблицаКоличествСоСпецОценкой = ОписаниеТаблиц.Подраздел32Численность2020;
		ТаблицаВзносовСоСпецОценкой = ОписаниеТаблиц.Подраздел32Взносы2020;
		ТаблицаПриложения2 = ОписаниеТаблиц.ДоходыФСС2020;
		Для каждого СтрокаРезультата Из ВсеТарифы Цикл
			
			СтрокаВсегоЗастрахованных = ТаблицаВсегоЗастрахованных.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаДоходов = ТаблицаДоходов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаКоличеств = ТаблицаКоличеств.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаВзносов = ТаблицаВзносов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаДанныхПриложения2 = ТаблицаПриложения2.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			
			Если СтрокаДоходов = Неопределено И СтрокаВзносов = Неопределено И СтрокаДанныхПриложения2 = Неопределено Тогда // По текущему тарифу нет данных.
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Раздел1Прил1.Добавить();
			НоваяСтрока.Данные = Новый Структура("П000110000101",СтрокаРезультата.КодТарифа);
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПодразделов1и2 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодразделов1и2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подразделы1и2); 
			СтрокаПодразделов1и2.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПрил2 = Раздел1Прил2ПоТарифам.Добавить();
			СтрокаПрил2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил2); 
			СтрокаПрил2.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПрил2.Данные.П00012М100101 = СтрокаРезультата.КодТарифа;
			СтрокаПрил2.Данные.П00012М100201 = ?(ДатаКонцаПериодаОтчета > ПрямыеВыплатыПособийСоциальногоСтрахования.ДатаПередачиФССВыплатыПособий(Организация),"1","2");
			
			// Подразделы 1 и 2 Приложения 1, Приложение 2 
			
			Если СтрокаВсегоЗастрахованных <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные, СтрокаВсегоЗастрахованных);
				ЗаполнитьЗначенияСвойств(СтрокаПрил2.Данные, СтрокаВсегоЗастрахованных);
			КонецЕсли;
			Если СтрокаДоходов <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаДоходов);
			КонецЕсли;
			Если СтрокаДанныхПриложения2 <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПрил2.Данные, СтрокаДанныхПриложения2);
			КонецЕсли;
			Если СтрокаКоличеств <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаКоличеств);
				ЗаполнитьЗначенияСвойств(СтрокаПрил2.Данные, СтрокаКоличеств);
			КонецЕсли;
			Если СтрокаВзносов <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаВзносов);
				ЗаполнитьЗначенияСвойств(СтрокаПрил2.Данные, СтрокаВзносов);
			КонецЕсли;
			
			СтруктураПоискаПоТарифу = Новый Структура("ВидТарифаСтраховыхВзносов", СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			
			// Подраздел 3.1
			
			Результат = ТаблицаДоходовБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу);
			Если Результат.Количество() > 0 Тогда
				
				Подраздел3_1 = НоваяСтрока.Строки.Добавить().Строки;
				СтрокаПодраздела3_1 = Подраздел3_1.Добавить(); 
				СтрокаПодраздела3_1.Данные = Новый Структура(); 
				СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
				
				ДанныеПодземныеИВредныеРаботы = Неопределено;
				ДанныеТяжелыеИПрочиеРаботы = Неопределено;
				Для каждого СтрокаДанных Из Результат Цикл
					НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
					НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные, СтрокаДанных);
					Если СтрокаДанных.П11131М100101 = "1" Тогда
						ДанныеПодземныеИВредныеРаботы = НоваяСтрокаПодраздела.Данные
					Иначе
						ДанныеТяжелыеИПрочиеРаботы = НоваяСтрокаПодраздела.Данные
					КонецЕсли;
				КонецЦикла;
				
				Для каждого СтрокаДанных Из ТаблицаВзносовБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу) Цикл
					Если СтрокаДанных.П11131М100101 = "1" И ДанныеПодземныеИВредныеРаботы = Неопределено 
						Или СтрокаДанных.П11131М100101 <> "1" И ДанныеТяжелыеИПрочиеРаботы = Неопределено Тогда
						СтрокаПодраздела3_1 = Подраздел3_1.Добавить(); 
						СтрокаПодраздела3_1.Данные = Новый Структура(); 
						СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
						НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
						НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
						Если СтрокаДанных.П11131М100101 = "1" Тогда
							ДанныеПодземныеИВредныеРаботы = НоваяСтрокаПодраздела.Данные
						Иначе
							ДанныеТяжелыеИПрочиеРаботы = НоваяСтрокаПодраздела.Данные
						КонецЕсли;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(?(СтрокаДанных.П11131М100101 = "1", ДанныеПодземныеИВредныеРаботы, ДанныеТяжелыеИПрочиеРаботы), СтрокаДанных);
				КонецЦикла;
				
				Для каждого СтрокаДанных Из ТаблицаКоличествБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу) Цикл
					ЗаполнитьЗначенияСвойств(?(СтрокаДанных.П11131М100101 = "1", ДанныеПодземныеИВредныеРаботы, ДанныеТяжелыеИПрочиеРаботы), СтрокаДанных);
				КонецЦикла;
				
			Иначе	
				СтрокаПодраздела3_1 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
				СтрокаПодраздела3_1.Данные = Новый Структура(); 
				СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
			КонецЕсли;
			
			// Подраздел 3.2
			
			СтруктураПоискаРаздела = Новый Структура("ВидТарифаСтраховыхВзносов, П11132М100101, П11132М100201", СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			Результат = ВсеОснованияСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу);
			Если Результат.Количество() > 0 Тогда
				Подраздел3_2 = НоваяСтрока.Строки.Добавить().Строки;
				СтрокаПодраздела3_2 = Подраздел3_2.Добавить(); 
				СтрокаПодраздела3_2.Данные = Новый Структура(); 
				СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
				Для каждого СтрокаДанных Из Результат Цикл
					
					ЗаполнитьЗначенияСвойств(СтруктураПоискаРаздела, СтрокаДанных);
					
					НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
					НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
					
					СтрокиДоходов = ТаблицаДоходовСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					СтрокиКоличеств = ТаблицаКоличествСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					СтрокиВзносов = ТаблицаВзносовСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					Если СтрокиДоходов.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиДоходов[0]);
					КонецЕсли;
					Если СтрокиКоличеств.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиКоличеств[0]);
					КонецЕсли;
					Если СтрокиВзносов.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиВзносов[0]);
					КонецЕсли;
					
				КонецЦикла;
			Иначе	
				СтрокаПодраздела3_2 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
				СтрокаПодраздела3_2.Данные = Новый Структура(); 
				СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Раздел1Прил1.Количество() = 0 Тогда
			НоваяСтрока = Раздел1Прил1.Добавить();
			НоваяСтрока.Данные = Новый Структура("П000110000101","01");
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПодразделов1и2 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодразделов1и2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подразделы1и2); 
			СтрокаПодразделов1и2.ДанныеМногострочныхЧастей = Новый Структура();
			ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные, КоличествоЗастрахованных);
			СтрокаПодраздела3_1 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодраздела3_1.Данные = Новый Структура(); 
			СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
			НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
			НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
			СтрокаПодраздела3_2 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
			СтрокаПодраздела3_2.Данные = Новый Структура(); 
			СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
			НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
			НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
			СтрокаПрил2 = Раздел1Прил2ПоТарифам.Добавить();
			СтрокаПрил2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил2);
			СтрокаПрил2.Данные.П00012М100101 = "01";
			СтрокаПрил2.Данные.П00012М100201 = ?(ДатаКонцаПериодаОтчета > ПрямыеВыплатыПособийСоциальногоСтрахования.ДатаПередачиФССВыплатыПособий(Организация),"1","2");
			СтрокаПрил2.ДанныеМногострочныхЧастей = Новый Структура();
		КонецЕсли;
		
		// Приложение 2, расходы
		ТаблицаПриложения2Расходы = ОписаниеТаблиц.РасходыФСС2020;
		Если ТаблицаПриложения2Расходы.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Раздел1Прил2.Данные, ТаблицаПриложения2Расходы[0]);
		КонецЕсли;
		
		// Приложение 1.1 
		ТаблицаДоходовАвиаторовГорняков = ОписаниеТаблиц.Приложение11Доходы2020;
		ТаблицаКоличествАвиаторовГорняков = ОписаниеТаблиц.Приложение11Численность2020;
		ТаблицаВзносовАвиаторовГорняков = ОписаниеТаблиц.Приложение11Взносы2020;
		СтруктураПоискаРаздела = Новый Структура("П00111М100101");
		Для Сч = 1 По 2 Цикл
			
			СтруктураПоискаРаздела.П00111М100101 = Строка(Сч);
			
			СтрокиДоходов = ТаблицаДоходовАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
			СтрокиКоличеств = ТаблицаКоличествАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
			СтрокиВзносов = ТаблицаВзносовАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
			
			Если СтрокиДоходов.Количество() = 0 И СтрокиВзносов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПриложения11 = Раздел1Прил11.Добавить(); 
			СтрокаПриложения11.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил11); 
			СтрокаПриложения11.ДанныеМногострочныхЧастей = Новый Структура();
			
			Если СтрокиДоходов.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПриложения11.Данные,СтрокиДоходов[0]);
			КонецЕсли;
			Если СтрокиКоличеств.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПриложения11.Данные,СтрокиКоличеств[0]);
			КонецЕсли;
			Если СтрокиВзносов.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПриложения11.Данные,СтрокиВзносов[0]);
			КонецЕсли;
			
		КонецЦикла;
		Если Раздел1Прил11.Количество() = 0 Тогда
			СтрокаПриложения11 = Раздел1Прил11.Добавить();
			СтрокаПриложения11.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил11); 
			СтрокаПриложения11.ДанныеМногострочныхЧастей = Новый Структура();
		КонецЕсли;
		
		// Приложение 8
		Результат = ОписаниеТаблиц.Иностранцы;
		Если Результат.Количество() > 0 Тогда
			Для каждого СтрокаДанных Из Результат Цикл
				НоваяСтрока = Раздел1Прил8.Добавить();
				НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил8);
				НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
				ЗаполнитьЗначенияСвойств(НоваяСтрока.Данные, СтрокаДанных);
			КонецЦикла;
		Иначе
			НоваяСтрока = Раздел1Прил8.Добавить();
			НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил8);
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
		КонецЕсли;
		
	КонецЕсли;
	
	// Раздел 3
	Если ВсеФизлица.Количество() > 0 Тогда
		ТаблицаДоходовФизлиц = ОписаниеТаблиц.Подраздел321Доходы2020;
		ТаблицаВредныхДоходовФизлиц = ОписаниеТаблиц.Подраздел322Доходы2020;
		ТаблицаДоходовФизлиц.Индексы.Добавить("ФизическоеЛицо");
		ТаблицаВредныхДоходовФизлиц.Индексы.Добавить("ФизическоеЛицо");
		СтруктураПоискаПоФизлицу = Новый Структура("ФизическоеЛицо");
		Для каждого СтрокаРезультата Из ВсеФизлица Цикл
			
			НоваяСтрока = Раздел3.Добавить();
			НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейРаздел3);
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура("П00321М1,П00322М1", НовоеПустоеДеревоДляРСВ(), НовоеПустоеДеревоДляРСВ());
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока.Данные, СтрокаРезультата);
			Если СтрокаРезультата.ФизическоеЛицо <> Неопределено И СтрокаРезультата.П000030001001 <> "1" Тогда
				СтруктураПоискаПоФизлицу.ФизическоеЛицо = СтрокаРезультата.ФизическоеЛицо;
				СтрокиДоходов = ТаблицаДоходовФизлиц.НайтиСтроки(СтруктураПоискаПоФизлицу);
				СтрокиВредныхДоходов = ТаблицаВредныхДоходовФизлиц.НайтиСтроки(СтруктураПоискаПоФизлицу);
				Для каждого СтрокаДанных Из СтрокиДоходов Цикл
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
					ЗаполнитьЗначенияСвойств(СтрокаДохода.Данные, СтрокаДанных);
					Если ЗначениеЗаполнено(СтрокаДохода.Данные.П00321М112001) Тогда
						ОстатокОтДеления = СтрокаДанных.П00321М112001 % 3;
						СтрокаДохода.Данные.П00321М112001 = ?(ОстатокОтДеления = 0, 3, ОстатокОтДеления);
					Иначе
						СтрокаДохода.Данные.П00321М112001 = "";
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаДохода.Данные.П00321М113001) Тогда
						СтрокаДохода.Данные.П00321М113001 = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаДохода.Данные.П00321М113001);
					Иначе
						СтрокаДохода.Данные.П00321М113001 = "";
					КонецЕсли;
				КонецЦикла;
				Для каждого СтрокаДанных Из СтрокиВредныхДоходов Цикл
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
					ЗаполнитьЗначенияСвойств(СтрокаДохода.Данные, СтрокаДанных);
					Если ЗначениеЗаполнено(СтрокаДохода.Данные.П00322М118001) Тогда
						ОстатокОтДеления = СтрокаДанных.П00322М118001 % 3;
						СтрокаДохода.Данные.П00322М118001 = ?(ОстатокОтДеления = 0, 3, ОстатокОтДеления);
					Иначе
						СтрокаДохода.Данные.П00322М118001 = "";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Количество() = 0 Тогда
				СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
				СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
			КонецЕсли;
			Если НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Количество() = 0 Тогда
				СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
				СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		НоваяСтрока = Раздел3.Добавить();
		НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейРаздел3);
		НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура("П00321М1,П00322М1", НовоеПустоеДеревоДляРСВ(), НовоеПустоеДеревоДляРСВ());
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РСВ_2017Кв1(ПоказателиОтчета) Экспорт
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000110000101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110001005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002102", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002103", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002104", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110002105", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110003005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110004005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110005105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006204", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011110006205", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120001005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120002005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120003005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120004005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П011120006005", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М100101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М101005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М102005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М103005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11131М105005", Истина, Истина);
		
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М100101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М100301", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М101005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М102005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М103005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П11132М105005", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М100101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М101001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М101002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М101003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М101004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М101005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М102001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М102003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М102004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М102005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М103001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М103003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М103004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М103005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М105001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М105003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М105004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П01114М105005", Истина, Истина);
		
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120000101", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120001002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120001003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120001004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120001005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120002001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120002003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120002004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120002005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120003004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120003005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120004004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120004005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005204", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005205", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005301", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005303", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005304", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005305", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005401", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005403", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005404", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120005405", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120006001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120006003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120006004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120006005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120007005", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000120008005", Истина, Истина);

	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М102001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М103001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М104001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М105001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М106001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М107001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М107002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М108001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М108003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М108004", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00019М108005", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030004001", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310006001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310007001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310008001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310009001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310010001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310011001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310012001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310013001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310014001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310015001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310015002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310016001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310017001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000310018001", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М119001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М120001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М121001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М122001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М123001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00321М124001", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М126001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М127001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М128001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00322М129001", Истина, Истина);
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ_2017Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	ДатаАктуальности = Макс(ОкончаниеПериода, КонецДня(ПараметрыОтчета.ДатаПодписи));
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеДокументовВУчетеСтраховыхВзносов");
		Модуль.ОтразитьДокументыВУчетеСтраховыхВзносов(Организация);
	КонецЕсли;
	
	// очищаем разделы
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_РСВ_2017Кв1(ПоказателиОтчета);
	
	Раздел1Прил1 = Контейнер.Раздел1Прил1.Строки;
	СтруктураПолейПрил1Подразделы1и2 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[0].Строки[0].Данные);
	СтруктураПолейПрил1Подраздел3_1 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[1].Строки[0].ДанныеМногострочныхЧастей.П11131М1.Строки[0].Данные);
	СтруктураПолейПрил1Подраздел3_2 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[2].Строки[0].ДанныеМногострочныхЧастей.П11132М1.Строки[0].Данные);
	СтруктураПолейПрил1Подраздел4 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил1[0].Строки[3].Строки[0].ДанныеМногострочныхЧастей.П01114М1.Строки[0].Данные);
	
	Раздел1Прил1.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подразделы1и2);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подраздел3_1);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подраздел3_2);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил1Подраздел4);
	
	Раздел1Прил2 = Контейнер.Раздел1Прил2.Строки[0].Данные;
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, Раздел1Прил2);
	
	Раздел1Прил8 = Контейнер.Раздел1Прил8.Строки[0].ДанныеМногострочныхЧастей.П00018М1.Строки;
	СтруктураПолейПрил8 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил8[0].Данные);
	Раздел1Прил8.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил8);
	СтрокаПрил8 = Раздел1Прил8.Добавить();
	СтрокаПрил8.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил8);
	СтрокаПрил8.ДанныеМногострочныхЧастей = Новый Структура;
	
	Раздел1Прил9 = Контейнер.Раздел1Прил9.Строки[0].ДанныеМногострочныхЧастей.П00019М1.Строки;
	СтруктураПолейПрил9 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел1Прил9[0].Данные);
	Раздел1Прил9.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПрил9);
	
	Раздел3 = Контейнер.Раздел3.Строки;
	СтруктураПолейРаздел3 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].Данные);
	СтруктураПолейПодраздел321 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].ДанныеМногострочныхЧастей.П00321М1.Строки[0].Данные);
	СтруктураПолейПодраздел322 = ОбщегоНазначения.СкопироватьРекурсивно(Раздел3[0].ДанныеМногострочныхЧастей.П00322М1.Строки[0].Данные);
	Раздел3.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейРаздел3);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПодраздел321);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолейПодраздел322);
	
	МассивФизическихЛиц = Неопределено;
	Если ПараметрыОтчета.Свойство("ФормированиеПерсонифицированныхСведенийОЗастрахованныхЛицах") Тогда
		
		ПараметрыОтчета.Свойство("МассивФизическихЛиц", МассивФизическихЛиц);
		КлючиСтруктурыОписанийТаблиц = "Подразделы12Доходы2017,Подразделы12Тарифы2017,Подразделы12Взносы2017,Подраздел3Физлица2017,Подраздел321Доходы2017,Подраздел322Доходы2017";
		
	Иначе
		КлючиСтруктурыОписанийТаблиц = "Подразделы12Доходы2017,Подразделы12Численность2017,Подразделы12Взносы2017,Подразделы12Тарифы2017,Подраздел31Доходы2017,Подраздел31Численность2017,Подраздел31Взносы2017,Подраздел32Основания2017,Подраздел32Численность2017,Подраздел32Доходы2017,Подраздел32Взносы2017,ВсегоЗастрахованных,ДоходыФСС2017,Иностранцы,Подраздел3Физлица2017,Подраздел321Доходы2017,Подраздел322Доходы2017,Подраздел4Доходы2017,Подраздел4Численность2017,Подраздел4Взносы2017";
	КонецЕсли;
	
	ОписаниеТаблиц = Новый Структура(КлючиСтруктурыОписанийТаблиц);
	ОписаниеТаблиц.Вставить("НомерКорректировки", НомерКорректировки);	
	ОписаниеТаблиц.Вставить("НомерПервогоРаздела3", 1);	
	РасчетПоказателей_РСВ_2018(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, Ложь, ДатаАктуальности, МассивФизическихЛиц);
	
	// Вывод данных в отчет
	
	Если ПараметрыОтчета.Свойство("ФормированиеПерсонифицированныхСведенийОЗастрахованныхЛицах") Тогда
		
		ВсеТарифы = ОписаниеТаблиц.Подразделы12Тарифы2017;
		ТаблицаДоходов = ОписаниеТаблиц.Подразделы12Доходы2017;
		ТаблицаВзносов = ОписаниеТаблиц.Подразделы12Взносы2017;
		ТарифыСПроблемамиУчета = Новый Массив;
		Для каждого СтрокаРезультата Из ВсеТарифы Цикл
			
			СтрокаДоходов = ТаблицаДоходов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаВзносов = ТаблицаВзносов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			
			Если СтрокаДоходов = Неопределено И СтрокаВзносов = Неопределено Тогда // По текущему тарифу нет данных.
				Продолжить;
			ИначеЕсли СтрокаДоходов = Неопределено И СтрокаВзносов <> Неопределено Тогда // По текущему тарифу есть проблемы учета.
				ТарифыСПроблемамиУчета.Добавить(СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		КоличествоЗастрахованных = Новый Структура;
		Если ОписаниеТаблиц.ВсегоЗастрахованных.Количество() > 0 Тогда
			КоличествоЗастрахованных = ОписаниеТаблиц.ВсегоЗастрахованных[0];
		КонецЕсли;
		
		// Приложение 1 Раздела 1 
		ВсеТарифы = ОписаниеТаблиц.Подразделы12Тарифы2017;
		ТаблицаВсегоЗастрахованных = ОписаниеТаблиц.ВсегоЗастрахованных;
		ТаблицаДоходов = ОписаниеТаблиц.Подразделы12Доходы2017;
		ТаблицаКоличеств = ОписаниеТаблиц.Подразделы12Численность2017;
		ТаблицаВзносов = ОписаниеТаблиц.Подразделы12Взносы2017;
		ТаблицаДоходовБезСпецОценки = ОписаниеТаблиц.Подраздел31Доходы2017;
		ТаблицаКоличествБезСпецОценки = ОписаниеТаблиц.Подраздел31Численность2017;
		ТаблицаВзносовБезСпецОценки = ОписаниеТаблиц.Подраздел31Взносы2017;
		ВсеОснованияСпецОценки = ОписаниеТаблиц.Подраздел32Основания2017;
		ТаблицаДоходовСоСпецОценкой = ОписаниеТаблиц.Подраздел32Доходы2017;
		ТаблицаКоличествСоСпецОценкой = ОписаниеТаблиц.Подраздел32Численность2017;
		ТаблицаВзносовСоСпецОценкой = ОписаниеТаблиц.Подраздел32Взносы2017;
		ТаблицаДоходовАвиаторовГорняков = ОписаниеТаблиц.Подраздел4Доходы2017;
		ТаблицаКоличествАвиаторовГорняков = ОписаниеТаблиц.Подраздел4Численность2017;
		ТаблицаВзносовАвиаторовГорняков = ОписаниеТаблиц.Подраздел4Взносы2017;
		ТарифыСПроблемамиУчета = Новый Массив;
		Для каждого СтрокаРезультата Из ВсеТарифы Цикл
			
			СтрокаВсегоЗастрахованных = ТаблицаВсегоЗастрахованных.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаДоходов = ТаблицаДоходов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаКоличеств = ТаблицаКоличеств.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			СтрокаВзносов = ТаблицаВзносов.Найти(СтрокаРезультата.ВидТарифаСтраховыхВзносов,"ВидТарифаСтраховыхВзносов");
			
			Если СтрокаДоходов = Неопределено И СтрокаВзносов = Неопределено Тогда // По текущему тарифу нет данных.
				Продолжить;
			ИначеЕсли СтрокаДоходов = Неопределено И СтрокаВзносов <> Неопределено Тогда // По текущему тарифу есть проблемы учета.
				ТарифыСПроблемамиУчета.Добавить(СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			КонецЕсли;
			
			Если ТарифыСПроблемамиУчета.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Раздел1Прил1.Добавить();
			НоваяСтрока.Данные = Новый Структура("П000110000101",СтрокаРезультата.КодТарифа);
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПодразделов1и2 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодразделов1и2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подразделы1и2); 
			СтрокаПодразделов1и2.ДанныеМногострочныхЧастей = Новый Структура();
			
			// Подразделы 1 и 2
			
			Если СтрокаВсегоЗастрахованных <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные, СтрокаВсегоЗастрахованных);
			КонецЕсли;
			Если СтрокаДоходов <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаДоходов);
			КонецЕсли;
			Если СтрокаКоличеств <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаКоличеств);
			КонецЕсли;
			Если СтрокаВзносов <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные,СтрокаВзносов);
			КонецЕсли;
			
			СтруктураПоискаПоТарифу = Новый Структура("ВидТарифаСтраховыхВзносов", СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			
			// Подраздел 3.1
			
			Результат = ТаблицаДоходовБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу);
			Если Результат.Количество() > 0 Тогда
				
				Подраздел3_1 = НоваяСтрока.Строки.Добавить().Строки;
				СтрокаПодраздела3_1 = Подраздел3_1.Добавить(); 
				СтрокаПодраздела3_1.Данные = Новый Структура(); 
				СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
				
				ДанныеПодземныеИВредныеРаботы = Неопределено;
				ДанныеТяжелыеИПрочиеРаботы = Неопределено;
				Для каждого СтрокаДанных Из Результат Цикл
					НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
					НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные, СтрокаДанных);
					Если СтрокаДанных.П11131М100101 = "1" Тогда
						ДанныеПодземныеИВредныеРаботы = НоваяСтрокаПодраздела.Данные
					Иначе
						ДанныеТяжелыеИПрочиеРаботы = НоваяСтрокаПодраздела.Данные
					КонецЕсли;
				КонецЦикла;
				
				Для каждого СтрокаДанных Из ТаблицаВзносовБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу) Цикл
					Если СтрокаДанных.П11131М100101 = "1" И ДанныеПодземныеИВредныеРаботы = Неопределено 
						Или СтрокаДанных.П11131М100101 <> "1" И ДанныеТяжелыеИПрочиеРаботы = Неопределено Тогда
						СтрокаПодраздела3_1 = Подраздел3_1.Добавить(); 
						СтрокаПодраздела3_1.Данные = Новый Структура(); 
						СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
						НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
						НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
						Если СтрокаДанных.П11131М100101 = "1" Тогда
							ДанныеПодземныеИВредныеРаботы = НоваяСтрокаПодраздела.Данные
						Иначе
							ДанныеТяжелыеИПрочиеРаботы = НоваяСтрокаПодраздела.Данные
						КонецЕсли;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(?(СтрокаДанных.П11131М100101 = "1", ДанныеПодземныеИВредныеРаботы, ДанныеТяжелыеИПрочиеРаботы), СтрокаДанных);
				КонецЦикла;
				
				Для каждого СтрокаДанных Из ТаблицаКоличествБезСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу) Цикл
					ЗаполнитьЗначенияСвойств(?(СтрокаДанных.П11131М100101 = "1", ДанныеПодземныеИВредныеРаботы, ДанныеТяжелыеИПрочиеРаботы), СтрокаДанных);
				КонецЦикла;
				
			Иначе	
				СтрокаПодраздела3_1 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
				СтрокаПодраздела3_1.Данные = Новый Структура(); 
				СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
			КонецЕсли;
			
			// Подраздел 3.2
			
			СтруктураПоискаРаздела = Новый Структура("ВидТарифаСтраховыхВзносов, П11132М100101, П11132М100301", СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			Результат = ВсеОснованияСпецОценки.НайтиСтроки(СтруктураПоискаПоТарифу);
			Если Результат.Количество() > 0 Тогда
				Подраздел3_2 = НоваяСтрока.Строки.Добавить().Строки;
				СтрокаПодраздела3_2 = Подраздел3_2.Добавить(); 
				СтрокаПодраздела3_2.Данные = Новый Структура(); 
				СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
				Для каждого СтрокаДанных Из Результат Цикл
					
					ЗаполнитьЗначенияСвойств(СтруктураПоискаРаздела, СтрокаДанных);
									
					НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
					НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
					
					СтрокиДоходов = ТаблицаДоходовСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					СтрокиКоличеств = ТаблицаКоличествСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					СтрокиВзносов = ТаблицаВзносовСоСпецОценкой.НайтиСтроки(СтруктураПоискаРаздела);
					Если СтрокиДоходов.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиДоходов[0]);
					КонецЕсли;
					Если СтрокиКоличеств.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиКоличеств[0]);
					КонецЕсли;
					Если СтрокиВзносов.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиВзносов[0]);
					КонецЕсли;
					
				КонецЦикла;
			Иначе	
				СтрокаПодраздела3_2 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
				СтрокаПодраздела3_2.Данные = Новый Структура(); 
				СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
			КонецЕсли;
			
			// Подраздел 4
			СтруктураПоискаРаздела = Новый Структура("ВидТарифаСтраховыхВзносов, П01114М100101", СтрокаРезультата.ВидТарифаСтраховыхВзносов);
			Подраздел4 = НоваяСтрока.Строки.Добавить().Строки;
			Для Сч = 1 По 2 Цикл
				
				СтруктураПоискаРаздела.П01114М100101 = Строка(Сч);
				
				СтрокиДоходов = ТаблицаДоходовАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
				СтрокиКоличеств = ТаблицаКоличествАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
				СтрокиВзносов = ТаблицаВзносовАвиаторовГорняков.НайтиСтроки(СтруктураПоискаРаздела);
				
				Если СтрокиДоходов.Количество() = 0 И СтрокиВзносов.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаПодраздела4 = Подраздел4.Добавить(); 
				СтрокаПодраздела4.Данные = Новый Структура(); 
				СтрокаПодраздела4.ДанныеМногострочныхЧастей = Новый Структура("П01114М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела4.ДанныеМногострочныхЧастей.П01114М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел4);
				
				Если СтрокиДоходов.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиДоходов[0]);
				КонецЕсли;
				Если СтрокиКоличеств.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиКоличеств[0]);
				КонецЕсли;
				Если СтрокиВзносов.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПодраздела.Данные,СтрокиВзносов[0]);
				КонецЕсли;
				
			КонецЦикла;
			Если Подраздел4.Количество() = 0 Тогда
				СтрокаПодраздела4 = Подраздел4.Добавить();
				СтрокаПодраздела4.Данные = Новый Структура(); 
				СтрокаПодраздела4.ДанныеМногострочныхЧастей = Новый Структура("П01114М1", НовоеПустоеДеревоДляРСВ());
				НоваяСтрокаПодраздела = СтрокаПодраздела4.ДанныеМногострочныхЧастей.П01114М1.Строки.Добавить();
				НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел4);
			КонецЕсли;
			
		КонецЦикла;
		Если Раздел1Прил1.Количество() = 0 Тогда
			НоваяСтрока = Раздел1Прил1.Добавить();
			НоваяСтрока.Данные = Новый Структура("П000110000101","01");
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
			СтрокаПодразделов1и2 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодразделов1и2.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подразделы1и2); 
			СтрокаПодразделов1и2.ДанныеМногострочныхЧастей = Новый Структура();
			ЗаполнитьЗначенияСвойств(СтрокаПодразделов1и2.Данные, КоличествоЗастрахованных);
			СтрокаПодраздела3_1 = НоваяСтрока.Строки.Добавить().Строки.Добавить(); 
			СтрокаПодраздела3_1.Данные = Новый Структура(); 
			СтрокаПодраздела3_1.ДанныеМногострочныхЧастей = Новый Структура("П11131М1", НовоеПустоеДеревоДляРСВ());
			НоваяСтрокаПодраздела = СтрокаПодраздела3_1.ДанныеМногострочныхЧастей.П11131М1.Строки.Добавить();
			НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_1);
			СтрокаПодраздела3_2 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
			СтрокаПодраздела3_2.Данные = Новый Структура(); 
			СтрокаПодраздела3_2.ДанныеМногострочныхЧастей = Новый Структура("П11132М1", НовоеПустоеДеревоДляРСВ());
			НоваяСтрокаПодраздела = СтрокаПодраздела3_2.ДанныеМногострочныхЧастей.П11132М1.Строки.Добавить();
			НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел3_2);
			СтрокаПодраздела4 = НоваяСтрока.Строки.Добавить().Строки.Добавить();
			СтрокаПодраздела4.Данные = Новый Структура(); 
			СтрокаПодраздела4.ДанныеМногострочныхЧастей = Новый Структура("П01114М1", НовоеПустоеДеревоДляРСВ());
			НоваяСтрокаПодраздела = СтрокаПодраздела4.ДанныеМногострочныхЧастей.П01114М1.Строки.Добавить();
			НоваяСтрокаПодраздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил1Подраздел4);
		КонецЕсли;
		
	КонецЕсли;
	
	// Раздел 3
	ФизлицаСПроблемамиУчета = Новый Массив;
	ВсеФизлица = ОписаниеТаблиц.Подраздел3Физлица2017;
	Если ВсеФизлица.Количество() > 0 Тогда
		СтрокиСОшибками = ВсеФизлица;
		Для каждого СтрокаРезультата Из ВсеФизлица.НайтиСтроки(Новый Структура("ЕстьОшибкаСНИЛС", Истина)) Цикл
			Если ЗначениеЗаполнено(СтрЗаменить(СтрокаРезультата.П000310007001, "-", "")) Тогда
				ФизлицаСПроблемамиУчета.Добавить(СтрокаРезультата);
			КонецЕсли;
		КонецЦикла;
		Если ФизлицаСПроблемамиУчета.Количество() = 0 И ТарифыСПроблемамиУчета.Количество() = 0 Тогда
			ТаблицаДоходовФизлиц = ОписаниеТаблиц.Подраздел321Доходы2017;
			ТаблицаВредныхДоходовФизлиц = ОписаниеТаблиц.Подраздел322Доходы2017;
			ТаблицаДоходовФизлиц.Индексы.Добавить("ФизическоеЛицо");
			ТаблицаВредныхДоходовФизлиц.Индексы.Добавить("ФизическоеЛицо");
			СтруктураПоискаПоФизлицу = Новый Структура("ФизическоеЛицо");
			НомерПП = ОписаниеТаблиц.НомерПервогоРаздела3;
			Для каждого СтрокаРезультата Из ВсеФизлица Цикл
					
				НоваяСтрока = Раздел3.Добавить();
				НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейРаздел3);
				НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура("П00321М1,П00322М1", НовоеПустоеДеревоДляРСВ(), НовоеПустоеДеревоДляРСВ());
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока.Данные, СтрокаРезультата);
				Если НоваяСтрока.Данные.Свойство("П000030004001") Тогда
					Если ЗначениеЗаполнено(НоваяСтрока.Данные.П000030004001) Тогда
						Если ТипЗнч(НоваяСтрока.Данные.П000030004001) = Тип("Число") Тогда
							НоваяСтрока.Данные.П000030004001 = Формат(НоваяСтрока.Данные.П000030004001, "ЧДЦ=; ЧГ=0");
						КонецЕсли;
					Иначе
						НоваяСтрока.Данные.П000030004001 = Формат(НомерПП, "ЧДЦ=; ЧГ=0");
						НомерПП = НомерПП + 1;
					КонецЕсли;
				КонецЕсли;
				
				СтруктураПоискаПоФизлицу.ФизическоеЛицо = СтрокаРезультата.ФизическоеЛицо;
				СтрокиДоходов = ТаблицаДоходовФизлиц.НайтиСтроки(СтруктураПоискаПоФизлицу);
				СтрокиВредныхДоходов = ТаблицаВредныхДоходовФизлиц.НайтиСтроки(СтруктураПоискаПоФизлицу);
				
				Для каждого СтрокаДанных Из СтрокиДоходов Цикл
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
					ЗаполнитьЗначенияСвойств(СтрокаДохода.Данные, СтрокаДанных);
					СтрокаДохода.Данные.П00321М119001 = Формат(СтрокаДохода.Данные.П00321М119001,"ЧЦ=2; ЧВН=");
					Если ЗначениеЗаполнено(СтрокаДохода.Данные.П00321М120001) Тогда
						СтрокаДохода.Данные.П00321М120001 = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаДохода.Данные.П00321М120001);
					Иначе
						СтрокаДохода.Данные.П00321М120001 = "";
					КонецЕсли;
				КонецЦикла;
				Если НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Количество() = 0 Тогда
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
				КонецЕсли;
				
				Для каждого СтрокаДанных Из СтрокиВредныхДоходов Цикл
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
					ЗаполнитьЗначенияСвойств(СтрокаДохода.Данные, СтрокаДанных);
					СтрокаДохода.Данные.П00322М126001 = Формат(СтрокаДохода.Данные.П00322М126001,"ЧЦ=2; ЧВН=");
				КонецЦикла;
				Если НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Количество() = 0 Тогда
					СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
					СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	Иначе
		НоваяСтрока = Раздел3.Добавить();
		НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейРаздел3);
		НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура("П00321М1,П00322М1", НовоеПустоеДеревоДляРСВ(), НовоеПустоеДеревоДляРСВ());
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00321М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел321);
		СтрокаДохода = НоваяСтрока.ДанныеМногострочныхЧастей.П00322М1.Строки.Добавить();
		СтрокаДохода.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПодраздел322);
	КонецЕсли;
	
	// Прекращаем работу, если выявлены ошибки учета.
	Если ТарифыСПроблемамиУчета.Количество() > 0 Или ФизлицаСПроблемамиУчета.Количество() > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выявлены ошибки ведения учета по страховым взносам%1'"), Символы.ПС);
		Если ТарифыСПроблемамиУчета.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- по следующим тарифам отсутствуют доходы, но зарегистрированы взносы:%1'"), Символы.ПС);
			Для каждого Тариф Из ТарифыСПроблемамиУчета Цикл
				ТекстСообщения = ТекстСообщения + "  " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"), Тариф, Символы.ПС);
			КонецЦикла; 	
		КонецЕсли;
		Если ФизлицаСПроблемамиУчета.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- по следующим СНИЛС в Раздел 3 отчета попадает более одной страницы, возможно, задвоены элементы справочника Физические лица:%1'"), Символы.ПС);
			Для каждого СтрокаФизлица Из ФизлицаСПроблемамиУчета Цикл
				ТекстСообщения = ТекстСообщения + "  " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '""%1"" со страницы %2 (код %3) повторяется на странице %4 (код %5)%6'"), 
					СтрокаФизлица.П000310007001, 
					СтрокаФизлица.ФИО, 
					СтрокаФизлица.Код, 
					СтрокаФизлица.ФИОДругогоФизическогоЛица, 
					СтрокаФизлица.КодДругогоФизическогоЛица, 
					Символы.ПС);
			КонецЦикла; 	
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отчет не заполнен.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если Не ПараметрыОтчета.Свойство("ФормированиеПерсонифицированныхСведенийОЗастрахованныхЛицах") Тогда
		
		// Приложения 2 и 8 Раздела 1 
		Результат = ОписаниеТаблиц.ДоходыФСС2017;
		Если Результат.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Раздел1Прил2, Результат[0]);
			ЗаполнитьЗначенияСвойств(СтрокаПрил8.Данные, Результат[0]);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Раздел1Прил2, КоличествоЗастрахованных);
		
		// Приложение 9 Раздела 1
		Результат = ОписаниеТаблиц.Иностранцы;
		Если Результат.Количество() > 0 Тогда
			Для каждого СтрокаДанных Из Результат Цикл
				НоваяСтрока = Раздел1Прил9.Добавить();
				НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил9);
				НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
				ЗаполнитьЗначенияСвойств(НоваяСтрока.Данные, СтрокаДанных);
			КонецЦикла;
		Иначе
			НоваяСтрока = Раздел1Прил9.Добавить();
			НоваяСтрока.Данные = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейПрил9);
			НоваяСтрока.ДанныеМногострочныхЧастей = Новый Структура();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура РасчетПоказателейРСВ(ИмяРасчета, НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь, ДатаАктуальности = Неопределено, МассивФизическихЛиц = Неопределено) Экспорт
	
	УточненнаяДатаАктуальности = ?(ЗначениеЗаполнено(ДатаАктуальности), ДатаАктуальности, ОкончаниеПериода);
	
	Если ИмяРасчета = "РасчетПоказателей_РСВ_2020Кв1" Тогда
		РасчетПоказателей_РСВ_2020(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, УточненнаяДатаАктуальности, МассивФизическихЛиц);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_РСВ_2017Кв1" Тогда
		РасчетПоказателей_РСВ_2018(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, УточненнаяДатаАктуальности, МассивФизическихЛиц);
	Иначе
		
	КонецЕсли;

КонецПроцедуры

Процедура РасчетПоказателей_РСВ_2021(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, ДатаАктуальности, МассивФизическихЛиц)
	
	Запрос = Новый Запрос;
	
	Если МассивФизическихЛиц <> Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		СоздатьВТФизЛицаОрганизаций(МенеджерВременныхТаблиц, МассивФизическихЛиц, ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Иначе
		МенеджерВременныхТаблиц = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоГода(ОкончаниеПериода));
	Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Месяц1", Месяц(ОкончаниеПериода) - 2);
	Запрос.УстановитьПараметр("Месяц2", Месяц(ОкончаниеПериода) - 1);
	Запрос.УстановитьПараметр("Месяц3", Месяц(ОкончаниеПериода));
	// Все данные отчета берутся по обособленному подразделению (указанной организации).
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДоходыНестрахуемыеФСС", УчетСтраховыхВзносов.ДоходыНестрахуемыеФСС());
	Запрос.УстановитьПараметр("НестрахуемыеПоОПСДоходыСтудентов", УчетСтраховыхВзносов.НестрахуемыеПоОПСДоходыСтудентов());
	
	// Получаем временные таблицы, используя общие алгоритмы.
	Запрос.МенеджерВременныхТаблиц = УчетСтраховыхВзносов.СформироватьВТРасширенныеСведенияОДоходахИВзносах(НачалоПериода, ОкончаниеПериода, Организация, МенеджерВременныхТаблиц, Истина, Истина, Истина, Истина, Истина, , , , ДатаАктуальности);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизическоеЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.Сумма - СведенияОДоходах.Скидка
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФСС КАК ЗастрахованФСС,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС
	|ПОМЕСТИТЬ ВТФизЛицаСОблагаемойБазой
	|ИЗ
	|	ВТРасширенныеСведенияОДоходахИВзносах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Организация = &ОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизическоеЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|	И СтраховыеВзносыСведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
	|	И СтраховыеВзносыСведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
	|	И (СтраховыеВзносыСведенияОДоходах.ФСС <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ФФОМС <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ПФРССуммПревышения <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.Скидка <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.Сумма <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Месяц1 КАК МесяцПериода
	|ПОМЕСТИТЬ ВТМесяцыОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Месяц2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Месяц3";
	Запрос.Выполнить();
	
	// Подразделы 1 и 2 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		СтруктураПараметров = КадровыйУчет.ПараметрыПолученияВсехСотрудниковОрганизацийПоСпискуФизическихЛиц();
		СтруктураПараметров.КадровыеДанные = "ЯвляетсяПрокурором, ЯвляетсяВоеннослужащим, РаботаетВСтуденческомОтряде, ДатаПриема, ДатаУвольнения";
		СтруктураПараметров.Организация = Организация;
		СтруктураПараметров.НачалоПериода = НачалоПериода;
		СтруктураПараметров.ОкончаниеПериода = ОкончаниеПериода;
		СтруктураПараметров.СписокФизическихЛиц = МассивФизическихЛиц;
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Ложь, СтруктураПараметров, "ВТСотрудники");
		
		// Формируем список месяцев, в разрезе которых собираем данные.
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, НачалоГода(ОкончаниеПериода), НачалоМесяца(ОкончаниеПериода));
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТВоеннослужащие
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ФизЛица
		|		ПО (ФизЛица.ДатаПриема <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.ДатаУвольнения >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ЯвляетсяВоеннослужащим
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПрокуроры
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ФизЛица
		|		ПО (ФизЛица.ДатаПриема <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.ДатаУвольнения >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ЯвляетсяПрокурором
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&НачалоОтчетногоПериода КАК НачалоПериода,
		|	&КонецОтчетногоПериода КАК ОкончаниеПериода,
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	ВТСотрудники КАК ФизЛица
		|ГДЕ
		|	НЕ ФизЛица.ЯвляетсяВоеннослужащим
		|	И НЕ ФизЛица.РаботаетВСтуденческомОтряде
		|
		|СГРУППИРОВАТЬ ПО
		|	ФизЛица.ФизическоеЛицо";
		ФизЛицаОрганизаций = Запрос.Выполнить().Выгрузить();
		
		Запрос.УстановитьПараметр("ТаблицаДоговоров", КадровыйУчет.ДоговорыФизическихЛиц(ФизЛицаОрганизаций)); ФизЛицаОрганизаций = Неопределено; 
		Запрос.УстановитьПараметр("ДоходыНестрахуемыеПоОПС", УчетСтраховыхВзносов.ДоходыНестрахуемыеПоОПС());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДоговоров.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаДоговоров.ВидДоговора КАК ВидДоговора,
		|	ТаблицаДоговоров.Окончание КАК Окончание,
		|	ТаблицаДоговоров.Начало КАК Начало
		|ПОМЕСТИТЬ ВТДоговоры
		|ИЗ
		|	&ТаблицаДоговоров КАК ТаблицаДоговоров
		|ГДЕ
		|	ТаблицаДоговоров.Организация = &ОбособленноеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Периоды.Период КАК Период,
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НЕ МИНИМУМ(ФизЛица.ВидДоговора) КАК ЕстьТрудовойДоговор
		|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ФизЛица
		|		ПО (ФизЛица.Начало <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.Окончание >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ФизЛица.ФизическоеЛицо,
		|	Периоды.Период";
		Запрос.Выполнить();
		
		УчетСтраховыхВзносов.СформироватьВТДанныеОПравахНаСтрахование(Запрос.МенеджерВременныхТаблиц, "ВТПериодыФизЛицОрганизаций", Ложь, ДатаАктуальности);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизЛица.Период КАК Период,
		|	ФизЛица.ЕстьТрудовойДоговор КАК ЕстьТрудовойДоговор,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	ДанныеОПравахНаСтрахование.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФСС
		|		ИЛИ ДанныеОПравахНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФСС
		|ПОМЕСТИТЬ ВТЗастрахованныеЛицаБезТарифов
		|ИЗ
		|	ВТПериодыФизЛицОрганизаций КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравахНаСтрахование КАК ДанныеОПравахНаСтрахование
		|		ПО ФизЛица.ФизическоеЛицо = ДанныеОПравахНаСтрахование.ФизическоеЛицо
		|			И ФизЛица.Период = ДанныеОПравахНаСтрахование.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизическоеЛицо,
		|	ФизЛица.Период,
		|	ЛОЖЬ,
		|	ФизЛица.ЗастрахованФССкакИностранец,
		|	ФизЛица.ЗастрахованПФР,
		|	ФизЛица.ЗастрахованФОМС,
		|	ФизЛица.ЗастрахованФСС
		|		ИЛИ ФизЛица.ЗастрахованФССкакИностранец
		|ИЗ
		|	ВТФизЛицаСОблагаемойБазой КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыФизЛицОрганизаций КАК ФизЛицаСДоговорами
		|		ПО ФизЛица.ФизическоеЛицо = ФизЛицаСДоговорами.ФизическоеЛицо
		|			И ФизЛица.Период = ФизЛицаСДоговорами.Период
		|ГДЕ
		|	ФизЛица.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ФизЛицаСДоговорами.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.Сумма) КАК ОбщаяСумма,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенежноеДовольствиеВоеннослужащих,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходыСтудентов,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеПоОПС)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НестрахуемыеДоходы,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеФСС)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НестрахуемыеФССДоходы
		|ПОМЕСТИТЬ ВТНестрахуемыеДоходы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ЕСТЬNULL(СведенияОДоходах.ВидТарифаСтраховыхВзносов, ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗастрахованныеЛицаБезТарифов.Период КАК Период,
		|	(НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0)
		|			И Прокуроры.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) <> ЕСТЬNULL(НестрахуемыеДоходыФизлиц.НестрахуемыеДоходы, 0) КАК ВключатьВРаздел3,
		|	(НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0)
		|			И Прокуроры.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) <> ЕСТЬNULL(НестрахуемыеДоходыФизлиц.НестрахуемыеДоходы, 0) - ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ДоходыСтудентов, 0) КАК ВключатьВРаздел1,
		|	ЗастрахованныеЛицаБезТарифов.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ЗастрахованныеЛицаБезТарифов.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	(ЗастрахованныеЛицаБезТарифов.ЕстьТрудовойДоговор
		|		ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|		И ЗастрахованныеЛицаБезТарифов.ЗастрахованФСС КАК ЗастрахованФСС,
		|	(ЗастрахованныеЛицаБезТарифов.ЕстьТрудовойДоговор
		|		ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|		И ЗастрахованныеЛицаБезТарифов.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец
		|ПОМЕСТИТЬ ВТЗастрахованныеЛицаОрганизации
		|ИЗ
		|	ВТЗастрахованныеЛицаБезТарифов КАК ЗастрахованныеЛицаБезТарифов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНестрахуемыеДоходы КАК НестрахуемыеДоходыФизлиц
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = НестрахуемыеДоходыФизлиц.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = НестрахуемыеДоходыФизлиц.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВоеннослужащие КАК Военнослужащие
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = Военнослужащие.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = Военнослужащие.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрокуроры КАК Прокуроры
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = Прокуроры.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = Прокуроры.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСОблагаемойБазой КАК СведенияОДоходах
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = СведенияОДоходах.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
		|		ПО ЗастрахованныеЛицаБезТарифов.Период = ВидыТарифовИзУчетнойПолитики.Период
		|ГДЕ
		|	(ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0
		|				И Военнослужащие.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.ДенежноеДовольствиеВоеннослужащих)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	Период";
		Запрос.Выполнить();
		
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("ВсеТарифы2020") 
		Или ОписаниеТаблиц.Свойство("ДоходыВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("ЧисленностьВРазрезеТарифов2020") 
		Или ОписаниеТаблиц.Свойство("ВзносыВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") 
		Или ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		УчетСтраховыхВзносов.СоздатьВТКодыВидовТарифаСтраховыхВзносов(НачалоПериода, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц, Истина);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	СведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
		|	СведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(КодыВидовТарифаСтраховыхВзносов.КодФНС, """") КАК КодТарифа,
		|	СУММА(СведенияОДоходах.ПФРССуммПревышения) КАК ИсчисленоПФРССуммПревышения,
		|	СУММА(СведенияОДоходах.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
		|	СУММА(СведенияОДоходах.ФФОМС) КАК ФФОМС,
		|	СУММА(СведенияОДоходах.ФСС) КАК ФСС,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПФР - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.ВыплатыУказанныеВПункте1Части3Статьи9 + ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.СуммаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоВсего,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФОМС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НачисленоВсегоФОМС,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФСС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НачисленоВсегоФCС,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПФР - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.ВыплатыУказанныеВПункте1Части3Статьи9 - СведенияОДоходах.РасходыПоАвторскимПФР + ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.СуммаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеОблагается,
		|	СУММА(СведенияОДоходах.НеОблагаетсяФОМС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.РасходыПоАвторскимФОМС) КАК НеОблагаетсяФОМС,
		|	СУММА(СведенияОДоходах.НеОблагаетсяФСС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НеОблагаетсяФСС,
		|	СУММА(СведенияОДоходах.РасходыПоАвторскимПФР) КАК РасходыПоАвторскимПФР,
		|	СУММА(СведенияОДоходах.РасходыПоАвторскимФОМС) КАК РасходыПоАвторскимФОМС,
		|	СУММА(СведенияОДоходах.БазаПФР) КАК ОблагаемаяБазаПФР,
		|	СУММА(СведенияОДоходах.БазаФОМС) КАК ОблагаемаяБазаФОМС,
		|	СУММА(СведенияОДоходах.БазаФСС) КАК БазаФСС,
		|	СУММА(СведенияОДоходах.БазаПФР - СведенияОДоходах.СуммаПревысившаяПределПФР) КАК СуммаНеПревысившаяПределПФР,
		|	СУММА(СведенияОДоходах.БазаПФР - СведенияОДоходах.СуммаПревысившаяПределПФР - (СведенияОДоходах.БазаПФРПоТрудовомуДоговору - СведенияОДоходах.СуммаПревысившаяПределПФРПоТрудовомуДоговору)) КАК СуммаНеПревысившаяПределПФРпоГПХ,
		|	СУММА(СведенияОДоходах.СуммаПревысившаяПределПФР) КАК СуммаПревысившаяПределПФР,
		|	СУММА(СведенияОДоходах.СуммаПревысившаяПределФСС) КАК СуммаПревысившаяПределФСС,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТДоходыВзносов
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыВидовТарифаСтраховыхВзносов КАК КодыВидовТарифаСтраховыхВзносов
		|		ПО (ГОД(СведенияОДоходах.Период) = КодыВидовТарифаСтраховыхВзносов.РасчетныйПериод)
		|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = КодыВидовТарифаСтраховыхВзносов.ВидТарифаСтраховыхВзносов
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И (СведенияОДоходах.ЗастрахованПФР
		|			ИЛИ СведенияОДоходах.ЗастрахованФСС
		|			ИЛИ СведенияОДоходах.ЗастрахованФССкакИностранец
		|			ИЛИ СведенияОДоходах.ЗастрахованФОМС)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И (СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|				И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|			ИЛИ СведенияОДоходах.ФФОМС <> 0
		|			ИЛИ СведенияОДоходах.ПФРССуммПревышения <> 0
		|			ИЛИ СведенияОДоходах.ПФРПоСуммарномуТарифу <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.ВидЗастрахованногоЛица,
		|	СведенияОДоходах.ЗастрахованПФР,
		|	СведенияОДоходах.ЗастрахованФОМС,
		|	ЕСТЬNULL(КодыВидовТарифаСтраховыхВзносов.КодФНС, """"),
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	Период";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|ГДЕ
		|	Доходы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)";
		Если Запрос.Выполнить().Пустой() Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизическиеЛица.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	МЕСЯЦ(ФизическиеЛица.Период) КАК Период,
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованПФР
			|				И ФизическиеЛица.ВключатьВРаздел1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоОПС,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованФОМС 
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоОМС,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованФСС 
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоФСС
			|ПОМЕСТИТЬ ВТЗастрахованныеПоМесяцам
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК ФизическиеЛица";
			
		Иначе
			
			// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаОПС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаОМС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаФСС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаОПС.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаОПС.Период КАК Период,
			|	ЗастрахованныеНаОПС.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТФизическиеЛица
			|ИЗ
			|	ВТЗастрахованныеНаОПС КАК ЗастрахованныеНаОПС
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаОМС.ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаОМС.Период,
			|	ЗастрахованныеНаОМС.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеНаОМС КАК ЗастрахованныеНаОМС
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаФСС.ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаФСС.Период,
			|	ЗастрахованныеНаФСС.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеНаФСС КАК ЗастрахованныеНаФСС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизическиеЛица.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	МЕСЯЦ(ФизическиеЛица.Период) КАК Период,
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаОПС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоОПС,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаОМС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоОМС,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаФСС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоФСС
			|ПОМЕСТИТЬ ВТЗастрахованныеПоМесяцам
			|ИЗ
			|	ВТФизическиеЛица КАК ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаОПС КАК ЗастрахованныеНаОПС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаОПС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаОПС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаОПС.ВидТарифаСтраховыхВзносов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаОМС КАК ЗастрахованныеНаОМС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаОМС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаОМС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаОМС.ВидТарифаСтраховыхВзносов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаФСС КАК ЗастрахованныеНаФСС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаФСС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаФСС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаФСС.ВидТарифаСтраховыхВзносов
			|";

			// АПК:96-вкл
			
		КонецЕсли;
		
		Запрос.Выполнить();
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеПоМесяцам.Период КАК Период,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗастрахованныеПоМесяцам.КоличествоОПС КАК КоличествоОПС,
		|	ЗастрахованныеПоМесяцам.КоличествоОМС КАК КоличествоОМС,
		|	ЗастрахованныеПоМесяцам.КоличествоФСС КАК КоличествоФСС
		|ПОМЕСТИТЬ ВТКоличествоЗастрахованных
		|ИЗ
		|	ВТЗастрахованныеПоМесяцам КАК ЗастрахованныеПоМесяцам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов,
		|	0,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо,
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоОПС),
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоОМС),
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоФСС)
		|ИЗ
		|	ВТЗастрахованныеПоМесяцам КАК ЗастрахованныеПоМесяцам
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоЗастрахованных.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	КоличествоЗастрахованных.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001004,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001004,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101004
		|ИЗ
		|	ВТКоличествоЗастрахованных КАК КоличествоЗастрахованных
		|
		|СГРУППИРОВАТЬ ПО
		|	КоличествоЗастрахованных.ВидТарифаСтраховыхВзносов,
		|	КоличествоЗастрахованных.ФизическоеЛицо";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "КоличествоЗастрахованных");
		ОписаниеТаблиц.ЧисленностьЗастрахованныхВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ВсеТарифы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Доходы.КодТарифа,
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.КодТарифа";
		ОписаниеТаблиц.ВсеТарифы2020 = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ДоходыВРазрезеТарифов2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004504,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005101,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005102,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005103,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.НачисленоВсегоФОМС
		|			КОНЕЦ), 0) КАК П011120003001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.НеОблагаетсяФОМС
		|			КОНЕЦ), 0) КАК П011120004001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.РасходыПоАвторскимФОМС
		|			КОНЕЦ), 0) КАК П011120004501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004504,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|ГДЕ
		|	(СведенияОДоходах.ЗастрахованПФР
		|			ИЛИ СведенияОДоходах.ЗастрахованФОМС)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(0) = 0", "
			|	(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц1
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц2
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц3
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0 
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0)");
		Иначе 	
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Начисление");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(0) = 0", "
			|		СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0 
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.ДоходыВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ЧисленностьВРазрезеТарифов2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазы
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.СуммаПревысившаяПределПФР) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицаСПревышениемБазы.Период,
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
		|	ЛицаСПревышениемБазы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносами
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.ОблагаемаяБазаПФР) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМС
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.ОблагаемаяБазаФОМС) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФСС
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.БазаФСС - Доходы.СуммаПревысившаяПределФСС) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносами КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносами КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФОМС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФОМС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФССЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФСС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФССЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФСС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тарифы.ВидТарифаСтраховыхВзносов,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011110002001,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСПревышениемБазыЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011110002101,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФОМСЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011120002001,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФССЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П00012М101501,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002004,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002004,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101502,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101503,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101504,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002102,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002103,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002104
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|	ИЗ
		|		ВТДоходыВзносов КАК Доходы) КАК Тарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМесяцыОтчета КАК МесяцыОтчета
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаВсеМесяцы КАК ЛицаСВзносамиЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаОтдельныеМесяцы КАК ЛицаСВзносамиЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаВсеМесяцы КАК ЛицаСВзносамиФОМСЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы КАК ЛицаСВзносамиФОМСЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФССЗаВсеМесяцы КАК ЛицаСВзносамиФССЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФССЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФССЗаОтдельныеМесяцы КАК ЛицаСВзносамиФССЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаВсеМесяцы КАК ЛицаСПревышениемБазыЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы КАК ЛицаСПревышениемБазыЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период))
		|
		|СГРУППИРОВАТЬ ПО
		|	Тарифы.ВидТарифаСтраховыхВзносов";
		ОписаниеТаблиц.ЧисленностьВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ВзносыВРазрезеТарифов2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРПоСуммарномуТарифу), 0) КАК П011110006101,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006102,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006103,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006201,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006202,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006203,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006204,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ФФОМС), 0) КАК П011120006001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006004,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ФСС), 0) КАК П00012М106001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106004,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КодТарифа КАК КодТарифа,
		|	ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносов КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ФизическоеЛицо,
		|	ВзносыФизлиц.КодТарифа,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВзносыФизлиц.ФФОМС) <> 0
		|		ИЛИ СУММА(ВзносыФизлиц.ПФРПоСуммарномуТарифу) <> 0
		|		ИЛИ СУММА(ВзносыФизлиц.ФСС) <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов";
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		ОписаниеТаблиц.ВзносыВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Подраздел 3.1 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Подраздел31Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботы) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботы) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботы) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботы) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК ОблагаемаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) КАК ОблагаемаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТДоходыВредныхВзносов
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВредныхВзносов КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТДоходыВредныхВзносов КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Подраздел31Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел31Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Взносы.Период КАК Период,
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Период,
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	Взносы.Период КАК Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Период,
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Взносы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ Взносы.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П11131М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101004
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|ГДЕ
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ)
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|ГДЕ
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов";
		ОписаниеТаблиц.Подраздел31Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел31Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ПолеФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ПолеФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Подраздел31Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Подраздел 3.2 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Или ОписаниеТаблиц.Свойство("Подраздел32Доходы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК Основание,
		|	""1"" КАК КлассУсловийТруда,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыОпасный) КАК НачисленоВсего,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыОпасный) КАК НеОблагается,
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыОпасный) КАК ОблагаемаяБаза,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТДоходыПоКлассамУсловий
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""1"",
		|	""2"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный4),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный4),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный4),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""1"",
		|	""3"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный3),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный3),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный3),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""1"",
		|	""4"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный2),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный2),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный2),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""1"",
		|	""5"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный1),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный1),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный1),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	""1"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыОпасный),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыОпасный),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыОпасный),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	""2"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный4),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный4),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный4),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	""3"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный3),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный3),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный3),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	""4"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный2),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный2),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный2),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ,
		|	""2"",
		|	""5"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный1),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный1),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный1),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|		ИНАЧЕ СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период";
		Запрос.Выполнить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Или ОписаниеТаблиц.Свойство("Подраздел32Численность2020") Или ОписаниеТаблиц.Свойство("Подраздел32Взносы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	Взносы.Основание КАК Основание,
		|	Взносы.КлассУсловийТруда КАК КлассУсловийТруда,
		|	Взносы.Период КАК Период,
		|	СУММА(Взносы.Сумма) КАК Взносы,
		|	Взносы.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТВзносыПоКлассамУсловий
		|ИЗ
		|	(ВЫБРАТЬ
		|		""1"" КАК Основание,
		|		""1"" КАК КлассУсловийТруда,
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период КАК Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК Сумма,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""2"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""3"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""4"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""5"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""1"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""2"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""3"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""4"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""5"",
		|		ВЫБОР
		|			КОГДА ВзносыФизлиц.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
		|			ИНАЧЕ ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|		КОНЕЦ,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода) КАК Взносы
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Основание,
		|	Взносы.Период,
		|	Взносы.ФизическоеЛицо,
		|	Взносы.КлассУсловийТруда,
		|	Взносы.ВидТарифаСтраховыхВзносов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Взносы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыФизлиц.Основание КАК Основание,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда КАК КлассУсловийТруда
		|ПОМЕСТИТЬ ВТОснованияВзносов
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.Взносы > 0";
		Запрос.Выполнить()
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Тогда
		// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	Доходы.Основание КАК П11132М100101,
		|	Доходы.КлассУсловийТруда КАК П11132М100201
		|ИЗ
		|	ВТДоходыПоКлассамУсловий КАК Доходы
		|ГДЕ
		|	Доходы.НачисленоВсего > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов,
		|	Взносы.Основание,
		|	Взносы.КлассУсловийТруда
		|ИЗ
		|	ВТОснованияВзносов КАК Взносы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	П11132М100101,
		|	П11132М100201";
		// АПК:96-вкл 
		ОписаниеТаблиц.Подраздел32Основания2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Основание КАК П11132М100101,
		|	СведенияОДоходах.КлассУсловийТруда КАК П11132М100201,
		|	СведенияОДоходах.КлассУсловийТруда КАК КодКлассаУсловий,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсего), 0) КАК П11132М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П11132М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТДоходыПоКлассамУсловий КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.КлассУсловийТруда,
		|	СведенияОДоходах.Основание";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Подраздел32Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзносыПоКлассамУсловий.Основание,
		|	ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|	ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыПоКлассамУсловий.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыПоКлассамУсловий.Период
		|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыПоКлассамУсловий.Период,
		|	ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|	ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|	ВзносыПоКлассамУсловий.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзносыЗаВесьПериод.ВидТарифаСтраховыхВзносов,
		|	ВзносыЗаВесьПериод.КлассУсловийТруда,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыПоКлассамУсловий.Основание КАК Основание,
		|		ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|		ВзносыПоКлассамУсловий.КлассУсловийТруда КАК КлассУсловийТруда,
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыПоКлассамУсловий.Взносы) КАК Взносы
		|	ИЗ
		|		ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыПоКлассамУсловий.Основание,
		|		ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|		ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.ВидТарифаСтраховыхВзносов,
		|	ВзносыЗаВесьПериод.КлассУсловийТруда,
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П11132М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101004,
		|	ОснованияВзносов.ВидТарифаСтраховыхВзносов,
		|	ОснованияВзносов.КлассУсловийТруда КАК П11132М100201,
		|	ОснованияВзносов.Основание КАК П11132М100101
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносов КАК ОснованияВзносов
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|		ПО (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание)
		|			И (ОснованияВзносов.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов)
		|			И (ОснованияВзносов.КлассУсловийТруда = ЛицаСВреднымиВзносамиЗаВсеМесяцы.КлассУсловийТруда)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
		|			И (ОснованияВзносов.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|			И (ОснованияВзносов.КлассУсловийТруда = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.КлассУсловийТруда)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОснованияВзносов.ВидТарифаСтраховыхВзносов,
		|	ОснованияВзносов.КлассУсловийТруда,
		|	ОснованияВзносов.Основание";
		ОписаниеТаблиц.Подраздел32Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда КАК П11132М100201,
		|	ВзносыФизлиц.КлассУсловийТруда КАК КодКлассаУсловий,
		|	ВзносыФизлиц.Основание КАК П11132М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.Взносы), 0) КАК П11132М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Основание,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда,
		|	ВзносыФизлиц.ПолеФизическоеЛицо";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Подраздел32Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Приложения 1.1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Приложение11Доходы2020") Или ОписаниеТаблиц.Свойство("Приложение11Численность2020") Или ОписаниеТаблиц.Свойство("Приложение11Взносы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	""1"" КАК Основание,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.НеОблагаетсяПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеОблагается,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.БазаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОблагаемаяБаза,
		|	СУММА(СведенияОДоходах.ПФРНаДоплатуЛетчикам) КАК Взносы,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТДоходыВзносыАвиаторовГорняков
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И (СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			ИЛИ СведенияОДоходах.ПФРНаДоплатуЛетчикам <> 0)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	""2"",
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.НеОблагаетсяПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.БазаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(СведенияОДоходах.ПФРНаДоплатуШахтерам),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И (СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			ИЛИ СведенияОДоходах.ПФРНаДоплатуШахтерам <> 0)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";
		Запрос.Выполнить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Основание КАК П00111М100101,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсего), 0) КАК П00111М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П00111М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Основание";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Приложение11Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.Основание КАК Основание,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыФизлиц.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыФизлиц.Период КАК Период
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаОтдельныеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.Период КАК Период,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Период,
		|	ВзносыФизлиц.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыФизлиц.Основание КАК Основание
		|ПОМЕСТИТЬ ВТОснованияВзносовАвиаторовГорняков
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание КАК Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаВсеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание КАК Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаКвартал
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П00111М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101004,
		|	ОснованияВзносов.Основание КАК П00111М100101
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносовАвиаторовГорняков КАК ОснованияВзносов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаКвартал КАК ЛицаСВреднымиВзносамиЗаКвартал
		|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаКвартал.Основание
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОснованияВзносов.Основание";
		ОписаниеТаблиц.Приложение11Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.Основание КАК П00111М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.Взносы), 0) КАК П00111М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Основание,
		|	ВзносыФизлиц.ПолеФизическоеЛицо";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Приложение11Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Приложение 2 Раздела 1 
	Если ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.НачисленоВсегоФCС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.НеОблагаетсяФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеОблагается,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПревысившаяПределФСС,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.БазаФСС - СведенияОДоходах.СуммаПревысившаяПределФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БазаФССсИностранцев
		|ПОМЕСТИТЬ ВТОблагаемыеБазыПоМесяцам
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеЛицаОрганизации КАК ЗастрахованныеЛицаОрганизации
		|		ПО СведенияОДоходах.ФизическоеЛицо = ЗастрахованныеЛицаОрганизации.ФизическоеЛицо
		|			И СведенияОДоходах.Период = ЗастрахованныеЛицаОрганизации.Период
		|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗастрахованныеЛицаОрганизации.ВидТарифаСтраховыхВзносов
		|ГДЕ
		|	(ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|			ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец)";
		Запрос.Выполнить();
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.Начислено), 0) КАК П00012М102001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П00012М103001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.СуммаПревысившаяПределФСС), 0) КАК П00012М104001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаФССсИностранцев), 0) КАК П00012М105501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105504,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";

		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.ДоходыФСС2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("РасходыФСС2020") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(РасчетыСФСС.РасходыПоСтрахованию), 0) КАК П000120007001,
		|	ЕСТЬNULL(СУММА(РасчетыСФСС.ПолученоИзФонда), 0) КАК П000120008001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц1
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц2
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц3
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц1
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц2
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц3
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008004
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Период,
		|		Расчеты.Регистратор КАК Регистратор,
		|		ВЫБОР
		|			КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПолученоИзФонда)
		|				ТОГДА Расчеты.Сумма * ВЫБОР
		|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ПолученоИзФонда,
		|		ВЫБОР
		|			КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию)
		|				ТОГДА Расчеты.Сумма * ВЫБОР
		|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК РасходыПоСтрахованию
		|	ИЗ
		|		РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
		|	ГДЕ
		|		Расчеты.ЭтоСтраховыеВзносы
		|		И Расчеты.Организация = &ОбособленноеПодразделение
		|		И Расчеты.ВидОбязательногоСтрахованияСотрудников = (ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС))
		|		И Расчеты.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода) КАК РасчетыСФСС";

		ОписаниеТаблиц.РасходыФСС2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Физлица и их кадровые данные
	Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("Иностранцы") Тогда
		
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ) КАК НачалоКвартала,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(СведенияОДоходах.ВключатьВРаздел3) КАК ВключатьВРаздел3,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованПФР) КАК ЗастрахованПФР,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованФСС) КАК ЗастрахованФСС,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованФОМС) КАК ЗастрахованФОМС
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	ВТЗастрахованныеЛицаОрганизации КАК СведенияОДоходах
		|ГДЕ
		|	((СведенияОДоходах.ЗастрахованПФР
		|				ИЛИ СведенияОДоходах.ЗастрахованФОМС
		|				ИЛИ СведенияОДоходах.ЗастрахованФСС)
		|				И (СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода)
		|			ИЛИ СведенияОДоходах.ЗастрахованФССкакИностранец)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ДатаАктуальности КАК Период,
		|	Физлица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизлицаКД
		|ИЗ
		|	ВТФизлица КАК Физлица";
		Запрос.Выполнить();
		
		КадровыеДанные = "Фамилия, Имя, Отчество, Наименование, ИНН, СтраховойНомерПФР, ДатаРождения, Пол, Страна, ДокументВид, ДокументСерия, ДокументНомер, ДокументСтранаВыдачи";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц,	"ВТФизлицаКД");
		КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Ложь, КадровыеДанные);
		
	КонецЕсли;
		
	// Приложение 8 Раздела 1
	Если ОписаниеТаблиц.Свойство("Иностранцы") Тогда
		
		Если Не ОписаниеТаблиц.Свойство("ДоходыФСС2020") И Не ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") И Не ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Период КАК Период,
			|	СУММА(СведенияОДоходах.Сумма) КАК ОбщаяСумма,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеФСС)
			|				ТОГДА СведенияОДоходах.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК НестрахуемыеФССДоходы
			|ПОМЕСТИТЬ ВТНестрахуемыеДоходы
			|ИЗ
			|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
			|ГДЕ
			|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
			|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
			|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
			|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Период
			|";
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФСС) КАК Начислено
		|ПОМЕСТИТЬ ВТИностранцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНестрахуемыеДоходы КАК НестрахуемыеДоходыФизлиц
		|		ПО СведенияОДоходах.ФизическоеЛицо = НестрахуемыеДоходыФизлиц.ФизическоеЛицо
		|			И СведенияОДоходах.Период = НестрахуемыеДоходыФизлиц.Период
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И (НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма = 0
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованФССкакИностранец
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Период";
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат[0].Количество = 0 Тогда
			// колонки таблицы в этом случае не нужны		
			ОписаниеТаблиц.Иностранцы = Новый ТаблицаЗначений
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	ЕСТЬNULL(ФИОФизлиц.Наименование, """") КАК ФИО,
			|	ЕСТЬNULL(ФИОФизлиц.Фамилия, """") КАК П00018М102001,
			|	ЕСТЬNULL(ФИОФизлиц.Имя, """") КАК П00018М103001,
			|	ЕСТЬNULL(ФИОФизлиц.Отчество, """") КАК П00018М104001,
			|	ЕСТЬNULL(ФИОФизлиц.ИНН, """") КАК П00018М105001,
			|	ЕСТЬNULL(ФИОФизлиц.СтраховойНомерПФР, """") КАК П00018М106001,
			|	ЕСТЬNULL(ФИОФизлиц.Страна.Код, ""999"") КАК П00018М107001,
			|	ЕСТЬNULL(СУММА(СведенияОДоходах.Начислено), 0) КАК П00018М108001,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108002,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108003,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108004
			|ИЗ
			|	ВТИностранцы КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФИОФизлиц
			|		ПО СведенияОДоходах.ФизическоеЛицо = ФИОФизлиц.ФизическоеЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	ФИОФизлиц.Наименование,
			|	ФИОФизлиц.Фамилия,
			|	ФИОФизлиц.Имя,
			|	ФИОФизлиц.Отчество,
			|	ФИОФизлиц.ИНН,
			|	ФИОФизлиц.СтраховойНомерПФР,
			|	ФИОФизлиц.Страна.Код
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИО";

			ОписаниеТаблиц.Иностранцы = Запрос.Выполнить().Выгрузить()
		
		КонецЕсли;
		
	КонецЕсли;
	
	// Раздел 3
	Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		
		Если ОписаниеТаблиц.Свойство("НомерКорректировки") И ЗначениеЗаполнено(ОписаниеТаблиц.НомерКорректировки) Тогда
			ПолучитьПереданныеДанныеОтчета2020(Организация, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц, ОписаниеТаблиц.НомерКорректировки);
		Иначе
			СоздатьПустыеВТПереданныхДанныхОтчета2020(Запрос.МенеджерВременныхТаблиц)
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОтчетныйГод", Год(ОкончаниеПериода));
		ПерсонифицированныйУчет.СформироватьВТСоответствиеТарифаИВидаЗЛКатегории(Запрос.МенеджерВременныхТаблиц, Год(ОкончаниеПериода));
		
		// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Физлица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Физлица.ФизическоеЛицо.Код КАК Код,
		|	ЕСТЬNULL(ФИОФизлиц.Наименование, """") КАК ФИО,
		|	ЕСТЬNULL(ФИОФизлиц.ИНН, """") КАК П000310002001,
		|	ЕСТЬNULL(ФИОФизлиц.СтраховойНомерПФР, """") КАК П000310003001,
		|	ЕСТЬNULL(ФИОФизлиц.Фамилия, """") КАК П000310004001,
		|	ЕСТЬNULL(ФИОФизлиц.Имя, """") КАК П000310005001,
		|	ЕСТЬNULL(ФИОФизлиц.Отчество, """") КАК П000310006001,
		|	ЕСТЬNULL(ФИОФизлиц.ДатаРождения, """") КАК П000310007001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ФИОФизлиц.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА ФИОФизлиц.ДокументСтранаВыдачи = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|							ТОГДА ""643""
		|						ИНАЧЕ ФИОФизлиц.ДокументСтранаВыдачи.Код
		|					КОНЕЦ
		|			ИНАЧЕ ФИОФизлиц.Страна.Код
		|		КОНЕЦ, """") КАК П000310008001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ФИОФизлиц.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|				ТОГДА ""1""
		|			ИНАЧЕ ""2""
		|		КОНЕЦ, """") КАК П000310009001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ФИОФизлиц.ДокументВид.КодМВД = ""18""
		|				ТОГДА ""19""
		|			ИНАЧЕ ФИОФизлиц.ДокументВид.КодМВД
		|		КОНЕЦ, """") КАК П000310010001,
		|	ЕСТЬNULL(ФИОФизлиц.ДокументСерия, """") КАК П000310011001,
		|	ЕСТЬNULL(ФИОФизлиц.ДокументНомер, """") КАК П000310011002
		|ПОМЕСТИТЬ ВТФизлицаПоТекущимДанным
		|ИЗ
		|	ВТФизлица КАК Физлица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФИОФизлиц
		|		ПО Физлица.ФизическоеЛицо = ФИОФизлиц.ФизическоеЛицо
		|ГДЕ
		|	Физлица.ВключатьВРаздел3
		|	И Физлица.ЗастрахованПФР
		|	И Физлица.НачалоКвартала МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)) КАК П00321М112001,
		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц КАК П00321М113001,
		|	СУММА(СведенияОДоходах.НачисленоВсего) КАК П00321М114001,
		|	СУММА(СведенияОДоходах.СуммаНеПревысившаяПределПФР) КАК П00321М115001,
		|	СУММА(СведенияОДоходах.СуммаНеПревысившаяПределПФРпоГПХ) КАК П00321М116001,
		|	СУММА(СведенияОДоходах.ПФРПоСуммарномуТарифу) КАК П00321М117001
		|ПОМЕСТИТЬ ВТДоходыВзносовПоТекущимДанным
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаИВидаЗЛКатегории КАК СоответствиеТарифаИВидаЗЛКатегории
		|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = СоответствиеТарифаИВидаЗЛКатегории.ВидТарифаСтраховыхВзносов
		|			И СведенияОДоходах.ВидЗастрахованногоЛица = СоответствиеТарифаИВидаЗЛКатегории.ВидЗастрахованногоЛица
		|			И (&ОтчетныйГод МЕЖДУ СоответствиеТарифаИВидаЗЛКатегории.ГодС И СоответствиеТарифаИВидаЗЛКатегории.ГодПо)
		|ГДЕ
		|	СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3))
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсего) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Данные.П00322М118001 КАК П00322М118001,
		|	Данные.П00322М119001 КАК П00322М119001,
		|	СУММА(Данные.П00322М120001) КАК П00322М120001,
		|	СУММА(Данные.П00322М121001) КАК П00322М121001
		|ПОМЕСТИТЬ ВТДоходыВредныхВзносовПоТекущимДанным
		|ИЗ
		|	(ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)) КАК П00322М118001,
		|		""110"" КАК П00322М119001,
		|		СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК П00322М120001,
		|		СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК П00322М121001
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|		И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И СведенияОДоходах.ЗастрахованПФР
		|		И СведенияОДоходах.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		СведенияОДоходах.ФизическоеЛицо
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) <> 0
		|			ИЛИ СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		""120"",
		|		СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы),
		|		СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|		И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И СведенияОДоходах.ЗастрахованПФР
		|		И СведенияОДоходах.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		СведенияОДоходах.ФизическоеЛицо
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) <> 0
		|			ИЛИ СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА СведенияОДоходах.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		СУММА(СведенияОДоходах.ОблагаемаяБаза),
		|		0
		|	ИЗ
		|		ВТДоходыПоКлассамУсловий КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА СведенияОДоходах.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СведенияОДоходах.ОблагаемаяБаза) <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(ВзносыПоКлассамУсловий.Период, МЕСЯЦ, -КВАРТАЛ(ВзносыПоКлассамУсловий.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА ВзносыПоКлассамУсловий.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		0,
		|		ВзносыПоКлассамУсловий.Взносы
		|	ИЗ
		|		ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|	ГДЕ
		|		ВзносыПоКлассамУсловий.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И ВзносыПоКлассамУсловий.Взносы <> 0) КАК Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.ФизическоеЛицо,
		|	Данные.П00322М118001,
		|	Данные.П00322М119001
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВзносовПоТекущимДанным.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизлицаВОтчет
		|ИЗ
		|	ВТДоходыВзносовПоТекущимДанным КАК ДоходыВзносовПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПереданные КАК ДоходыВзносовПереданные
		|		ПО ДоходыВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВзносовПереданные.ФизическоеЛицо
		|			И ДоходыВзносовПоТекущимДанным.П00321М112001 = ДоходыВзносовПереданные.П00321М112001
		|			И ДоходыВзносовПоТекущимДанным.П00321М113001 = ДоходыВзносовПереданные.П00321М113001
		|			И ДоходыВзносовПоТекущимДанным.П00321М114001 = ДоходыВзносовПереданные.П00321М114001
		|			И ДоходыВзносовПоТекущимДанным.П00321М115001 = ДоходыВзносовПереданные.П00321М115001
		|			И ДоходыВзносовПоТекущимДанным.П00321М116001 = ДоходыВзносовПереданные.П00321М116001
		|			И ДоходыВзносовПоТекущимДанным.П00321М117001 = ДоходыВзносовПереданные.П00321М117001
		|ГДЕ
		|	ДоходыВзносовПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВзносовПереданные.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносовПереданные КАК ДоходыВзносовПереданные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПоТекущимДанным КАК ДоходыВзносовПоТекущимДанным
		|		ПО ДоходыВзносовПереданные.ФизическоеЛицо = ДоходыВзносовПоТекущимДанным.ФизическоеЛицо
		|			И ДоходыВзносовПереданные.П00321М112001 = ДоходыВзносовПоТекущимДанным.П00321М112001
		|			И ДоходыВзносовПереданные.П00321М113001 = ДоходыВзносовПоТекущимДанным.П00321М113001
		|			И ДоходыВзносовПереданные.П00321М114001 = ДоходыВзносовПоТекущимДанным.П00321М114001
		|			И ДоходыВзносовПереданные.П00321М115001 = ДоходыВзносовПоТекущимДанным.П00321М115001
		|			И ДоходыВзносовПереданные.П00321М116001 = ДоходыВзносовПоТекущимДанным.П00321М116001
		|			И ДоходыВзносовПереданные.П00321М117001 = ДоходыВзносовПоТекущимДанным.П00321М117001
		|ГДЕ
		|	ДоходыВзносовПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВредныхВзносовПоТекущимДанным КАК ДоходыВредныхВзносовПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВредныхВзносовПереданные КАК ДоходыВредныхВзносовПереданные
		|		ПО ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВредныхВзносовПереданные.ФизическоеЛицо
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М118001 = ДоходыВредныхВзносовПереданные.П00322М118001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М119001 = ДоходыВредныхВзносовПереданные.П00322М119001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М120001 = ДоходыВредныхВзносовПереданные.П00322М120001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М121001 = ДоходыВредныхВзносовПереданные.П00322М121001
		|ГДЕ
		|	ДоходыВредныхВзносовПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВредныхВзносовПереданные.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВредныхВзносовПереданные КАК ДоходыВредныхВзносовПереданные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВредныхВзносовПоТекущимДанным КАК ДоходыВредныхВзносовПоТекущимДанным
		|		ПО (ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВредныхВзносовПереданные.ФизическоеЛицо)
		|			И ДоходыВредныхВзносовПереданные.П00322М118001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М118001
		|			И ДоходыВредныхВзносовПереданные.П00322М119001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М119001
		|			И ДоходыВредныхВзносовПереданные.П00322М120001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М120001
		|			И ДоходыВредныхВзносовПереданные.П00322М121001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М121001
		|ГДЕ
		|	ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизлицаПоТекущимДанным.ФизическоеЛицо
		|ИЗ
		|	ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизлицаПереданные
		|		ПО ФизлицаПоТекущимДанным.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
		|			И ФизлицаПоТекущимДанным.П000310002001 = ФизлицаПереданные.П000310002001
		|			И ФизлицаПоТекущимДанным.П000310003001 = ФизлицаПереданные.П000310003001
		|			И ФизлицаПоТекущимДанным.П000310004001 = ФизлицаПереданные.П000310004001
		|			И ФизлицаПоТекущимДанным.П000310005001 = ФизлицаПереданные.П000310005001
		|			И ФизлицаПоТекущимДанным.П000310006001 = ФизлицаПереданные.П000310006001
		|			И ФизлицаПоТекущимДанным.П000310007001 = ФизлицаПереданные.П000310007001
		|			И ФизлицаПоТекущимДанным.П000310008001 = ФизлицаПереданные.П000310008001
		|			И ФизлицаПоТекущимДанным.П000310009001 = ФизлицаПереданные.П000310009001
		|			И ФизлицаПоТекущимДанным.П000310010001 = ФизлицаПереданные.П000310010001
		|			И ФизлицаПоТекущимДанным.П000310011001 = ФизлицаПереданные.П000310011001
		|			И ФизлицаПоТекущимДанным.П000310011002 = ФизлицаПереданные.П000310011002
		|ГДЕ
		|	ФизлицаПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
		Запрос.Выполнить(); 
		// АПК:96-вкл
		
		Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо КАК ФизическоеЛицо,
			|	МИНИМУМ(ПроверкаСНИЛС.ФизическоеЛицо) КАК ДругоеФизическоеЛицо,
			|	ФизлицаПоТекущимДанным.ФИО КАК ФИО,
			|	ФизлицаПоТекущимДанным.Код КАК Код,
			|	ФизлицаПоТекущимДанным.П000310002001 КАК П000310002001,
			|	ФизлицаПоТекущимДанным.П000310003001 КАК П000310003001,
			|	ФизлицаПоТекущимДанным.П000310004001 КАК П000310004001,
			|	ФизлицаПоТекущимДанным.П000310005001 КАК П000310005001,
			|	ФизлицаПоТекущимДанным.П000310006001 КАК П000310006001,
			|	ФизлицаПоТекущимДанным.П000310007001 КАК П000310007001,
			|	ФизлицаПоТекущимДанным.П000310008001 КАК П000310008001,
			|	ФизлицаПоТекущимДанным.П000310009001 КАК П000310009001,
			|	ФизлицаПоТекущимДанным.П000310010001 КАК П000310010001,
			|	ФизлицаПоТекущимДанным.П000310011001 КАК П000310011001,
			|	ФизлицаПоТекущимДанным.П000310011002 КАК П000310011002,
			|	МИНИМУМ(ПроверкаСНИЛС.ФизическоеЛицо) ЕСТЬ НЕ NULL  КАК ЕстьОшибкаСНИЛС
			|ПОМЕСТИТЬ ВТДанныеСПовторнымиФизическимиЛицами
			|ИЗ
			|	ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО ФизлицаПоТекущимДанным.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ПроверкаСНИЛС
			|		ПО ФизлицаПоТекущимДанным.П000310003001 = ПроверкаСНИЛС.П000310003001
			|			И ФизлицаПоТекущимДанным.Код < ПроверкаСНИЛС.Код
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо,
			|	ФизлицаПоТекущимДанным.ФИО,
			|	ФизлицаПоТекущимДанным.Код,
			|	ФизлицаПоТекущимДанным.П000310002001,
			|	ФизлицаПоТекущимДанным.П000310003001,
			|	ФизлицаПоТекущимДанным.П000310004001,
			|	ФизлицаПоТекущимДанным.П000310005001,
			|	ФизлицаПоТекущимДанным.П000310006001,
			|	ФизлицаПоТекущимДанным.П000310007001,
			|	ФизлицаПоТекущимДанным.П000310008001,
			|	ФизлицаПоТекущимДанным.П000310009001,
			|	ФизлицаПоТекущимДанным.П000310010001,
			|	ФизлицаПоТекущимДанным.П000310011001,
			|	ФизлицаПоТекущимДанным.П000310011002
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеСПовторнымиФизическимиЛицами.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеСПовторнымиФизическимиЛицами.ДругоеФизическоеЛицо КАК ДругоеФизическоеЛицо,
			|	ДанныеСПовторнымиФизическимиЛицами.ФИО КАК ФИО,
			|	ДанныеСПовторнымиФизическимиЛицами.Код КАК Код,
			|	"""" КАК П000030001001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310002001 КАК П000310002001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310003001 КАК П000310003001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310004001 КАК П000310004001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310005001 КАК П000310005001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310006001 КАК П000310006001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310007001 КАК П000310007001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310008001 КАК П000310008001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310009001 КАК П000310009001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310010001 КАК П000310010001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310011001 КАК П000310011001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310011002 КАК П000310011002,
			|	ДанныеСПовторнымиФизическимиЛицами.ЕстьОшибкаСНИЛС КАК ЕстьОшибкаСНИЛС,
			|	ФизлицаПоТекущимДанным.ФИО КАК ФИОДругогоФизическогоЛица,
			|	ФизлицаПоТекущимДанным.Код КАК КодДругогоФизическогоЛица
			|ИЗ
			|	ВТДанныеСПовторнымиФизическимиЛицами КАК ДанныеСПовторнымиФизическимиЛицами
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ПО ДанныеСПовторнымиФизическимиЛицами.ДругоеФизическоеЛицо = ФизлицаПоТекущимДанным.ФизическоеЛицо
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	ДанныеСПовторнымиФизическимиЛицами.ФИО,
			|	"""",
			|	""1"",
			|	ФизлицаПереданные.П000310002001,
			|	ФизлицаПереданные.П000310003001,
			|	ФизлицаПереданные.П000310004001,
			|	ФизлицаПереданные.П000310005001,
			|	ФизлицаПереданные.П000310006001,
			|	ФизлицаПереданные.П000310007001,
			|	ФизлицаПереданные.П000310008001,
			|	ФизлицаПереданные.П000310009001,
			|	ФизлицаПереданные.П000310010001,
			|	ФизлицаПереданные.П000310011001,
			|	ФизлицаПереданные.П000310011002,
			|	ЛОЖЬ,
			|	"""",
			|	""""
			|ИЗ
			|	ВТДанныеСПовторнымиФизическимиЛицами КАК ДанныеСПовторнымиФизическимиЛицами
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизлицаПереданные
			|		ПО ДанныеСПовторнымиФизическимиЛицами.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310003001 <> ФизлицаПереданные.П000310003001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310004001 <> ФизлицаПереданные.П000310004001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310005001 <> ФизлицаПереданные.П000310005001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310006001 <> ФизлицаПереданные.П000310006001
			|ГДЕ
			|	ФизлицаПереданные.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	ФизлицаПереданные.П000310008001 + "" "" + ФизлицаПереданные.П000310009001 + "" "" + ФизлицаПереданные.П000310010001,
			|	"""",
			|	""1"",
			|	ФизлицаПереданные.П000310002001,
			|	ФизлицаПереданные.П000310003001,
			|	ФизлицаПереданные.П000310004001,
			|	ФизлицаПереданные.П000310005001,
			|	ФизлицаПереданные.П000310006001,
			|	ФизлицаПереданные.П000310007001,
			|	ФизлицаПереданные.П000310008001,
			|	ФизлицаПереданные.П000310009001,
			|	ФизлицаПереданные.П000310010001,
			|	ФизлицаПереданные.П000310011001,
			|	ФизлицаПереданные.П000310011002,
			|	ЛОЖЬ,
			|	"""",
			|	""""
			|ИЗ
			|	ВТФизлицаПереданные КАК ФизлицаПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ПО ФизлицаПереданные.П000310003001 = ФизлицаПоТекущимДанным.П000310003001
			|			И ФизлицаПереданные.П000310004001 = ФизлицаПоТекущимДанным.П000310004001
			|			И ФизлицаПереданные.П000310005001 = ФизлицаПоТекущимДанным.П000310005001
			|			И ФизлицаПереданные.П000310006001 = ФизлицаПоТекущимДанным.П000310006001
			|ГДЕ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИО,
			|	П000030001001 УБЫВ";
			ОписаниеТаблиц.Подраздел3Физлица2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;

		Если ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.П00321М112001,
			|	СведенияОДоходах.П00321М113001,
			|	СведенияОДоходах.П00321М114001,
			|	СведенияОДоходах.П00321М115001,
			|	СведенияОДоходах.П00321М116001,
			|	СведенияОДоходах.П00321М117001
			|ИЗ
			|	ВТДоходыВзносовПоТекущимДанным КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО СведенияОДоходах.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.П00321М112001,
			|	СведенияОДоходах.П00321М113001";
			ОписаниеТаблиц.Подраздел321Доходы2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;

		Если ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Данные.ФизическоеЛицо,
			|	Данные.П00322М118001,
			|	Данные.П00322М119001,
			|	Данные.П00322М120001,
			|	Данные.П00322М121001
			|ИЗ
			|	ВТДоходыВредныхВзносовПоТекущимДанным КАК Данные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО Данные.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	Данные.ФизическоеЛицо,
			|	Данные.П00322М118001,
			|	Данные.П00322М119001";
			ОписаниеТаблиц.Подраздел322Доходы2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура РасчетПоказателей_РСВ_2020(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, ДатаАктуальности, МассивФизическихЛиц)
	
	Если НачалоПериода >= '20210101' Тогда
		РасчетПоказателей_РСВ_2021(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, ДатаАктуальности, МассивФизическихЛиц);
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если МассивФизическихЛиц <> Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		СоздатьВТФизЛицаОрганизаций(МенеджерВременныхТаблиц, МассивФизическихЛиц, ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Иначе
		МенеджерВременныхТаблиц = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоГода(ОкончаниеПериода));
	Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Месяц1", Месяц(ОкончаниеПериода) - 2);
	Запрос.УстановитьПараметр("Месяц2", Месяц(ОкончаниеПериода) - 1);
	Запрос.УстановитьПараметр("Месяц3", Месяц(ОкончаниеПериода));
	// Все данные отчета берутся по обособленному подразделению (указанной организации).
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДоходыНестрахуемыеФСС", УчетСтраховыхВзносов.ДоходыНестрахуемыеФСС());
	Запрос.УстановитьПараметр("НестрахуемыеПоОПСДоходыСтудентов", УчетСтраховыхВзносов.НестрахуемыеПоОПСДоходыСтудентов());
	
	// Получаем временные таблицы, используя общие алгоритмы.
	Запрос.МенеджерВременныхТаблиц = УчетСтраховыхВзносов.СформироватьВТРасширенныеСведенияОДоходахИВзносах(НачалоПериода, ОкончаниеПериода, Организация, МенеджерВременныхТаблиц, Истина, Истина, Истина, Истина, Истина, , , , ДатаАктуальности);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизическоеЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.Сумма - СведенияОДоходах.Скидка
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФСС КАК ЗастрахованФСС,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
	|	СтраховыеВзносыСведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС
	|ПОМЕСТИТЬ ВТФизЛицаСОблагаемойБазой
	|ИЗ
	|	ВТРасширенныеСведенияОДоходахИВзносах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Организация = &ОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизическоеЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|	И СтраховыеВзносыСведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
	|	И СтраховыеВзносыСведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
	|	И (СтраховыеВзносыСведенияОДоходах.ФСС <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ФФОМС <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ПФРССуммПревышения <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.Скидка <> 0
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.Сумма <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Месяц1 КАК МесяцПериода
	|ПОМЕСТИТЬ ВТМесяцыОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Месяц2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Месяц3";
	Запрос.Выполнить();
	
	// Подразделы 1 и 2 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		СтруктураПараметров = КадровыйУчет.ПараметрыПолученияВсехСотрудниковОрганизацийПоСпискуФизическихЛиц();
		СтруктураПараметров.КадровыеДанные = "ЯвляетсяПрокурором, ЯвляетсяВоеннослужащим, РаботаетВСтуденческомОтряде, ДатаПриема, ДатаУвольнения";
		СтруктураПараметров.Организация = Организация;
		СтруктураПараметров.НачалоПериода = НачалоПериода;
		СтруктураПараметров.ОкончаниеПериода = ОкончаниеПериода;
		СтруктураПараметров.СписокФизическихЛиц = МассивФизическихЛиц;
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Ложь, СтруктураПараметров, "ВТСотрудники");
		
		// Формируем список месяцев, в разрезе которых собираем данные.
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, НачалоГода(ОкончаниеПериода), НачалоМесяца(ОкончаниеПериода));
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТВоеннослужащие
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ФизЛица
		|		ПО (ФизЛица.ДатаПриема <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.ДатаУвольнения >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ЯвляетсяВоеннослужащим
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПрокуроры
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ФизЛица
		|		ПО (ФизЛица.ДатаПриема <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.ДатаУвольнения >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ЯвляетсяПрокурором
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&НачалоОтчетногоПериода КАК НачалоПериода,
		|	&КонецОтчетногоПериода КАК ОкончаниеПериода,
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	ВТСотрудники КАК ФизЛица
		|ГДЕ
		|	НЕ ФизЛица.ЯвляетсяВоеннослужащим
		|	И НЕ ФизЛица.РаботаетВСтуденческомОтряде
		|
		|СГРУППИРОВАТЬ ПО
		|	ФизЛица.ФизическоеЛицо";
		ФизЛицаОрганизаций = Запрос.Выполнить().Выгрузить();
		
		Запрос.УстановитьПараметр("ТаблицаДоговоров", КадровыйУчет.ДоговорыФизическихЛиц(ФизЛицаОрганизаций)); ФизЛицаОрганизаций = Неопределено; 
		Запрос.УстановитьПараметр("ДоходыНестрахуемыеПоОПС", УчетСтраховыхВзносов.ДоходыНестрахуемыеПоОПС());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДоговоров.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаДоговоров.ВидДоговора КАК ВидДоговора,
		|	ТаблицаДоговоров.Окончание КАК Окончание,
		|	ТаблицаДоговоров.Начало КАК Начало
		|ПОМЕСТИТЬ ВТДоговоры
		|ИЗ
		|	&ТаблицаДоговоров КАК ТаблицаДоговоров
		|ГДЕ
		|	ТаблицаДоговоров.Организация = &ОбособленноеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Периоды.Период КАК Период,
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НЕ МИНИМУМ(ФизЛица.ВидДоговора) КАК ЕстьТрудовойДоговор
		|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ФизЛица
		|		ПО (ФизЛица.Начало <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
		|			И (ФизЛица.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ФизЛица.Окончание >= Периоды.Период)
		|ГДЕ
		|	ФизЛица.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ФизЛица.ФизическоеЛицо,
		|	Периоды.Период";
		Запрос.Выполнить();
		
		УчетСтраховыхВзносов.СформироватьВТДанныеОПравахНаСтрахование(Запрос.МенеджерВременныхТаблиц, "ВТПериодыФизЛицОрганизаций", Ложь, ДатаАктуальности);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизЛица.Период КАК Период,
		|	ФизЛица.ЕстьТрудовойДоговор КАК ЕстьТрудовойДоговор,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	ДанныеОПравахНаСтрахование.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	ДанныеОПравахНаСтрахование.ЗастрахованФСС
		|		ИЛИ ДанныеОПравахНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФСС
		|ПОМЕСТИТЬ ВТЗастрахованныеЛицаБезТарифов
		|ИЗ
		|	ВТПериодыФизЛицОрганизаций КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравахНаСтрахование КАК ДанныеОПравахНаСтрахование
		|		ПО ФизЛица.ФизическоеЛицо = ДанныеОПравахНаСтрахование.ФизическоеЛицо
		|			И ФизЛица.Период = ДанныеОПравахНаСтрахование.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизическоеЛицо,
		|	ФизЛица.Период,
		|	ЛОЖЬ,
		|	ФизЛица.ЗастрахованФССкакИностранец,
		|	ФизЛица.ЗастрахованПФР,
		|	ФизЛица.ЗастрахованФОМС,
		|	ФизЛица.ЗастрахованФСС
		|		ИЛИ ФизЛица.ЗастрахованФССкакИностранец
		|ИЗ
		|	ВТФизЛицаСОблагаемойБазой КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыФизЛицОрганизаций КАК ФизЛицаСДоговорами
		|		ПО ФизЛица.ФизическоеЛицо = ФизЛицаСДоговорами.ФизическоеЛицо
		|			И ФизЛица.Период = ФизЛицаСДоговорами.Период
		|ГДЕ
		|	ФизЛица.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ФизЛицаСДоговорами.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.Сумма) КАК ОбщаяСумма,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенежноеДовольствиеВоеннослужащих,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходыСтудентов,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеПоОПС)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НестрахуемыеДоходы,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеФСС)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НестрахуемыеФССДоходы
		|ПОМЕСТИТЬ ВТНестрахуемыеДоходы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ЕСТЬNULL(СведенияОДоходах.ВидТарифаСтраховыхВзносов, ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗастрахованныеЛицаБезТарифов.Период КАК Период,
		|	(НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0)
		|			И Прокуроры.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) <> ЕСТЬNULL(НестрахуемыеДоходыФизлиц.НестрахуемыеДоходы, 0) КАК ВключатьВРаздел3,
		|	(НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0)
		|			И Прокуроры.ФизическоеЛицо ЕСТЬ NULL
		|		ИЛИ ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) <> ЕСТЬNULL(НестрахуемыеДоходыФизлиц.НестрахуемыеДоходы, 0) - ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ДоходыСтудентов, 0) КАК ВключатьВРаздел1,
		|	ЗастрахованныеЛицаБезТарифов.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ЗастрахованныеЛицаБезТарифов.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	(ЗастрахованныеЛицаБезТарифов.ЕстьТрудовойДоговор
		|		ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|		И ЗастрахованныеЛицаБезТарифов.ЗастрахованФСС КАК ЗастрахованФСС,
		|	(ЗастрахованныеЛицаБезТарифов.ЕстьТрудовойДоговор
		|		ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|		И ЗастрахованныеЛицаБезТарифов.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец
		|ПОМЕСТИТЬ ВТЗастрахованныеЛицаОрганизации
		|ИЗ
		|	ВТЗастрахованныеЛицаБезТарифов КАК ЗастрахованныеЛицаБезТарифов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНестрахуемыеДоходы КАК НестрахуемыеДоходыФизлиц
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = НестрахуемыеДоходыФизлиц.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = НестрахуемыеДоходыФизлиц.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВоеннослужащие КАК Военнослужащие
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = Военнослужащие.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = Военнослужащие.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрокуроры КАК Прокуроры
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = Прокуроры.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = Прокуроры.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСОблагаемойБазой КАК СведенияОДоходах
		|		ПО ЗастрахованныеЛицаБезТарифов.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
		|			И ЗастрахованныеЛицаБезТарифов.Период = СведенияОДоходах.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
		|		ПО ЗастрахованныеЛицаБезТарифов.Период = ВидыТарифовИзУчетнойПолитики.Период
		|ГДЕ
		|	(ЕСТЬNULL(НестрахуемыеДоходыФизлиц.ОбщаяСумма, 0) = 0
		|				И Военнослужащие.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.ДенежноеДовольствиеВоеннослужащих)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	Период";
		Запрос.Выполнить();
		
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("ВсеТарифы2020") 
		Или ОписаниеТаблиц.Свойство("ДоходыВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("ЧисленностьВРазрезеТарифов2020") 
		Или ОписаниеТаблиц.Свойство("ВзносыВРазрезеТарифов2020") Или ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") 
		Или ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		УчетСтраховыхВзносов.СоздатьВТКодыВидовТарифаСтраховыхВзносов(НачалоПериода, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц, Истина);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	СведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
		|	СведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(КодыВидовТарифаСтраховыхВзносов.КодФНС, """") КАК КодТарифа,
		|	СУММА(СведенияОДоходах.ПФРССуммПревышения) КАК ИсчисленоПФРССуммПревышения,
		|	СУММА(СведенияОДоходах.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
		|	СУММА(СведенияОДоходах.ФФОМС) КАК ФФОМС,
		|	СУММА(СведенияОДоходах.ФСС) КАК ФСС,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПФР - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.ВыплатыУказанныеВПункте1Части3Статьи9 + ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.СуммаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоВсего,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФОМС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НачисленоВсегоФОМС,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФСС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НачисленоВсегоФCС,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПФР - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.ВыплатыУказанныеВПункте1Части3Статьи9 - СведенияОДоходах.РасходыПоАвторскимПФР + ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеПоОПСДоходыСтудентов)
		|				ТОГДА СведенияОДоходах.СуммаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеОблагается,
		|	СУММА(СведенияОДоходах.НеОблагаетсяФОМС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих - СведенияОДоходах.РасходыПоАвторскимФОМС) КАК НеОблагаетсяФОМС,
		|	СУММА(СведенияОДоходах.НеОблагаетсяФСС - СведенияОДоходах.ДенежноеДовольствиеВоеннослужащих) КАК НеОблагаетсяФСС,
		|	СУММА(СведенияОДоходах.РасходыПоАвторскимПФР) КАК РасходыПоАвторскимПФР,
		|	СУММА(СведенияОДоходах.РасходыПоАвторскимФОМС) КАК РасходыПоАвторскимФОМС,
		|	СУММА(СведенияОДоходах.БазаПФР) КАК ОблагаемаяБазаПФР,
		|	СУММА(СведенияОДоходах.БазаФОМС) КАК ОблагаемаяБазаФОМС,
		|	СУММА(СведенияОДоходах.БазаФСС) КАК БазаФСС,
		|	СУММА(СведенияОДоходах.БазаПФР - СведенияОДоходах.СуммаПревысившаяПределПФР) КАК СуммаНеПревысившаяПределПФР,
		|	СУММА(СведенияОДоходах.БазаПФР - СведенияОДоходах.СуммаПревысившаяПределПФР - (СведенияОДоходах.БазаПФРПоТрудовомуДоговору - СведенияОДоходах.СуммаПревысившаяПределПФРПоТрудовомуДоговору)) КАК СуммаНеПревысившаяПределПФРпоГПХ,
		|	СУММА(СведенияОДоходах.СуммаПревысившаяПределПФР) КАК СуммаПревысившаяПределПФР,
		|	СУММА(СведенияОДоходах.СуммаПревысившаяПределФСС) КАК СуммаПревысившаяПределФСС,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТДоходыВзносов
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыВидовТарифаСтраховыхВзносов КАК КодыВидовТарифаСтраховыхВзносов
		|		ПО (ГОД(СведенияОДоходах.Период) = КодыВидовТарифаСтраховыхВзносов.РасчетныйПериод)
		|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = КодыВидовТарифаСтраховыхВзносов.ВидТарифаСтраховыхВзносов
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И (СведенияОДоходах.ЗастрахованПФР
		|			ИЛИ СведенияОДоходах.ЗастрахованФСС
		|			ИЛИ СведенияОДоходах.ЗастрахованФССкакИностранец
		|			ИЛИ СведенияОДоходах.ЗастрахованФОМС)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И (СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|				И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|			ИЛИ СведенияОДоходах.ФФОМС <> 0
		|			ИЛИ СведенияОДоходах.ПФРССуммПревышения <> 0
		|			ИЛИ СведенияОДоходах.ПФРПоСуммарномуТарифу <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.ВидЗастрахованногоЛица,
		|	СведенияОДоходах.ЗастрахованПФР,
		|	СведенияОДоходах.ЗастрахованФОМС,
		|	ЕСТЬNULL(КодыВидовТарифаСтраховыхВзносов.КодФНС, """"),
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	Период";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|ГДЕ
		|	Доходы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)";
		Если Запрос.Выполнить().Пустой() Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизическиеЛица.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	МЕСЯЦ(ФизическиеЛица.Период) КАК Период,
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованПФР
			|				И ФизическиеЛица.ВключатьВРаздел1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоОПС,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованФОМС 
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоОМС,
			|	ВЫБОР
			|		КОГДА ФизическиеЛица.ЗастрахованФСС 
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоФСС
			|ПОМЕСТИТЬ ВТЗастрахованныеПоМесяцам
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК ФизическиеЛица";
			
		Иначе
			
			// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаОПС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованПФР
			|	И Доходы.ВключатьВРаздел1
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаОМС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФОМС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	Доходы.Период КАК Период,
			|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТЗастрахованныеНаФСС
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.ВидТарифаСтраховыхВзносов,
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И НЕ Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим),
			|	Доходы.Период,
			|	Доходы.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеЛицаОрганизации КАК Доходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ВидыТарифовИзУчетнойПолитики
			|		ПО Доходы.Период = ВидыТарифовИзУчетнойПолитики.Период
			|ГДЕ
			|	Доходы.ЗастрахованФСС
			|	И ЕСТЬNULL(ВидыТарифовИзУчетнойПолитики.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
			|	И Доходы.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаОПС.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаОПС.Период КАК Период,
			|	ЗастрахованныеНаОПС.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТФизическиеЛица
			|ИЗ
			|	ВТЗастрахованныеНаОПС КАК ЗастрахованныеНаОПС
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаОМС.ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаОМС.Период,
			|	ЗастрахованныеНаОМС.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеНаОМС КАК ЗастрахованныеНаОМС
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗастрахованныеНаФСС.ВидТарифаСтраховыхВзносов,
			|	ЗастрахованныеНаФСС.Период,
			|	ЗастрахованныеНаФСС.ФизическоеЛицо
			|ИЗ
			|	ВТЗастрахованныеНаФСС КАК ЗастрахованныеНаФСС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизическиеЛица.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
			|	МЕСЯЦ(ФизическиеЛица.Период) КАК Период,
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаОПС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоОПС,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаОМС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоОМС,
			|	ВЫБОР
			|		КОГДА ЗастрахованныеНаФСС.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоФСС
			|ПОМЕСТИТЬ ВТЗастрахованныеПоМесяцам
			|ИЗ
			|	ВТФизическиеЛица КАК ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаОПС КАК ЗастрахованныеНаОПС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаОПС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаОПС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаОПС.ВидТарифаСтраховыхВзносов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаОМС КАК ЗастрахованныеНаОМС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаОМС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаОМС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаОМС.ВидТарифаСтраховыхВзносов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеНаФСС КАК ЗастрахованныеНаФСС
			|		ПО ФизическиеЛица.ФизическоеЛицо = ЗастрахованныеНаФСС.ФизическоеЛицо
			|			И ФизическиеЛица.Период = ЗастрахованныеНаФСС.Период
			|			И ФизическиеЛица.ВидТарифаСтраховыхВзносов = ЗастрахованныеНаФСС.ВидТарифаСтраховыхВзносов
			|";

			// АПК:96-вкл
			
		КонецЕсли;
		
		Запрос.Выполнить();
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеПоМесяцам.Период КАК Период,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗастрахованныеПоМесяцам.КоличествоОПС КАК КоличествоОПС,
		|	ЗастрахованныеПоМесяцам.КоличествоОМС КАК КоличествоОМС,
		|	ЗастрахованныеПоМесяцам.КоличествоФСС КАК КоличествоФСС
		|ПОМЕСТИТЬ ВТКоличествоЗастрахованных
		|ИЗ
		|	ВТЗастрахованныеПоМесяцам КАК ЗастрахованныеПоМесяцам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов,
		|	0,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо,
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоОПС),
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоОМС),
		|	МАКСИМУМ(ЗастрахованныеПоМесяцам.КоличествоФСС)
		|ИЗ
		|	ВТЗастрахованныеПоМесяцам КАК ЗастрахованныеПоМесяцам
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗастрахованныеПоМесяцам.ВидТарифаСтраховыхВзносов,
		|	ЗастрахованныеПоМесяцам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоЗастрахованных.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	КоличествоЗастрахованных.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = 0
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101001,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоОПС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110001004,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоОМС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120001004,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц1
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101002,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц2
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101003,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоЗастрахованных.Период = &Месяц3
		|				ТОГДА КоличествоЗастрахованных.КоличествоФСС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101004
		|ИЗ
		|	ВТКоличествоЗастрахованных КАК КоличествоЗастрахованных
		|
		|СГРУППИРОВАТЬ ПО
		|	КоличествоЗастрахованных.ВидТарифаСтраховыхВзносов,
		|	КоличествоЗастрахованных.ФизическоеЛицо";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "КоличествоЗастрахованных");
		ОписаниеТаблиц.ЧисленностьЗастрахованныхВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ВсеТарифы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Доходы.КодТарифа,
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.КодТарифа";
		ОписаниеТаблиц.ВсеТарифы2020 = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ДоходыВРазрезеТарифов2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110003004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110004504,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005101,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005102,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005103,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|						И СведенияОДоходах.ЗастрахованПФР
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределПФР
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110005104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.НачисленоВсегоФОМС
		|			КОНЕЦ), 0) КАК П011120003001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120003004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.НеОблагаетсяФОМС
		|			КОНЕЦ), 0) КАК П011120004001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				ИНАЧЕ СведенияОДоходах.РасходыПоАвторскимФОМС
		|			КОНЕЦ), 0) КАК П011120004501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ СведенияОДоходах.ЗастрахованФОМС
		|					ТОГДА 0
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.РасходыПоАвторскимФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120004504,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|ГДЕ
		|	(СведенияОДоходах.ЗастрахованПФР
		|			ИЛИ СведенияОДоходах.ЗастрахованФОМС)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(0) = 0", "
			|	(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц1
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц2
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) <> &Месяц3
			|					ТОГДА 0
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0 
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0)");
		Иначе 	
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Начисление");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(0) = 0", "
			|		СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованПФР
			|					ТОГДА СведенияОДоходах.НачисленоВсего
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0 
			|		ИЛИ СУММА(ВЫБОР
			|				КОГДА СведенияОДоходах.ЗастрахованФОМС
			|					ТОГДА СведенияОДоходах.НачисленоВсегоФОМС
			|				ИНАЧЕ 0
			|			КОНЕЦ) <> 0");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.ДоходыВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ЧисленностьВРазрезеТарифов2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазы
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.СуммаПревысившаяПределПФР) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицаСПревышениемБазы.Период,
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
		|	ЛицаСПревышениемБазы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносами
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.ОблагаемаяБазаПФР) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМС
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.ОблагаемаяБазаФОМС) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФСС
		|ИЗ
		|	ВТДоходыВзносов КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(Доходы.БазаФСС - Доходы.СуммаПревысившаяПределФСС) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносами КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносами КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФОМС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФОМС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФССЗаОтдельныеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФСС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Период,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизическоеЛицо) КАК ВсегоФизлиц,
		|	Доходы.ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТЛицаСВзносамиФССЗаВсеМесяцы
		|ИЗ
		|	ВТЛицаСВзносамиФСС КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тарифы.ВидТарифаСтраховыхВзносов,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011110002001,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСПревышениемБазыЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011110002101,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФОМСЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П011120002001,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФССЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П00012М101501,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002004,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011120002004,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101502,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101503,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00012М101504,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002102,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002103,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П011110002104
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
		|	ИЗ
		|		ВТДоходыВзносов КАК Доходы) КАК Тарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМесяцыОтчета КАК МесяцыОтчета
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаВсеМесяцы КАК ЛицаСВзносамиЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаОтдельныеМесяцы КАК ЛицаСВзносамиЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаВсеМесяцы КАК ЛицаСВзносамиФОМСЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы КАК ЛицаСВзносамиФОМСЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФССЗаВсеМесяцы КАК ЛицаСВзносамиФССЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФССЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФССЗаОтдельныеМесяцы КАК ЛицаСВзносамиФССЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФССЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВзносамиФССЗаОтдельныеМесяцы.Период))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаВсеМесяцы КАК ЛицаСПревышениемБазыЗаВсеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы КАК ЛицаСПревышениемБазыЗаОтдельныеМесяцы
		|		ПО Тарифы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
		|			И (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период))
		|
		|СГРУППИРОВАТЬ ПО
		|	Тарифы.ВидТарифаСтраховыхВзносов";
		ОписаниеТаблиц.ЧисленностьВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("ВзносыВРазрезеТарифов2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРПоСуммарномуТарифу), 0) КАК П011110006101,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006102,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006103,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРПоСуммарномуТарифу
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006201,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006202,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006203,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|						И ВзносыФизлиц.ЗастрахованПФР
		|					ТОГДА ВзносыФизлиц.ИсчисленоПФРССуммПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011110006204,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ФФОМС), 0) КАК П011120006001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ФФОМС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П011120006004,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ФСС), 0) КАК П00012М106001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М106004,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КодТарифа КАК КодТарифа,
		|	ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносов КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ФизическоеЛицо,
		|	ВзносыФизлиц.КодТарифа,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВзносыФизлиц.ФФОМС) <> 0
		|		ИЛИ СУММА(ВзносыФизлиц.ПФРПоСуммарномуТарифу) <> 0
		|		ИЛИ СУММА(ВзносыФизлиц.ФСС) <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов";
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		ОписаниеТаблиц.ВзносыВРазрезеТарифов2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Подраздел 3.1 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Подраздел31Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботы) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботы) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботы) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботы) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК ОблагаемаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) КАК ОблагаемаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТДоходыВредныхВзносов
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВредныхВзносов КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТДоходыВредныхВзносов КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Подраздел31Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел31Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Взносы.Период КАК Период,
		|	Взносы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.ВидТарифаСтраховыхВзносов,
		|	Взносы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	Взносы.Период КАК Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.ВидТарифаСтраховыхВзносов,
		|	Взносы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизическоеЛицо) КАК ВсегоФизлиц
		|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК Взносы
		|ГДЕ
		|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
		|	И Взносы.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И Взносы.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П11131М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11131М101004
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|ГДЕ
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ)
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|ГДЕ
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов";
		ОписаниеТаблиц.Подраздел31Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел31Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК П11131М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П11131М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11131М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0),
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И ВзносыФизлиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Подраздел31Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Подраздел 3.2 Приложения 1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Или ОписаниеТаблиц.Свойство("Подраздел32Доходы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	""1"" КАК Основание,
		|	""1"" КАК КлассУсловийТруда,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыОпасный) КАК НачисленоВсего,
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыОпасный) КАК НеОблагается,
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыОпасный) КАК ОблагаемаяБаза,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТДоходыПоКлассамУсловий
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""1"",
		|	""2"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный4),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный4),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный4),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""1"",
		|	""3"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный3),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный3),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный3),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""1"",
		|	""4"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный2),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный2),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный2),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""1"",
		|	""5"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ПодземныеИВредныеРаботыВредный1),
		|	СУММА(СведенияОДоходах.НеОблагаетсяПодземныеИВредныеРаботыВредный1),
		|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный1),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	""1"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыОпасный),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыОпасный),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыОпасный),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	""2"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный4),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный4),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный4),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	""3"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный3),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный3),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный3),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	""4"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный2),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный2),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный2),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	""2"",
		|	""5"",
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ТяжелыеИПрочиеРаботыВредный1),
		|	СУММА(СведенияОДоходах.НеОблагаетсяТяжелыеИПрочиеРаботыВредный1),
		|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный1),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период";
		Запрос.Выполнить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Или ОписаниеТаблиц.Свойство("Подраздел32Численность2020") Или ОписаниеТаблиц.Свойство("Подраздел32Взносы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов,
		|	Взносы.Основание,
		|	Взносы.КлассУсловийТруда,
		|	Взносы.Период,
		|	СУММА(Взносы.Сумма) КАК Взносы,
		|	Взносы.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТВзносыПоКлассамУсловий
		|ИЗ
		|	(ВЫБРАТЬ
		|		""1"" КАК Основание,
		|		""1"" КАК КлассУсловийТруда,
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период КАК Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК Сумма,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""2"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""3"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""4"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""1"",
		|		""5"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""1"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""2"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""3"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""4"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""2"",
		|		""5"",
		|		ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
		|		ВзносыФизлиц.ФизическоеЛицо
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|		И ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода) КАК Взносы
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Основание,
		|	Взносы.Период,
		|	Взносы.ФизическоеЛицо,
		|	Взносы.КлассУсловийТруда,
		|	Взносы.ВидТарифаСтраховыхВзносов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Взносы.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыФизлиц.Основание,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда
		|ПОМЕСТИТЬ ВТОснованияВзносов
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
		|ГДЕ
		|	ВзносыФизлиц.Взносы > 0";
		Запрос.Выполнить()
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Подраздел32Основания2020") Тогда
		// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	Доходы.Основание КАК П11132М100101,
		|	Доходы.КлассУсловийТруда КАК П11132М100201
		|ИЗ
		|	ВТДоходыПоКлассамУсловий КАК Доходы
		|ГДЕ
		|	Доходы.НачисленоВсего > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Взносы.ВидТарифаСтраховыхВзносов,
		|	Взносы.Основание,
		|	Взносы.КлассУсловийТруда
		|ИЗ
		|	ВТОснованияВзносов КАК Взносы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидТарифаСтраховыхВзносов,
		|	П11132М100101,
		|	П11132М100201";
		// АПК:96-вкл 
		ОписаниеТаблиц.Подраздел32Основания2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Основание КАК П11132М100101,
		|	СведенияОДоходах.КлассУсловийТруда КАК П11132М100201,
		|	СведенияОДоходах.КлассУсловийТруда КАК КодКлассаУсловий,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсего), 0) КАК П11132М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П11132М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТДоходыПоКлассамУсловий КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.КлассУсловийТруда,
		|	СведенияОДоходах.Основание";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Подраздел32Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзносыПоКлассамУсловий.Основание,
		|	ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|	ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыПоКлассамУсловий.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыПоКлассамУсловий.Период
		|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыПоКлассамУсловий.Период,
		|	ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|	ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|	ВзносыПоКлассамУсловий.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзносыЗаВесьПериод.ВидТарифаСтраховыхВзносов,
		|	ВзносыЗаВесьПериод.КлассУсловийТруда,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыПоКлассамУсловий.Основание КАК Основание,
		|		ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|		ВзносыПоКлассамУсловий.КлассУсловийТруда КАК КлассУсловийТруда,
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыПоКлассамУсловий.Взносы) КАК Взносы
		|	ИЗ
		|		ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыПоКлассамУсловий.Основание,
		|		ВзносыПоКлассамУсловий.ВидТарифаСтраховыхВзносов,
		|		ВзносыПоКлассамУсловий.КлассУсловийТруда,
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.ВидТарифаСтраховыхВзносов,
		|	ВзносыЗаВесьПериод.КлассУсловийТруда,
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П11132М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П11132М101004,
		|	ОснованияВзносов.ВидТарифаСтраховыхВзносов,
		|	ОснованияВзносов.КлассУсловийТруда КАК П11132М100201,
		|	ОснованияВзносов.Основание КАК П11132М100101
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносов КАК ОснованияВзносов
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|		ПО (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание)
		|			И (ОснованияВзносов.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов)
		|			И (ОснованияВзносов.КлассУсловийТруда = ЛицаСВреднымиВзносамиЗаВсеМесяцы.КлассУсловийТруда)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
		|			И (ОснованияВзносов.ВидТарифаСтраховыхВзносов = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов)
		|			И (ОснованияВзносов.КлассУсловийТруда = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.КлассУсловийТруда)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОснованияВзносов.ВидТарифаСтраховыхВзносов,
		|	ОснованияВзносов.КлассУсловийТруда,
		|	ОснованияВзносов.Основание";
		ОписаниеТаблиц.Подраздел32Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Подраздел32Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда КАК П11132М100201,
		|	ВзносыФизлиц.КлассУсловийТруда КАК КодКлассаУсловий,
		|	ВзносыФизлиц.Основание КАК П11132М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.Взносы), 0) КАК П11132М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П11132М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо
		|ИЗ
		|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Основание,
		|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
		|	ВзносыФизлиц.КлассУсловийТруда,
		|	ВзносыФизлиц.ПолеФизическоеЛицо";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Подраздел32Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Приложения 1.1 Раздела 1
	
	Если ОписаниеТаблиц.Свойство("Приложение11Доходы2020") Или ОписаниеТаблиц.Свойство("Приложение11Численность2020") Или ОписаниеТаблиц.Свойство("Приложение11Взносы2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	""1"" КАК Основание,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.НеОблагаетсяПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеОблагается,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				ТОГДА СведенияОДоходах.БазаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОблагаемаяБаза,
		|	СУММА(СведенияОДоходах.ПФРНаДоплатуЛетчикам) КАК Взносы,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТДоходыВзносыАвиаторовГорняков
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И (СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			ИЛИ СведенияОДоходах.ПФРНаДоплатуЛетчикам <> 0)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период,
		|	""2"",
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.НеОблагаетсяПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				ТОГДА СведенияОДоходах.БазаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(СведенияОДоходах.ПФРНаДоплатуШахтерам),
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованПФР
		|	И (СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			ИЛИ СведенияОДоходах.ПФРНаДоплатуШахтерам <> 0)
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";
		Запрос.Выполнить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Доходы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Основание КАК П00111М100101,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НачисленоВсего), 0) КАК П00111М102001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НачисленоВсего
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М102004,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П00111М103001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М103004,
		|	СведенияОДоходах.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ПолеФизическоеЛицо,
		|	СведенияОДоходах.Основание";
		МассивПолей = Новый Массив;
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		КонецЕсли;
		ОписаниеТаблиц.Приложение11Доходы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Численность2020") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.Основание КАК Основание,
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыФизлиц.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыФизлиц.Период КАК Период
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаОтдельныеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.Период КАК Период,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.Период,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Период,
		|	ВзносыФизлиц.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыФизлиц.Основание КАК Основание
		|ПОМЕСТИТЬ ВТОснованияВзносовАвиаторовГорняков
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание КАК Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаВсеМесяцы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ВзносыЗаВесьПериод.Взносы > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоФизлиц,
		|	ВзносыЗаВесьПериод.Основание КАК Основание
		|ПОМЕСТИТЬ ВТЛицаСВзносамиАвиаторовГорняковЗаКвартал
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыФизлиц.Основание КАК Основание,
		|		ВзносыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СУММА(ВзносыФизлиц.Взносы) КАК Взносы
		|	ИЗ
		|		ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|	ГДЕ
		|		ВзносыФизлиц.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзносыФизлиц.Основание,
		|		ВзносыФизлиц.ФизическоеЛицо) КАК ВзносыЗаВесьПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыЗаВесьПериод.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П00111М101001,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101002,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101003,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
		|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П00111М101004,
		|	ОснованияВзносов.Основание КАК П00111М100101
		|ИЗ
		|	ВТМесяцыОтчета КАК МесяцыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносовАвиаторовГорняков КАК ОснованияВзносов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
		|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаКвартал КАК ЛицаСВреднымиВзносамиЗаКвартал
		|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаКвартал.Основание
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиАвиаторовГорняковЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
		|		ПО (МесяцыОтчета.МесяцПериода = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
		|			И (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОснованияВзносов.Основание";
		ОписаниеТаблиц.Приложение11Численность2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("Приложение11Взносы2020") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВзносыФизлиц.Основание КАК П00111М100101,
		|	ЕСТЬNULL(СУММА(ВзносыФизлиц.Взносы), 0) КАК П00111М105001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
		|					ТОГДА ВзносыФизлиц.Взносы
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00111М105004,
		|	ВзносыФизлиц.ПолеФизическоеЛицо КАК ПолеФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносыАвиаторовГорняков КАК ВзносыФизлиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзносыФизлиц.Основание,
		|	ВзносыФизлиц.ПолеФизическоеЛицо";
		Если ПодробныеДанные Тогда
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПолеФизическоеЛицо", "ФизическоеЛицо");
		Иначе 
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ПолеФизическоеЛицо");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "ВзносыФизлиц");
		КонецЕсли;
		ОписаниеТаблиц.Приложение11Взносы2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Приложение 2 Раздела 1 
	Если ОписаниеТаблиц.Свойство("ДоходыФСС2020") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.НачисленоВсегоФCС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.НеОблагаетсяФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеОблагается,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|				ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПревысившаяПределФСС,
		|	ВЫБОР
		|		КОГДА ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец
		|			ТОГДА СведенияОДоходах.БазаФСС - СведенияОДоходах.СуммаПревысившаяПределФСС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БазаФССсИностранцев
		|ПОМЕСТИТЬ ВТОблагаемыеБазыПоМесяцам
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗастрахованныеЛицаОрганизации КАК ЗастрахованныеЛицаОрганизации
		|		ПО СведенияОДоходах.ФизическоеЛицо = ЗастрахованныеЛицаОрганизации.ФизическоеЛицо
		|			И СведенияОДоходах.Период = ЗастрахованныеЛицаОрганизации.Период
		|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗастрахованныеЛицаОрганизации.ВидТарифаСтраховыхВзносов
		|ГДЕ
		|	(ЗастрахованныеЛицаОрганизации.ЗастрахованФСС
		|			ИЛИ ЗастрахованныеЛицаОрганизации.ЗастрахованФССкакИностранец)";
		Запрос.Выполнить();
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.Начислено), 0) КАК П00012М102001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагается), 0) КАК П00012М103001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.СуммаПревысившаяПределФСС), 0) КАК П00012М104001,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаФССсИностранцев), 0) КАК П00012М105501,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.Начислено
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М102004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагается
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М103004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.СуммаПревысившаяПределФСС
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М104004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105502,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105503,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаФССсИностранцев
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П00012М105504,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ИЗ
		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";

		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.ДоходыФСС2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	Если ОписаниеТаблиц.Свойство("РасходыФСС2020") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(РасчетыСФСС.РасходыПоСтрахованию), 0) КАК П000120007001,
		|	ЕСТЬNULL(СУММА(РасчетыСФСС.ПолученоИзФонда), 0) КАК П000120008001,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц1
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц2
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц3
		|					ТОГДА РасчетыСФСС.РасходыПоСтрахованию
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120007004,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц1
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008002,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц2
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008003,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(РасчетыСФСС.Период) = &Месяц3
		|					ТОГДА РасчетыСФСС.ПолученоИзФонда
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000120008004
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Период,
		|		Расчеты.Регистратор КАК Регистратор,
		|		ВЫБОР
		|			КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПолученоИзФонда)
		|				ТОГДА Расчеты.Сумма * ВЫБОР
		|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ПолученоИзФонда,
		|		ВЫБОР
		|			КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию)
		|				ТОГДА Расчеты.Сумма * ВЫБОР
		|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК РасходыПоСтрахованию
		|	ИЗ
		|		РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
		|	ГДЕ
		|		Расчеты.ЭтоСтраховыеВзносы
		|		И Расчеты.Организация = &ОбособленноеПодразделение
		|		И Расчеты.ВидОбязательногоСтрахованияСотрудников = (ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС))
		|		И Расчеты.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода) КАК РасчетыСФСС";

		ОписаниеТаблиц.РасходыФСС2020 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Физлица и их кадровые данные
	Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("Иностранцы") Тогда
		
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ) КАК НачалоКвартала,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(СведенияОДоходах.ВключатьВРаздел3) КАК ВключатьВРаздел3,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованПФР) КАК ЗастрахованПФР,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованФСС) КАК ЗастрахованФСС,
		|	МАКСИМУМ(СведенияОДоходах.ЗастрахованФОМС) КАК ЗастрахованФОМС
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	ВТЗастрахованныеЛицаОрганизации КАК СведенияОДоходах
		|ГДЕ
		|	((СведенияОДоходах.ЗастрахованПФР
		|				ИЛИ СведенияОДоходах.ЗастрахованФОМС
		|				ИЛИ СведенияОДоходах.ЗастрахованФСС)
		|				И (СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода)
		|			ИЛИ СведенияОДоходах.ЗастрахованФССкакИностранец)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ДатаАктуальности КАК Период,
		|	Физлица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизлицаКД
		|ИЗ
		|	ВТФизлица КАК Физлица";
		Запрос.Выполнить();
		
		КадровыеДанные = "Фамилия, Имя, Отчество, Наименование, ИНН, СтраховойНомерПФР, ДатаРождения, Пол, Страна, ДокументВид, ДокументСерия, ДокументНомер, ДокументСтранаВыдачи";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц,	"ВТФизлицаКД");
		КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Ложь, КадровыеДанные);
		
	КонецЕсли;
		
	// Приложение 8 Раздела 1
	Если ОписаниеТаблиц.Свойство("Иностранцы") Тогда
		
		Если Не ОписаниеТаблиц.Свойство("ДоходыФСС2020") И Не ОписаниеТаблиц.Свойство("ЧисленностьЗастрахованныхВРазрезеТарифов2020") И Не ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Период КАК Период,
			|	СУММА(СведенияОДоходах.Сумма) КАК ОбщаяСумма,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.ВидДохода В (&ДоходыНестрахуемыеФСС)
			|				ТОГДА СведенияОДоходах.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК НестрахуемыеФССДоходы
			|ПОМЕСТИТЬ ВТНестрахуемыеДоходы
			|ИЗ
			|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
			|ГДЕ
			|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
			|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
			|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
			|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Период
			|";
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	СУММА(СведенияОДоходах.ОбъектОбложенияВзносамиСтатья7ФСС) КАК Начислено
		|ПОМЕСТИТЬ ВТИностранцы
		|ИЗ
		|	ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНестрахуемыеДоходы КАК НестрахуемыеДоходыФизлиц
		|		ПО СведенияОДоходах.ФизическоеЛицо = НестрахуемыеДоходыФизлиц.ФизическоеЛицо
		|			И СведенияОДоходах.Период = НестрахуемыеДоходыФизлиц.Период
		|ГДЕ
		|	СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|	И (НестрахуемыеДоходыФизлиц.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма = 0
		|			ИЛИ НестрахуемыеДоходыФизлиц.ОбщаяСумма <> НестрахуемыеДоходыФизлиц.НестрахуемыеФССДоходы)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|	И СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.ЗастрахованФССкакИностранец
		|	И СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Организации.ФизическоеЛицо
		|			ИЗ
		|				ВТФизЛицаСОблагаемойБазой КАК Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Период";
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат[0].Количество = 0 Тогда
			// колонки таблицы в этом случае не нужны		
			ОписаниеТаблиц.Иностранцы = Новый ТаблицаЗначений
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	ЕСТЬNULL(ФИОФизлиц.Наименование, """") КАК ФИО,
			|	ЕСТЬNULL(ФИОФизлиц.Фамилия, """") КАК П00018М102001,
			|	ЕСТЬNULL(ФИОФизлиц.Имя, """") КАК П00018М103001,
			|	ЕСТЬNULL(ФИОФизлиц.Отчество, """") КАК П00018М104001,
			|	ЕСТЬNULL(ФИОФизлиц.ИНН, """") КАК П00018М105001,
			|	ЕСТЬNULL(ФИОФизлиц.СтраховойНомерПФР, """") КАК П00018М106001,
			|	ЕСТЬNULL(ФИОФизлиц.Страна.Код, ""999"") КАК П00018М107001,
			|	ЕСТЬNULL(СУММА(СведенияОДоходах.Начислено), 0) КАК П00018М108001,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108002,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108003,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
			|					ТОГДА СведенияОДоходах.Начислено
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК П00018М108004
			|ИЗ
			|	ВТИностранцы КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФИОФизлиц
			|		ПО СведенияОДоходах.ФизическоеЛицо = ФИОФизлиц.ФизическоеЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	ФИОФизлиц.Наименование,
			|	ФИОФизлиц.Фамилия,
			|	ФИОФизлиц.Имя,
			|	ФИОФизлиц.Отчество,
			|	ФИОФизлиц.ИНН,
			|	ФИОФизлиц.СтраховойНомерПФР,
			|	ФИОФизлиц.Страна.Код
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИО";

			ОписаниеТаблиц.Иностранцы = Запрос.Выполнить().Выгрузить()
		
		КонецЕсли;
		
	КонецЕсли;
	
	// Раздел 3
	Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Или ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") Или ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
		
		Если ОписаниеТаблиц.Свойство("НомерКорректировки") И ЗначениеЗаполнено(ОписаниеТаблиц.НомерКорректировки) Тогда
			ПолучитьПереданныеДанныеОтчета2020(Организация, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц, ОписаниеТаблиц.НомерКорректировки);
		Иначе
			СоздатьПустыеВТПереданныхДанныхОтчета2020(Запрос.МенеджерВременныхТаблиц)
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОтчетныйГод", Год(ОкончаниеПериода));
		Запрос.УстановитьПараметр("ИспользоватьНовыйКодСвидетельства", Год(ОкончаниеПериода) = 2020 И КонецКвартала(ОкончаниеПериода) = КонецГода(ОкончаниеПериода));
		ПерсонифицированныйУчет.СформироватьВТСоответствиеТарифаИВидаЗЛКатегории(Запрос.МенеджерВременныхТаблиц, Год(ОкончаниеПериода));
		
		// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Физлица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Физлица.ФизическоеЛицо.Код КАК Код,
		|	ЕСТЬNULL(ФИОФизлиц.Наименование, """") КАК ФИО,
		|	ЕСТЬNULL(ФИОФизлиц.ИНН, """") КАК П000310002001,
		|	ЕСТЬNULL(ФИОФизлиц.СтраховойНомерПФР, """") КАК П000310003001,
		|	ЕСТЬNULL(ФИОФизлиц.Фамилия, """") КАК П000310004001,
		|	ЕСТЬNULL(ФИОФизлиц.Имя, """") КАК П000310005001,
		|	ЕСТЬNULL(ФИОФизлиц.Отчество, """") КАК П000310006001,
		|	ЕСТЬNULL(ФИОФизлиц.ДатаРождения, """") КАК П000310007001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ФИОФизлиц.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА ФИОФизлиц.ДокументСтранаВыдачи = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|							ТОГДА ""643""
		|						ИНАЧЕ ФИОФизлиц.ДокументСтранаВыдачи.Код
		|					КОНЕЦ
		|			ИНАЧЕ ФИОФизлиц.Страна.Код
		|		КОНЕЦ, """") КАК П000310008001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ФИОФизлиц.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|				ТОГДА ""1""
		|			ИНАЧЕ ""2""
		|		КОНЕЦ, """") КАК П000310009001,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА &ИспользоватьНовыйКодСвидетельства
		|					И ФИОФизлиц.ДокументВид.КодМВД = ""18""
		|				ТОГДА ""19""
		|			ИНАЧЕ ФИОФизлиц.ДокументВид.КодМВД
		|		КОНЕЦ, """") КАК П000310010001,
		|	ЕСТЬNULL(ФИОФизлиц.ДокументСерия, """") КАК П000310011001,
		|	ЕСТЬNULL(ФИОФизлиц.ДокументНомер, """") КАК П000310011002
		|ПОМЕСТИТЬ ВТФизлицаПоТекущимДанным
		|ИЗ
		|	ВТФизлица КАК Физлица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФИОФизлиц
		|		ПО Физлица.ФизическоеЛицо = ФИОФизлиц.ФизическоеЛицо
		|ГДЕ
		|	Физлица.ВключатьВРаздел3
		|	И Физлица.ЗастрахованПФР
		|	И Физлица.НачалоКвартала МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)) КАК П00321М112001,
		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц КАК П00321М113001,
		|	СУММА(СведенияОДоходах.НачисленоВсего) КАК П00321М114001,
		|	СУММА(СведенияОДоходах.СуммаНеПревысившаяПределПФР) КАК П00321М115001,
		|	СУММА(СведенияОДоходах.СуммаНеПревысившаяПределПФРпоГПХ) КАК П00321М116001,
		|	СУММА(СведенияОДоходах.ПФРПоСуммарномуТарифу) КАК П00321М117001
		|ПОМЕСТИТЬ ВТДоходыВзносовПоТекущимДанным
		|ИЗ
		|	ВТДоходыВзносов КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаИВидаЗЛКатегории КАК СоответствиеТарифаИВидаЗЛКатегории
		|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = СоответствиеТарифаИВидаЗЛКатегории.ВидТарифаСтраховыхВзносов
		|			И СведенияОДоходах.ВидЗастрахованногоЛица = СоответствиеТарифаИВидаЗЛКатегории.ВидЗастрахованногоЛица
		|			И (&ОтчетныйГод МЕЖДУ СоответствиеТарифаИВидаЗЛКатегории.ГодС И СоответствиеТарифаИВидаЗЛКатегории.ГодПо)
		|ГДЕ
		|	СведенияОДоходах.ЗастрахованПФР
		|	И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3))
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.НачисленоВсего) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Данные.П00322М118001 КАК П00322М118001,
		|	Данные.П00322М119001 КАК П00322М119001,
		|	СУММА(Данные.П00322М120001) КАК П00322М120001,
		|	СУММА(Данные.П00322М121001) КАК П00322М121001
		|ПОМЕСТИТЬ ВТДоходыВредныхВзносовПоТекущимДанным
		|ИЗ
		|	(ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)) КАК П00322М118001,
		|		""110"" КАК П00322М119001,
		|		СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК П00322М120001,
		|		СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК П00322М121001
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|		И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И СведенияОДоходах.ЗастрахованПФР
		|		И СведенияОДоходах.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		СведенияОДоходах.ФизическоеЛицо
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) <> 0
		|			ИЛИ СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		""120"",
		|		СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы),
		|		СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
		|	ИЗ
		|		ВТРасширенныеСведенияОДоходахИВзносах КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Организация = &ОбособленноеПодразделение
		|		И СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И СведенияОДоходах.ЗастрахованПФР
		|		И СведенияОДоходах.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					Организации.ФизическоеЛицо
		|				ИЗ
		|					ВТФизЛицаСОблагаемойБазой КАК Организации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		СведенияОДоходах.ФизическоеЛицо
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) <> 0
		|			ИЛИ СУММА(СведенияОДоходах.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА СведенияОДоходах.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		СУММА(СведенияОДоходах.ОблагаемаяБаза),
		|		0
		|	ИЗ
		|		ВТДоходыПоКлассамУсловий КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходах.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(СведенияОДоходах.Период, МЕСЯЦ, -КВАРТАЛ(СведенияОДоходах.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА СведенияОДоходах.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА СведенияОДоходах.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СведенияОДоходах.ОблагаемаяБаза) <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВзносыПоКлассамУсловий.ФизическоеЛицо,
		|		МЕСЯЦ(ДОБАВИТЬКДАТЕ(ВзносыПоКлассамУсловий.Период, МЕСЯЦ, -КВАРТАЛ(ВзносыПоКлассамУсловий.Период) * 3 + 3)),
		|		ВЫБОР
		|			КОГДА ВзносыПоКлассамУсловий.Основание = ""1""
		|				ТОГДА ВЫБОР
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""1""
		|							ТОГДА ""140""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""2""
		|							ТОГДА ""134""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""3""
		|							ТОГДА ""133""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""4""
		|							ТОГДА ""132""
		|						КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""5""
		|							ТОГДА ""131""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""1""
		|				ТОГДА ""240""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""2""
		|				ТОГДА ""234""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""3""
		|				ТОГДА ""233""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""4""
		|				ТОГДА ""232""
		|			КОГДА ВзносыПоКлассамУсловий.КлассУсловийТруда = ""5""
		|				ТОГДА ""231""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		0,
		|		ВзносыПоКлассамУсловий.Взносы
		|	ИЗ
		|		ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
		|	ГДЕ
		|		ВзносыПоКлассамУсловий.Период МЕЖДУ &НачалоОтчетногоКвартала И &КонецОтчетногоПериода
		|		И ВзносыПоКлассамУсловий.Взносы <> 0) КАК Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.ФизическоеЛицо,
		|	Данные.П00322М118001,
		|	Данные.П00322М119001
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВзносовПоТекущимДанным.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизлицаВОтчет
		|ИЗ
		|	ВТДоходыВзносовПоТекущимДанным КАК ДоходыВзносовПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПереданные КАК ДоходыВзносовПереданные
		|		ПО ДоходыВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВзносовПереданные.ФизическоеЛицо
		|			И ДоходыВзносовПоТекущимДанным.П00321М112001 = ДоходыВзносовПереданные.П00321М112001
		|			И ДоходыВзносовПоТекущимДанным.П00321М113001 = ДоходыВзносовПереданные.П00321М113001
		|			И ДоходыВзносовПоТекущимДанным.П00321М114001 = ДоходыВзносовПереданные.П00321М114001
		|			И ДоходыВзносовПоТекущимДанным.П00321М115001 = ДоходыВзносовПереданные.П00321М115001
		|			И ДоходыВзносовПоТекущимДанным.П00321М116001 = ДоходыВзносовПереданные.П00321М116001
		|			И ДоходыВзносовПоТекущимДанным.П00321М117001 = ДоходыВзносовПереданные.П00321М117001
		|ГДЕ
		|	ДоходыВзносовПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВзносовПереданные.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВзносовПереданные КАК ДоходыВзносовПереданные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПоТекущимДанным КАК ДоходыВзносовПоТекущимДанным
		|		ПО ДоходыВзносовПереданные.ФизическоеЛицо = ДоходыВзносовПоТекущимДанным.ФизическоеЛицо
		|			И ДоходыВзносовПереданные.П00321М112001 = ДоходыВзносовПоТекущимДанным.П00321М112001
		|			И ДоходыВзносовПереданные.П00321М113001 = ДоходыВзносовПоТекущимДанным.П00321М113001
		|			И ДоходыВзносовПереданные.П00321М114001 = ДоходыВзносовПоТекущимДанным.П00321М114001
		|			И ДоходыВзносовПереданные.П00321М115001 = ДоходыВзносовПоТекущимДанным.П00321М115001
		|			И ДоходыВзносовПереданные.П00321М116001 = ДоходыВзносовПоТекущимДанным.П00321М116001
		|			И ДоходыВзносовПереданные.П00321М117001 = ДоходыВзносовПоТекущимДанным.П00321М117001
		|ГДЕ
		|	ДоходыВзносовПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВредныхВзносовПоТекущимДанным КАК ДоходыВредныхВзносовПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВредныхВзносовПереданные КАК ДоходыВредныхВзносовПереданные
		|		ПО ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВредныхВзносовПереданные.ФизическоеЛицо
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М118001 = ДоходыВредныхВзносовПереданные.П00322М118001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М119001 = ДоходыВредныхВзносовПереданные.П00322М119001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М120001 = ДоходыВредныхВзносовПереданные.П00322М120001
		|			И ДоходыВредныхВзносовПоТекущимДанным.П00322М121001 = ДоходыВредныхВзносовПереданные.П00322М121001
		|ГДЕ
		|	ДоходыВредныхВзносовПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоходыВредныхВзносовПереданные.ФизическоеЛицо
		|ИЗ
		|	ВТДоходыВредныхВзносовПереданные КАК ДоходыВредныхВзносовПереданные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВредныхВзносовПоТекущимДанным КАК ДоходыВредныхВзносовПоТекущимДанным
		|		ПО (ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо = ДоходыВредныхВзносовПереданные.ФизическоеЛицо)
		|			И ДоходыВредныхВзносовПереданные.П00322М118001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М118001
		|			И ДоходыВредныхВзносовПереданные.П00322М119001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М119001
		|			И ДоходыВредныхВзносовПереданные.П00322М120001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М120001
		|			И ДоходыВредныхВзносовПереданные.П00322М121001 = ДоходыВредныхВзносовПоТекущимДанным.П00322М121001
		|ГДЕ
		|	ДоходыВредныхВзносовПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизлицаПоТекущимДанным.ФизическоеЛицо
		|ИЗ
		|	ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизлицаПереданные
		|		ПО ФизлицаПоТекущимДанным.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
		|			И ФизлицаПоТекущимДанным.П000310002001 = ФизлицаПереданные.П000310002001
		|			И ФизлицаПоТекущимДанным.П000310003001 = ФизлицаПереданные.П000310003001
		|			И ФизлицаПоТекущимДанным.П000310004001 = ФизлицаПереданные.П000310004001
		|			И ФизлицаПоТекущимДанным.П000310005001 = ФизлицаПереданные.П000310005001
		|			И ФизлицаПоТекущимДанным.П000310006001 = ФизлицаПереданные.П000310006001
		|			И ФизлицаПоТекущимДанным.П000310007001 = ФизлицаПереданные.П000310007001
		|			И ФизлицаПоТекущимДанным.П000310008001 = ФизлицаПереданные.П000310008001
		|			И ФизлицаПоТекущимДанным.П000310009001 = ФизлицаПереданные.П000310009001
		|			И ФизлицаПоТекущимДанным.П000310010001 = ФизлицаПереданные.П000310010001
		|			И ФизлицаПоТекущимДанным.П000310011001 = ФизлицаПереданные.П000310011001
		|			И ФизлицаПоТекущимДанным.П000310011002 = ФизлицаПереданные.П000310011002
		|ГДЕ
		|	ФизлицаПереданные.ФизическоеЛицо ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
		Запрос.Выполнить(); 
		// АПК:96-вкл
		
		Если ОписаниеТаблиц.Свойство("Подраздел3Физлица2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо КАК ФизическоеЛицо,
			|	МИНИМУМ(ПроверкаСНИЛС.ФизическоеЛицо) КАК ДругоеФизическоеЛицо,
			|	ФизлицаПоТекущимДанным.ФИО КАК ФИО,
			|	ФизлицаПоТекущимДанным.Код КАК Код,
			|	ФизлицаПоТекущимДанным.П000310002001 КАК П000310002001,
			|	ФизлицаПоТекущимДанным.П000310003001 КАК П000310003001,
			|	ФизлицаПоТекущимДанным.П000310004001 КАК П000310004001,
			|	ФизлицаПоТекущимДанным.П000310005001 КАК П000310005001,
			|	ФизлицаПоТекущимДанным.П000310006001 КАК П000310006001,
			|	ФизлицаПоТекущимДанным.П000310007001 КАК П000310007001,
			|	ФизлицаПоТекущимДанным.П000310008001 КАК П000310008001,
			|	ФизлицаПоТекущимДанным.П000310009001 КАК П000310009001,
			|	ФизлицаПоТекущимДанным.П000310010001 КАК П000310010001,
			|	ФизлицаПоТекущимДанным.П000310011001 КАК П000310011001,
			|	ФизлицаПоТекущимДанным.П000310011002 КАК П000310011002,
			|	МИНИМУМ(ПроверкаСНИЛС.ФизическоеЛицо) ЕСТЬ НЕ NULL  КАК ЕстьОшибкаСНИЛС
			|ПОМЕСТИТЬ ВТДанныеСПовторнымиФизическимиЛицами
			|ИЗ
			|	ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО ФизлицаПоТекущимДанным.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ПроверкаСНИЛС
			|		ПО ФизлицаПоТекущимДанным.П000310003001 = ПроверкаСНИЛС.П000310003001
			|			И ФизлицаПоТекущимДанным.Код < ПроверкаСНИЛС.Код
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо,
			|	ФизлицаПоТекущимДанным.ФИО,
			|	ФизлицаПоТекущимДанным.Код,
			|	ФизлицаПоТекущимДанным.П000310002001,
			|	ФизлицаПоТекущимДанным.П000310003001,
			|	ФизлицаПоТекущимДанным.П000310004001,
			|	ФизлицаПоТекущимДанным.П000310005001,
			|	ФизлицаПоТекущимДанным.П000310006001,
			|	ФизлицаПоТекущимДанным.П000310007001,
			|	ФизлицаПоТекущимДанным.П000310008001,
			|	ФизлицаПоТекущимДанным.П000310009001,
			|	ФизлицаПоТекущимДанным.П000310010001,
			|	ФизлицаПоТекущимДанным.П000310011001,
			|	ФизлицаПоТекущимДанным.П000310011002
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеСПовторнымиФизическимиЛицами.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеСПовторнымиФизическимиЛицами.ДругоеФизическоеЛицо КАК ДругоеФизическоеЛицо,
			|	ДанныеСПовторнымиФизическимиЛицами.ФИО КАК ФИО,
			|	ДанныеСПовторнымиФизическимиЛицами.Код КАК Код,
			|	"""" КАК П000030001001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310002001 КАК П000310002001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310003001 КАК П000310003001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310004001 КАК П000310004001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310005001 КАК П000310005001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310006001 КАК П000310006001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310007001 КАК П000310007001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310008001 КАК П000310008001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310009001 КАК П000310009001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310010001 КАК П000310010001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310011001 КАК П000310011001,
			|	ДанныеСПовторнымиФизическимиЛицами.П000310011002 КАК П000310011002,
			|	ДанныеСПовторнымиФизическимиЛицами.ЕстьОшибкаСНИЛС КАК ЕстьОшибкаСНИЛС,
			|	ФизлицаПоТекущимДанным.ФИО КАК ФИОДругогоФизическогоЛица,
			|	ФизлицаПоТекущимДанным.Код КАК КодДругогоФизическогоЛица
			|ИЗ
			|	ВТДанныеСПовторнымиФизическимиЛицами КАК ДанныеСПовторнымиФизическимиЛицами
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ПО ДанныеСПовторнымиФизическимиЛицами.ДругоеФизическоеЛицо = ФизлицаПоТекущимДанным.ФизическоеЛицо
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	ДанныеСПовторнымиФизическимиЛицами.ФИО,
			|	"""",
			|	""1"",
			|	ФизлицаПереданные.П000310002001,
			|	ФизлицаПереданные.П000310003001,
			|	ФизлицаПереданные.П000310004001,
			|	ФизлицаПереданные.П000310005001,
			|	ФизлицаПереданные.П000310006001,
			|	ФизлицаПереданные.П000310007001,
			|	ФизлицаПереданные.П000310008001,
			|	ФизлицаПереданные.П000310009001,
			|	ФизлицаПереданные.П000310010001,
			|	ФизлицаПереданные.П000310011001,
			|	ФизлицаПереданные.П000310011002,
			|	ЛОЖЬ,
			|	"""",
			|	""""
			|ИЗ
			|	ВТДанныеСПовторнымиФизическимиЛицами КАК ДанныеСПовторнымиФизическимиЛицами
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизлицаПереданные
			|		ПО ДанныеСПовторнымиФизическимиЛицами.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310003001 <> ФизлицаПереданные.П000310003001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310004001 <> ФизлицаПереданные.П000310004001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310005001 <> ФизлицаПереданные.П000310005001
			|			И ДанныеСПовторнымиФизическимиЛицами.П000310006001 <> ФизлицаПереданные.П000310006001
			|ГДЕ
			|	ФизлицаПереданные.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	ФизлицаПереданные.П000310008001 + "" "" + ФизлицаПереданные.П000310009001 + "" "" + ФизлицаПереданные.П000310010001,
			|	"""",
			|	""1"",
			|	ФизлицаПереданные.П000310002001,
			|	ФизлицаПереданные.П000310003001,
			|	ФизлицаПереданные.П000310004001,
			|	ФизлицаПереданные.П000310005001,
			|	ФизлицаПереданные.П000310006001,
			|	ФизлицаПереданные.П000310007001,
			|	ФизлицаПереданные.П000310008001,
			|	ФизлицаПереданные.П000310009001,
			|	ФизлицаПереданные.П000310010001,
			|	ФизлицаПереданные.П000310011001,
			|	ФизлицаПереданные.П000310011002,
			|	ЛОЖЬ,
			|	"""",
			|	""""
			|ИЗ
			|	ВТФизлицаПереданные КАК ФизлицаПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ПО ФизлицаПереданные.П000310003001 = ФизлицаПоТекущимДанным.П000310003001
			|			И ФизлицаПереданные.П000310004001 = ФизлицаПоТекущимДанным.П000310004001
			|			И ФизлицаПереданные.П000310005001 = ФизлицаПоТекущимДанным.П000310005001
			|			И ФизлицаПереданные.П000310006001 = ФизлицаПоТекущимДанным.П000310006001
			|ГДЕ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИО,
			|	П000030001001 УБЫВ";
			ОписаниеТаблиц.Подраздел3Физлица2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;

		Если ОписаниеТаблиц.Свойство("Подраздел321Доходы2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.П00321М112001,
			|	СведенияОДоходах.П00321М113001,
			|	СведенияОДоходах.П00321М114001,
			|	СведенияОДоходах.П00321М115001,
			|	СведенияОДоходах.П00321М116001,
			|	СведенияОДоходах.П00321М117001
			|ИЗ
			|	ВТДоходыВзносовПоТекущимДанным КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО СведенияОДоходах.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.П00321М112001,
			|	СведенияОДоходах.П00321М113001";
			ОписаниеТаблиц.Подраздел321Доходы2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;

		Если ОписаниеТаблиц.Свойство("Подраздел322Доходы2020") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Данные.ФизическоеЛицо,
			|	Данные.П00322М118001,
			|	Данные.П00322М119001,
			|	Данные.П00322М120001,
			|	Данные.П00322М121001
			|ИЗ
			|	ВТДоходыВредныхВзносовПоТекущимДанным КАК Данные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО Данные.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	Данные.ФизическоеЛицо,
			|	Данные.П00322М118001,
			|	Данные.П00322М119001";
			ОписаниеТаблиц.Подраздел322Доходы2020 = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура РасчетПоказателей_РСВ_2018(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, ДатаАктуальности, МассивФизическихЛиц)
	УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_РСВ_2018(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные, ДатаАктуальности, МассивФизическихЛиц);
КонецПроцедуры

// РСВ-1

Процедура ОписаниеПоказателей_РСВ1_2015Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РСВ1_2015Кв1(ПоказателиОтчета)	
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ1_2015Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РСВ1_2015Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РСВ1_2014Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РСВ1_2014Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ1_2014Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РСВ1_2014Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РСВ1_2013Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РСВ1_2013Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ1_2013Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РСВ1_2013Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РСВ1_2012Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РСВ1_2012Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ1_2012Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РСВ1_2012Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РСВ1_2011Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РСВ1_2011Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РСВ1_2011Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РСВ1_2011Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура РасчетПоказателейРСВ1(ИмяРасчета, НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь) Экспорт

	Если ИмяРасчета = "РасчетПоказателей_РСВ1_2013Кв1" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_РСВ1_2013Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_РСВ1_2014" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_РСВ1_2014(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_РСВ1_2015" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_РСВ1_2015(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	Иначе
		
	КонецЕсли;

КонецПроцедуры

// РВ-3

Процедура ЗначенияПоказателей_РВ3_2016(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РВ3_2016(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РВ3_2015Кв3(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РВ3_2015Кв3(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РВ3_2015Кв3(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РВ3_2015Кв3(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_РВ3_2011Кв4(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_РВ3_2011Кв4(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_РВ3_2011Кв4(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_РВ3_2011Кв4(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

// 4-ФСС

Процедура ОписаниеПоказателей_4ФСС_2017Кв3(ПоказателиОтчета, ПараметрыОтчета = Неопределено, ИспользоватьСКЕ = Неопределено) Экспорт
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "ЧислРаботников",Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "ЧислИнвалидов", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000106", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000204", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000205", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000206", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000403", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000404", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000405", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000406", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002301", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020006003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015301", Истина, Истина);
	
	// Раздел СКЕ будем заполнять только тогда, когда его попросили пользователи.
	Если ИспользоватьСКЕ = Неопределено Тогда
		ИспользоватьСКЕ = Ложь;
		Если ТипЗнч(ПараметрыОтчета) = Тип("Структура") Тогда
			Организация = Неопределено;
			ИспользоватьСКЕ = ПараметрыОтчета.Свойство("Организация", Организация) И ПолучитьФункциональнуюОпцию("ИспользоватьСамостоятельныеКлассификационныеЕдиницы", Новый Структура("Организация",Организация))
		КонецЕсли;
	КонецЕсли;
	Если ИспользоватьСКЕ Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000101", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000102", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000103", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000104", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000107", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000108", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000109", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000110", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000111", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000112", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000113", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000114", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000115", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000910000116", Истина, Ложь);
	КонецЕсли;
	
	ДобавлятьПоказателиЗадолженности = Истина;
	ДобавлятьПоказателиУплатыВзносов = Истина;
	
	Если ТипЗнч(ПараметрыОтчета) = Тип("Структура")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадры") Тогда
		Организация = Неопределено;
		ДатаКонцаПериодаОтчета = Неопределено;
		Если ПараметрыОтчета.Свойство("Организация", Организация) И ПараметрыОтчета.Свойство("ДатаКонцаПериодаОтчета", ДатаКонцаПериодаОтчета) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход КАК СуммаПриход,
			|	РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаРасход КАК СуммаРасход
			|ИЗ
			|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			,
			|			ЭтоСтраховыеВзносы
			|				И ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
			|				И Организация = &Организация
			|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";

			Запрос.УстановитьПараметр("НачалоПериода",	ДобавитьМесяц(НачалоГода(ДатаКонцаПериодаОтчета), -12));
			Запрос.УстановитьПараметр("КонецПериода",	НачалоГода(ДатаКонцаПериодаОтчета) - 1);
			Результат = Запрос.Выполнить();
			ДобавлятьПоказателиЗадолженности = Результат.Пустой();
			Если Не ДобавлятьПоказателиЗадолженности Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ДобавлятьПоказателиЗадолженности = ЗначениеЗаполнено(Выборка.СуммаРасход) Или Не ЗначениеЗаполнено(Выборка.СуммаПриход)
			КонецЕсли;
	
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Расчеты.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
			|	Расчеты.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата
			|ИЗ
			|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
			|ГДЕ
			|	Расчеты.ЭтоСтраховыеВзносы
			|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
			|	И Расчеты.Организация = &Организация
			|	И Расчеты.Сумма <> 0
			|	И Расчеты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
			|	И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода";

			Запрос.УстановитьПараметр("НачалоПериода",	НачалоГода(ДатаКонцаПериодаОтчета));
			Запрос.УстановитьПараметр("КонецПериода",	КонецМесяца(ДатаКонцаПериодаОтчета));
			ДобавлятьПоказателиУплатыВзносов = Не Запрос.Выполнить().Пустой();
			ДобавлятьПоказателиЗадолженности = ДобавлятьПоказателиЗадолженности Или ДобавлятьПоказателиУплатыВзносов;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавлятьПоказателиЗадолженности Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020001003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020013003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014003", Истина, Истина);
	КонецЕсли;
	Если ДобавлятьПоказателиУплатыВзносов Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016001", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016104", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016105", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016101", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016204", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016205", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016201", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016304", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016305", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016301", Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2017Кв3(ПараметрыОтчета, Контейнер) Экспорт
	
	Организация = ПараметрыОтчета.Организация;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	НачалоТекущегоКвартала = НачалоКвартала(ДатаКонцаПериодаОтчета);
	
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеДокументовВУчетеСтраховыхВзносов");
		Модуль.ОтразитьДокументыВУчетеСтраховыхВзносов(Организация);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("НачалоПрошлогоГода",			ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("КонецПрошлогоГода",			НачалоПериода - 1);
	Запрос.УстановитьПараметр("ДалекаяДата", 				ДобавитьМесяц(НачалоПериода, 1200));
	Запрос.УстановитьПараметр("Месяц1",						Месяц(НачалоТекущегоКвартала));
	Запрос.УстановитьПараметр("Месяц2",						Месяц(НачалоТекущегоКвартала) + 1);
	Запрос.УстановитьПараметр("Месяц3",						Месяц(НачалоТекущегоКвартала) + 2);

	// ----------------------------------------------------------------------------------
	// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ Расчеты.ЭтоДоначислениеПоАктуПроверки
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиНачислено,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И Расчеты.ЭтоДоначислениеПоАктуПроверки
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиДоНачислено,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиУплачено,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.НеПринято)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиНеПринятоРасходов,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПолученоИзФонда)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиВозмещеноРасходов,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиПроизведеноРасходов,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Период,
	|	Расчеты.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
	|	Расчеты.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
	|ГДЕ
	|	Расчеты.ЭтоСтраховыеВзносы
	|	И Расчеты.Организация = &Организация
	|	И Расчеты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	И Расчеты.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС КАК ЭтоРасчетыПоНачислениюУплатеВзносовВФСС,
	|	Расчеты.СуммаОстаток КАК СуммаОстатокФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТОстаткиНаКонец
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Остатки(
	|			&КонецОтчетногоПериода,
	|			Организация = &Организация
	|				И ЭтоСтраховыеВзносы
	|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК Расчеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Расчеты.СуммаОстаток), 0) КАК ФССНесчастныеСлучаиНачальныйОстаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|					ТОГДА Расчеты.СуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|ПОМЕСТИТЬ ВТОстаткиНаНачало
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Остатки(
	|			&НачалоОтчетногоПериода,
	|			Организация = &Организация
	|				И ЭтоСтраховыеВзносы
	|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК Расчеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНачислено) КАК ФССНесчастныеСлучаиНачислено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиДоНачислено) КАК ФССНесчастныеСлучаиДоНачислено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиУплачено) КАК ФССНесчастныеСлучаиУплачено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНеПринятоРасходов) КАК ФССНесчастныеСлучаиНеПринятоРасходов,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиВозмещеноРасходов) КАК ФССНесчастныеСлучаиВозмещеноРасходов,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов) КАК ФССНесчастныеСлучаиПроизведеноРасходов,
	|	НАЧАЛОПЕРИОДА(РасчетыСФондом.Период, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТРасчетыПомесячно
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РасчетыСФондом.Период, МЕСЯЦ)";
	Запрос.Выполнить();
	
	// ----------------------------------------------------------------------------------
	// ТЕКСТЫ ЗАПРОСОВ
	
	РасчетыСФондомОстаткиТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток > 0
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020001003,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ > ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ - ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020013003,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ > ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК П000020014003
	|ИЗ
	|	ВТОстаткиНаНачало КАК РасчетыСФондом";
	
	КонечныйОстатокТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи) < 0
	|					ТОГДА -СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи)
	|				ИНАЧЕ 0
	|			КОНЕЦ > СУММА(ВЫБОР
	|					КОГДА Расчеты.СуммаОстатокФССНесчастныеСлучаи < 0
	|							И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|						ТОГДА -Расчеты.СуммаОстатокФССНесчастныеСлучаи
	|					ИНАЧЕ 0
	|				КОНЕЦ)
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.СуммаОстатокФССНесчастныеСлучаи < 0
	|								И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|							ТОГДА -Расчеты.СуммаОстатокФССНесчастныеСлучаи
	|						ИНАЧЕ 0
	|					КОНЕЦ)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи) < 0
	|					ТОГДА -СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК П000020011003
	|ИЗ
	|	ВТОстаткиНаКонец КАК Расчеты";
	
	РасчетыСФондомОборотыТекст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002001,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002101,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002201,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002301,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиДоНачислено), 0) КАК П000020003003,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНеПринятоРасходов), 0) КАК П000020004003,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиВозмещеноРасходов), 0) КАК П000020006003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015001,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015101,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015201,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015301,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020016001
	|ИЗ
	|	ВТРасчетыПомесячно КАК РасчетыСФондом";
	
	УплаченоТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016101,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016104,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016105,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016201,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016204,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016205,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016301,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016304,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016305,
	|	МЕСЯЦ(РасчетыСФондом.Период) КАК МесяцПериода,
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом
	|ГДЕ
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено <> 0
	|	И МЕСЯЦ(РасчетыСФондом.Период) МЕЖДУ &Месяц1 И &Месяц3
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСФондом.Период";

	ИспользоватьСКЕ = ПолучитьФункциональнуюОпцию("ИспользоватьСамостоятельныеКлассификационныеЕдиницы", Новый Структура("Организация",Организация));
	
	// Очистка контейнера.
	
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_4ФСС_2017Кв3(ПоказателиОтчета, ПараметрыОтчета, ИспользоватьСКЕ);
	
	ЗаполнятьСальдоНаНачалоГода = ПоказателиОтчета.Свойство("П000020001003");
	ЗаполнятьУплатуВзносов = ПоказателиОтчета.Свойство("П000020016001");
	
	Значение = Неопределено;
	Для каждого КлючИЗначение Из Контейнер.Таблица1 Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			Контейнер.Таблица1[КлючИЗначение.Ключ] = 0
		КонецЕсли;
	КонецЦикла;
	Для каждого КлючИЗначение Из Контейнер.Таблица2 Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			Контейнер.Таблица2[КлючИЗначение.Ключ] = 0
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнятьУплатуВзносов Тогда
		Контейнер.Таблица2_1_ДанныеДопСтрок.Очистить();
		Контейнер.Таблица2_2_ДанныеДопСтрок.Очистить();
		Контейнер.Таблица2_3_ДанныеДопСтрок.Очистить();
	Иначе 
		ПолеУплаты = "П000020016001";
		РасчетыСФондомОборотыТекст = СтрЗаменить(РасчетыСФондомОборотыТекст, ПолеУплаты, "ОтсутствующееПоле");
	КонецЕсли;
	Контейнер.Таблица91_ДанныеДопСтрок.Очистить();
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	ОписаниеТаблиц = Новый Структура("Доходы2017" + ?(ИспользоватьСКЕ, ",СКЕ", ""));
	РасчетПоказателей_4ФСС_2019(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц);
	
	ДанныеЧисленности = КадровыйУчет.СреднесписочнаяЧисленностьРаботающих(Организация, ПараметрыОтчета.ДатаНачалаПериодаОтчета, ДатаКонцаПериодаОтчета);
	Контейнер.Титульный.ЧислРаботников = Формат(ДанныеЧисленности.СреднесписочнаяЧисленностьРаботников,"ЧГ=0");
	Контейнер.Титульный.ЧислИнвалидов = Формат(ДанныеЧисленности.ЧисленностьИнвалидов,"ЧГ=0");
	
	// Таблица 1
	
	ТаблицаДоходов = ОписаниеТаблиц.Доходы2017;
	Если ТаблицаДоходов.Количество() > 0 Тогда
		СтрокаДоходов = ТаблицаДоходов[0];
		ЗаполнитьЗначенияСвойств(Контейнер.Таблица1, СтрокаДоходов);
	КонецЕсли;
	
	// РАСЧЕТЫ ПО СРЕДСТВАМ ОБЯЗАТЕЛЬНОГО СОЦИАЛЬНОГО СТРАХОВАНИЯ 
	
	// Таблица 2
	
	// Заполняем по данным учета расчетов с фондом.
	
	Если ЗаполнятьСальдоНаНачалоГода Тогда
		Запрос.Текст = РасчетыСФондомОстаткиТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = РасчетыСФондомОборотыТекст;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
	КонецЕсли;
	
	Если ЗаполнятьУплатуВзносов Тогда
		Запрос.Текст = УплаченоТекст;
		РезультатПоУплатам = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаДанных Из РезультатПоУплатам Цикл
			Если СтрокаДанных.ФССНесчастныеСлучаиУплачено <> 0 Тогда
				ИмяКоллекции = "Таблица2_" + (СтрокаДанных.МесяцПериода - Месяц(НачалоТекущегоКвартала) + 1) + "_ДанныеДопСтрок";
				ЗаполнитьЗначенияСвойств(Контейнер[ИмяКоллекции].Добавить(), СтрокаДанных);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаполнятьСальдоНаНачалоГода Тогда
		Запрос.Текст = КонечныйОстатокТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	// Таблица СКЕ
	Если ИспользоватьСКЕ Тогда
		НомерПП = 1;
		Для каждого СтрокаДанных Из ОписаниеТаблиц.СКЕ Цикл
			НоваяСтрока = Контейнер.Таблица91_ДанныеДопСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			НоваяСтрока.П000910000101 = НомерПП;
			НомерПП = НомерПП + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета, ПараметрыОтчета = Неопределено) Экспорт
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "ЧислРаботников",Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "ЧислИнвалидов", Истина, Ложь);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000106", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000204", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000205", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000206", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000403", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000404", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000405", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010000406", Истина, Истина);
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020002301", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020003003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020004003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020006003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015101", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015301", Истина, Истина);
	
	ДобавлятьПоказателиЗадолженности = Истина;
	ДобавлятьПоказателиУплатыВзносов = Истина;
	
	Если ТипЗнч(ПараметрыОтчета) = Тип("Структура")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадры") Тогда
		Организация = Неопределено;
		ДатаКонцаПериодаОтчета = Неопределено;
		Если ПараметрыОтчета.Свойство("Организация", Организация) И ПараметрыОтчета.Свойство("ДатаКонцаПериодаОтчета", ДатаКонцаПериодаОтчета) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход КАК СуммаПриход,
			|	РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаРасход КАК СуммаРасход
			|ИЗ
			|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			,
			|			ЭтоСтраховыеВзносы
			|				И ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
			|				И Организация = &Организация
			|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";

			Запрос.УстановитьПараметр("НачалоПериода",	ДобавитьМесяц(НачалоГода(ДатаКонцаПериодаОтчета), -12));
			Запрос.УстановитьПараметр("КонецПериода",	НачалоГода(ДатаКонцаПериодаОтчета) - 1);
			Результат = Запрос.Выполнить();
			ДобавлятьПоказателиЗадолженности = Результат.Пустой();
			Если Не ДобавлятьПоказателиЗадолженности Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ДобавлятьПоказателиЗадолженности = ЗначениеЗаполнено(Выборка.СуммаРасход) Или Не ЗначениеЗаполнено(Выборка.СуммаПриход)
			КонецЕсли;
	
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Расчеты.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
			|	Расчеты.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата
			|ИЗ
			|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
			|ГДЕ
			|	Расчеты.ЭтоСтраховыеВзносы
			|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
			|	И Расчеты.Организация = &Организация
			|	И Расчеты.Сумма <> 0
			|	И Расчеты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
			|	И Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода";

			Запрос.УстановитьПараметр("НачалоПериода",	НачалоГода(ДатаКонцаПериодаОтчета));
			Запрос.УстановитьПараметр("КонецПериода",	КонецМесяца(ДатаКонцаПериодаОтчета));
			ДобавлятьПоказателиУплатыВзносов = Не Запрос.Выполнить().Пустой();
			ДобавлятьПоказателиЗадолженности = ДобавлятьПоказателиЗадолженности Или ДобавлятьПоказателиУплатыВзносов;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавлятьПоказателиЗадолженности Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020001003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020013003", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014003", Истина, Истина);
	КонецЕсли;
	Если ДобавлятьПоказателиУплатыВзносов Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016001", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016104", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016105", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016101", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016204", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016205", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016201", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016304", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016305", Истина, Истина);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016301", Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2017Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	Организация = ПараметрыОтчета.Организация;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	НачалоТекущегоКвартала = НачалоКвартала(ДатаКонцаПериодаОтчета);
	
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеДокументовВУчетеСтраховыхВзносов");
		Модуль.ОтразитьДокументыВУчетеСтраховыхВзносов(Организация);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("НачалоПрошлогоГода",			ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("КонецПрошлогоГода",			НачалоПериода - 1);
	Запрос.УстановитьПараметр("ДалекаяДата", 				ДобавитьМесяц(НачалоПериода, 1200));
	Запрос.УстановитьПараметр("Месяц1",						Месяц(НачалоТекущегоКвартала));
	Запрос.УстановитьПараметр("Месяц2",						Месяц(НачалоТекущегоКвартала) + 1);
	Запрос.УстановитьПараметр("Месяц3",						Месяц(НачалоТекущегоКвартала) + 2);

	// ----------------------------------------------------------------------------------
	// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ Расчеты.ЭтоДоначислениеПоАктуПроверки
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиНачислено,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И Расчеты.ЭтоДоначислениеПоАктуПроверки
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиДоНачислено,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПустаяСсылка)
	|			ТОГДА Расчеты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиУплачено,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.НеПринято)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиНеПринятоРасходов,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.ПолученоИзФонда)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиВозмещеноРасходов,
	|	ВЫБОР
	|		КОГДА Расчеты.РасчетыПоПособиям = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию)
	|			ТОГДА Расчеты.Сумма * ВЫБОР
	|					КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						ТОГДА 1
	|					ИНАЧЕ -1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаиПроизведеноРасходов,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Период,
	|	Расчеты.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
	|	Расчеты.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК Расчеты
	|ГДЕ
	|	Расчеты.ЭтоСтраховыеВзносы
	|	И Расчеты.Организация = &Организация
	|	И Расчеты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	И Расчеты.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС КАК ЭтоРасчетыПоНачислениюУплатеВзносовВФСС,
	|	Расчеты.СуммаОстаток КАК СуммаОстатокФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТОстаткиНаКонец
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Остатки(
	|			&КонецОтчетногоПериода,
	|			Организация = &Организация
	|				И ЭтоСтраховыеВзносы
	|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК Расчеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Расчеты.СуммаОстаток), 0) КАК ФССНесчастныеСлучаиНачальныйОстаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|					ТОГДА Расчеты.СуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|ПОМЕСТИТЬ ВТОстаткиНаНачало
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Остатки(
	|			&НачалоОтчетногоПериода,
	|			Организация = &Организация
	|				И ЭтоСтраховыеВзносы
	|				И ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)) КАК Расчеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНачислено) КАК ФССНесчастныеСлучаиНачислено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиДоНачислено) КАК ФССНесчастныеСлучаиДоНачислено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиУплачено) КАК ФССНесчастныеСлучаиУплачено,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНеПринятоРасходов) КАК ФССНесчастныеСлучаиНеПринятоРасходов,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиВозмещеноРасходов) КАК ФССНесчастныеСлучаиВозмещеноРасходов,
	|	СУММА(РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов) КАК ФССНесчастныеСлучаиПроизведеноРасходов,
	|	НАЧАЛОПЕРИОДА(РасчетыСФондом.Период, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТРасчетыПомесячно
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РасчетыСФондом.Период, МЕСЯЦ)";
	Запрос.Выполнить();
	
	// ----------------------------------------------------------------------------------
	// ТЕКСТЫ ЗАПРОСОВ
	
	РасчетыСФондомОстаткиТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток > 0
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020001003,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ > ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ - ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020013003,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ > ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам < 0
	|						ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстатокПоВзносам
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток < 0
	|					ТОГДА -РасчетыСФондом.ФССНесчастныеСлучаиНачальныйОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК П000020014003
	|ИЗ
	|	ВТОстаткиНаНачало КАК РасчетыСФондом";
	
	КонечныйОстатокТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи) < 0
	|					ТОГДА -СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи)
	|				ИНАЧЕ 0
	|			КОНЕЦ > СУММА(ВЫБОР
	|					КОГДА Расчеты.СуммаОстатокФССНесчастныеСлучаи < 0
	|							И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|						ТОГДА -Расчеты.СуммаОстатокФССНесчастныеСлучаи
	|					ИНАЧЕ 0
	|				КОНЕЦ)
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.СуммаОстатокФССНесчастныеСлучаи < 0
	|								И Расчеты.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС
	|							ТОГДА -Расчеты.СуммаОстатокФССНесчастныеСлучаи
	|						ИНАЧЕ 0
	|					КОНЕЦ)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи) < 0
	|					ТОГДА -СУММА(Расчеты.СуммаОстатокФССНесчастныеСлучаи)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК П000020011003
	|ИЗ
	|	ВТОстаткиНаКонец КАК Расчеты";
	
	РасчетыСФондомОборотыТекст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002001,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002101,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002201,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено < 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиНачислено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020002301,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиДоНачислено), 0) КАК П000020003003,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиНеПринятоРасходов), 0) КАК П000020004003,
	|	ЕСТЬNULL(СУММА(РасчетыСФондом.ФССНесчастныеСлучаиВозмещеноРасходов), 0) КАК П000020006003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015001,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015101,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015201,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиПроизведеноРасходов
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020015301,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(РасчетыСФондом.Период) < &Месяц1
	|					ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000020016001
	|ИЗ
	|	ВТРасчетыПомесячно КАК РасчетыСФондом";
	
	УплаченоТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016101,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016104,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016105,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016201,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016204,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016205,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016301,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016304,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016305,
	|	МЕСЯЦ(РасчетыСФондом.Период) КАК МесяцПериода,
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом
	|ГДЕ
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено <> 0
	|	И МЕСЯЦ(РасчетыСФондом.Период) МЕЖДУ &Месяц1 И &Месяц3
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСФондом.Период";

	// Очистка контейнера.
	
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета, ПараметрыОтчета);
	
	ЗаполнятьСальдоНаНачалоГода = ПоказателиОтчета.Свойство("П000020001003");
	ЗаполнятьУплатуВзносов = ПоказателиОтчета.Свойство("П000020016001");
	
	Значение = Неопределено;
	Для каждого КлючИЗначение Из Контейнер.Таблица1 Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			Контейнер.Таблица1[КлючИЗначение.Ключ] = 0
		КонецЕсли;
	КонецЦикла;
	Для каждого КлючИЗначение Из Контейнер.Таблица2 Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			Контейнер.Таблица2[КлючИЗначение.Ключ] = 0
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнятьУплатуВзносов Тогда
		Контейнер.Таблица2_1_ДанныеДопСтрок.Очистить();
		Контейнер.Таблица2_2_ДанныеДопСтрок.Очистить();
		Контейнер.Таблица2_3_ДанныеДопСтрок.Очистить();
	Иначе 
		ПолеУплаты = "П000020016001";
		РасчетыСФондомОборотыТекст = СтрЗаменить(РасчетыСФондомОборотыТекст, ПолеУплаты, "ОтсутствующееПоле");
	КонецЕсли;
	
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	ОписаниеТаблиц = Новый Структура("Доходы2017");
	РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц);
	
	ДанныеЧисленности = КадровыйУчет.СреднесписочнаяЧисленностьРаботающих(Организация, ПараметрыОтчета.ДатаНачалаПериодаОтчета, ДатаКонцаПериодаОтчета);
	Контейнер.Титульный.ЧислРаботников = Формат(ДанныеЧисленности.СреднесписочнаяЧисленностьРаботников,"ЧГ=0");
	Контейнер.Титульный.ЧислИнвалидов = Формат(ДанныеЧисленности.ЧисленностьИнвалидов,"ЧГ=0");
	
	// Таблица 1
	
	ТаблицаДоходов = ОписаниеТаблиц.Доходы2017;
	Если ТаблицаДоходов.Количество() > 0 Тогда
		СтрокаДоходов = ТаблицаДоходов[0];
		ЗаполнитьЗначенияСвойств(Контейнер.Таблица1, СтрокаДоходов);
	КонецЕсли;
	
	// РАСЧЕТЫ ПО СРЕДСТВАМ ОБЯЗАТЕЛЬНОГО СОЦИАЛЬНОГО СТРАХОВАНИЯ 
	
	// Таблица 2
	
	// Заполняем по данным учета расчетов с фондом.
	
	Если ЗаполнятьСальдоНаНачалоГода Тогда
		Запрос.Текст = РасчетыСФондомОстаткиТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = РасчетыСФондомОборотыТекст;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
	КонецЕсли;
	
	Если ЗаполнятьУплатуВзносов Тогда
		Запрос.Текст = УплаченоТекст;
		РезультатПоУплатам = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаДанных Из РезультатПоУплатам Цикл
			Если СтрокаДанных.ФССНесчастныеСлучаиУплачено <> 0 Тогда
				ИмяКоллекции = "Таблица2_" + (СтрокаДанных.МесяцПериода - Месяц(НачалоТекущегоКвартала) + 1) + "_ДанныеДопСтрок";
				ЗаполнитьЗначенияСвойств(Контейнер[ИмяКоллекции].Добавить(), СтрокаДанных);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаполнятьСальдоНаНачалоГода Тогда
		Запрос.Текст = КонечныйОстатокТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица2, Выборка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2016Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_4ФСС_2016Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2016Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_4ФСС_2016Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2015Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_4ФСС_2015Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2015Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_4ФСС_2015Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2014Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_4ФСС_2014Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2012Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_4ФСС_2012Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2012Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_4ФСС_2012Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры

Процедура ОписаниеПоказателей_4ФСС_2011Кв1(ПоказателиОтчета) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ОписаниеПоказателей_4ФСС_2011Кв1(ПоказателиОтчета)
	
КонецПроцедуры

Процедура ЗначенияПоказателей_4ФСС_2011Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	УчетСтраховыхВзносовАрхивныеАлгоритмы.ЗначенияПоказателей_4ФСС_2011Кв1(ПараметрыОтчета, Контейнер)
	
КонецПроцедуры


Процедура РасчетПоказателей4ФСС(ИмяРасчета, НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь) Экспорт

	Если ИмяРасчета = "РасчетПоказателей_4ФСС_2012Кв1" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_4ФСС_2012Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_4ФСС_2015Кв1" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_4ФСС_2015Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_4ФСС_2016Кв1" Тогда
		УчетСтраховыхВзносовАрхивныеАлгоритмы.РасчетПоказателей_4ФСС_2016Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_4ФСС_2017Кв1" Тогда
		РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_4ФСС_2019" Тогда
		РасчетПоказателей_4ФСС_2019(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные);
	Иначе
		
	КонецЕсли;

КонецПроцедуры

Процедура РасчетПоказателей_4ФСС_2019(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	НачалоТекущегоКвартала = НачалоКвартала(ОкончаниеПериода);
	ЭтоЮридическоеЛицо = ЗарплатаКадры.ЭтоЮридическоеЛицо(Организация);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		ОкончаниеПериода);
	Запрос.УстановитьПараметр("Месяц1",						Месяц(НачалоТекущегоКвартала));
	Запрос.УстановитьПараметр("Месяц2",						Месяц(НачалоТекущегоКвартала) + 1);
	Запрос.УстановитьПараметр("Месяц3",						Месяц(НачалоТекущегоКвартала) + 2);
	
	НеОбъект = Новый Массив;
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеОткрытия);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеЛитературныеПроизведения);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеНаучныеТруды);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеСкульптуры);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеГрафическиеПроизведения);
	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеИсполнениеПроизведений);
	Если НачалоПериода >= '20190101' Тогда
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
	КонецЕсли;
	Запрос.УстановитьПараметр("НеЯвляетсяОбъектом", НеОбъект);
	
	// ----------------------------------------------------------------------------------
	// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
	
	Если ОписаниеТаблиц.Свойство("Доходы2017") Или ОписаниеТаблиц.Свойство("СКЕ") Тогда
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СтраховыеВзносыСведенияОДоходах
		|ГДЕ
		|	СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СтраховыеВзносыСведенияОДоходах.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтраховыеВзносыИсчисленные.ФизическоеЛицо,
		|	СтраховыеВзносыИсчисленные.ГоловнаяОрганизация
		|ИЗ
		|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК СтраховыеВзносыИсчисленные
		|ГДЕ
		|	СтраховыеВзносыИсчисленные.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СтраховыеВзносыИсчисленные.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
		Запрос.Выполнить();
		
		// Формируем список месяцев, в разрезе которых собираем данные.
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, КонецМесяца(НачалоГода(НачалоПериода)), КонецМесяца(ОкончаниеПериода),,, "ВТПериодыРасширенныхСведенийОДоходах", Истина);
		
		// Получаем временные таблицы, используя общие алгоритмы.
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
		|ИЗ
		|	ВТФизЛицаОрганизаций КАК СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРасширенныхСведенийОДоходах КАК Периоды
		|		ПО (ИСТИНА)";
		Запрос.Выполнить();
		
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
		
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"ПрименяемыеТарифыСтраховыхВзносов",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТПериодыФизЛицОрганизаций",
			"ГоловнаяОрганизация"),
			ПараметрыПостроения);
		
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
		
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"СведенияОбИнвалидностиФизическихЛиц",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТПериодыФизЛицОрганизаций",
			"ФизическоеЛицо"),
			ПараметрыПостроения);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|	СписокФизЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
		|	СписокФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(ДанныеОбИнвалидности.Инвалидность, ЛОЖЬ) КАК Инвалид,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ДанныеОбИнвалидности.Инвалидность, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		КОГДА ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ОрганизацияИнвалидов
		|	КОНЕЦ КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Начисление, ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)) КАК Начисление,
		|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода.ВходитВБазуФСС_НС, ЛОЖЬ) КАК ВходитВБазуФСС_НС,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК Скидка,
		|	ВЫБОР
		|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ДоходыПоФизлицам.ВидДохода.ВходитВБазуФСС_НС
		|			ТОГДА ДоходыПоФизлицам.Сумма - ВЫБОР
		|					КОГДА ДоходыПоФизлицам.ВидДохода.АвторскиеВознаграждения
		|						ТОГДА 0
		|					ИНАЧЕ ДоходыПоФизлицам.Скидка
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БазаФСС_НС,
		|	ЕСТЬNULL(ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.СКЕ, ДоходыПоФизлицам.Организация) КАК СКЕ,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор
		|ПОМЕСТИТЬ ВТДанныеУчета
		|ИЗ
		|	ВТПериодыФизЛицОрганизаций КАК СписокФизЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК ДоходыПоФизлицам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиницВторичный КАК ИсторияСамостоятельныхКлассификационныхЕдиницВторичный
		|			ПО ДоходыПоФизлицам.Подразделение = ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.СтруктурнаяЕдиница
		|				И (ДоходыПоФизлицам.Период МЕЖДУ ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.ДатаНачала И ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.ДатаОкончания)
		|		ПО СписокФизЛиц.ГоловнаяОрганизация = ДоходыПоФизлицам.ГоловнаяОрганизация
		|			И СписокФизЛиц.ФизическоеЛицо = ДоходыПоФизлицам.ФизическоеЛицо
		|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДоходыПоФизлицам.Период, МЕСЯЦ))
		|			И (ДоходыПоФизлицам.Организация = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносовСрезПоследних
		|		ПО СписокФизЛиц.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ГоловнаяОрганизация
		|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.Период, МЕСЯЦ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних КАК ДанныеОбИнвалидности
		|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДанныеОбИнвалидности.Период, МЕСЯЦ))
		|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОбИнвалидности.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблица.СКЕ КАК Организация,
		|	ВременнаяТаблица.ПериодРегистрации КАК Период
		|ПОМЕСТИТЬ ВТПереченьСКЕ
		|ИЗ
		|	ВТДанныеУчета КАК ВременнаяТаблица";
		Запрос.Выполнить();
		
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
			
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
				"ВТПереченьСКЕ",
				"Организация"),
			ПараметрыПостроения);
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
		|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияОДоходах.Организация КАК Организация,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Инвалид КАК Инвалид,
		|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияОДоходах.ВидДохода КАК ВидДохода,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	ЕСТЬNULL(СтавкаВзноса.Ставка, 0) КАК СтавкаНаНСиПЗ,
		|	СУММА(СведенияОДоходах.Сумма) КАК Сумма,
		|	СУММА(СведенияОДоходах.Скидка) КАК Скидка,
		|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаФСС_НС,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СведенияОДоходах.СКЕ КАК СКЕ
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	ВТДанныеУчета КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних КАК СтавкаВзноса
		|		ПО (НАЧАЛОПЕРИОДА(СведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СтавкаВзноса.Период, МЕСЯЦ))
		|			И СведенияОДоходах.СКЕ = СтавкаВзноса.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.ГоловнаяОрганизация,
		|	СведенияОДоходах.Организация,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Инвалид,
		|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияОДоходах.ВидДохода,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ВходитВБазуФСС_НС,
		|	СведенияОДоходах.Регистратор,
		|	ЕСТЬNULL(СтавкаВзноса.Ставка, 0),
		|	СведенияОДоходах.СКЕ
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходах.Сумма) <> 0
		|		ИЛИ СУММА(СведенияОДоходах.Скидка) <> 0
		|		ИЛИ СУММА(СведенияОДоходах.БазаФСС_НС) <> 0)";
		Запрос.Выполнить();
		
		РасчетЗарплаты.СоздатьВТДополнительныеСвойстваНачислений(Запрос.МенеджерВременныхТаблиц);
		ПособияНСиПЗ = Новый Массив;
		ПособияНСиПЗ.Добавить(Перечисления.ПереченьПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай);
		ПособияНСиПЗ.Добавить(Перечисления.ПереченьПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание);
		ПособияНСиПЗ.Добавить(Перечисления.ПереченьПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев);
		Запрос.УстановитьПараметр("ПособияНСиПЗ", ПособияНСиПЗ);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации
		|ПОМЕСТИТЬ ВТМесяцыБезОблагаемойБазы
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ПериодРегистрации
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.БазаФСС_НС) < 0";
		Результат = Запрос.Выполнить();
		
		Если Результат.Выгрузить()[0].Количество = 0 Тогда
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
			|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы";
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
			|ИЗ
			|	ВТСведенияОДоходах КАК СведенияОДоходах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМесяцыБезОблагаемойБазы КАК МесяцыБезОблагаемойБазы
			|		ПО СведенияОДоходах.ПериодРегистрации = МесяцыБезОблагаемойБазы.ПериодРегистрации
			|ГДЕ
			|	СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.ПериодРегистрации
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходах.БазаФСС_НС) < 0
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизическоеЛицо";
		КонецЕсли;
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.СКЕ КАК СКЕ,
		|	СведенияОДоходах.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НеЯвляетсяОбъектом)
		|				ТОГДА 0
		|			КОГДА НЕ СведенияОДоходах.ВходитВБазуФСС_НС
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ СведенияОДоходах.Скидка
		|		КОНЕЦ) КАК НеОблагаетсяНС_ПЗ,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
		|					И ЕСТЬNULL(СвойстваНачисленийДляУчетаСтраховыхВзносов.ВидПособияСоциальногоСтрахования, НЕОПРЕДЕЛЕНО) В (&ПособияНСиПЗ)
		|				ТОГДА СведенияОДоходах.Сумма
		|			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС)
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПособияЗаСчетФСС_НС,
		|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаНС_ПЗ,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС
		|				ТОГДА СведенияОДоходах.БазаФСС_НС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК БазаИнвалидаНС_ПЗ
		|ПОМЕСТИТЬ ВТОблагаемыеБазыПоМесяцам
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеСвойстваНачислений КАК СвойстваНачисленийДляУчетаСтраховыхВзносов
		|		ПО (ВЫБОР
		|				КОГДА СведенияОДоходах.Начисление ЕСТЬ NULL
		|					ТОГДА СведенияОДоходах.ВидДохода
		|				КОГДА СведенияОДоходах.Начисление = НЕОПРЕДЕЛЕНО
		|					ТОГДА СведенияОДоходах.ВидДохода
		|				ИНАЧЕ СведенияОДоходах.Начисление
		|			КОНЕЦ = СвойстваНачисленийДляУчетаСтраховыхВзносов.Начисление)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаБезОблагаемойБазы КАК ФизлицаБезОблагаемойБазы
		|		ПО СведенияОДоходах.ФизическоеЛицо = ФизлицаБезОблагаемойБазы.ФизическоеЛицо
		|			И СведенияОДоходах.ПериодРегистрации = ФизлицаБезОблагаемойБазы.ПериодРегистрации
		|ГДЕ
		|	СведенияОДоходах.Организация = &Организация
		|	И СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ФизлицаБезОблагаемойБазы.ФизическоеЛицо ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.СКЕ,
		|	СведенияОДоходах.СтавкаНаНСиПЗ,
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";
		Запрос.Выполнить();
	
	КонецЕсли;
	
	// Таблица 1 
	Если ОписаниеТаблиц.Свойство("Доходы2017") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000103,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаИнвалидаНС_ПЗ), 0) КАК П000010000403,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000203,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000105,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000106,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000404,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000405,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000406,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000204,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000205,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000206,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СведенияОДоходах.ФизическоеЛицо,", "");
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.Доходы2017 = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	// Таблица СКЕ
	Если ОписаниеТаблиц.Свойство("СКЕ") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СамостоятельныеКлассификационныеЕдиницы.КодОКВЭД2, """") КАК ОКВЭД,
		|	ЕСТЬNULL(СамостоятельныеКлассификационныеЕдиницы.КодОКВЭД2, """") КАК П000910000102,
		|	ЕСТЬNULL(СамостоятельныеКлассификационныеЕдиницы.КлассПрофессиональногоРиска, 0) КАК П000910000103,
		|	ЕСТЬNULL(СведенияОДоходах.СтавкаНаНСиПЗ, 0) КАК П000910000104,
		|	ЕСТЬNULL(СведенияОДоходах.СтавкаНаНСиПЗ, 0) КАК Тариф,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаНС_ПЗ), 0) КАК П000910000107,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаИнвалидаНС_ПЗ), 0) КАК П000910000108,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000910000115,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.ПособияЗаСчетФСС_НС), 0) КАК П000910000116,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000109,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000111,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000113,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000110,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000112,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000910000114,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ИЗ
		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СамостоятельныеКлассификационныеЕдиницы КАК СамостоятельныеКлассификационныеЕдиницы
		|		ПО СведенияОДоходах.СКЕ = СамостоятельныеКлассификационныеЕдиницы.Ссылка
		|ГДЕ
		|	СведенияОДоходах.СКЕ <> &Организация
		|	И ЕСТЬNULL(СведенияОДоходах.СтавкаНаНСиПЗ, 0) <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.СтавкаНаНСиПЗ,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	СамостоятельныеКлассификационныеЕдиницы.КодОКВЭД2,
		|	СамостоятельныеКлассификационныеЕдиницы.КлассПрофессиональногоРиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	СамостоятельныеКлассификационныеЕдиницы.КлассПрофессиональногоРиска";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		
		ОписаниеТаблиц.СКЕ = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	// ----------------------------------------------------------------------------------
	// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
	
	// Таблица 1 
	Если ОписаниеТаблиц.Свойство("Доходы2017") Тогда
		
		НачалоТекущегоКвартала = НачалоКвартала(ОкончаниеПериода);
		ЭтоЮридическоеЛицо = ЗарплатаКадры.ЭтоЮридическоеЛицо(Организация);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",				Организация);
		Запрос.УстановитьПараметр("НачалоОтчетногоПериода",		НачалоПериода);
		Запрос.УстановитьПараметр("КонецОтчетногоПериода",		ОкончаниеПериода);
		Запрос.УстановитьПараметр("Месяц1",						Месяц(НачалоТекущегоКвартала));
		Запрос.УстановитьПараметр("Месяц2",						Месяц(НачалоТекущегоКвартала) + 1);
		Запрос.УстановитьПараметр("Месяц3",						Месяц(НачалоТекущегоКвартала) + 2);
		
		НеОбъект = Новый Массив;
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеОткрытия);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеЛитературныеПроизведения);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеНаучныеТруды);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеСкульптуры);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеГрафическиеПроизведения);
		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеИсполнениеПроизведений);
		Если НачалоПериода >= '20190101' Тогда
			НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
		КонецЕсли;
		Запрос.УстановитьПараметр("НеЯвляетсяОбъектом", НеОбъект);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СтраховыеВзносыСведенияОДоходах
		|ГДЕ
		|	СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СтраховыеВзносыСведенияОДоходах.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтраховыеВзносыИсчисленные.ФизическоеЛицо,
		|	СтраховыеВзносыИсчисленные.ГоловнаяОрганизация
		|ИЗ
		|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК СтраховыеВзносыИсчисленные
		|ГДЕ
		|	СтраховыеВзносыИсчисленные.Период МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СтраховыеВзносыИсчисленные.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
		Запрос.Выполнить();
		
		// Формируем список месяцев, в разрезе которых собираем данные.
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, КонецМесяца(НачалоГода(НачалоПериода)), КонецМесяца(ОкончаниеПериода),,, "ВТПериодыРасширенныхСведенийОДоходах", Истина);
		
		// Получаем временные таблицы, используя общие алгоритмы.
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
		|ИЗ
		|	ВТФизЛицаОрганизаций КАК СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРасширенныхСведенийОДоходах КАК Периоды
		|		ПО (ИСТИНА)";
		Запрос.Выполнить();
		
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
		
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"ПрименяемыеТарифыСтраховыхВзносов",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТПериодыФизЛицОрганизаций",
			"ГоловнаяОрганизация"),
			ПараметрыПостроения);
		
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
		
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"СведенияОбИнвалидностиФизическихЛиц",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТПериодыФизЛицОрганизаций",
			"ФизическоеЛицо"),
			ПараметрыПостроения);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|	СписокФизЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
		|	СписокФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(ДанныеОбИнвалидности.Инвалидность, ЛОЖЬ) КАК Инвалид,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ДанныеОбИнвалидности.Инвалидность, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		КОГДА ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ОрганизацияИнвалидов
		|	КОНЕЦ КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Начисление, ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)) КАК Начисление,
		|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода.ВходитВБазуФСС_НС, ЛОЖЬ) КАК ВходитВБазуФСС_НС,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК Скидка,
		|	ВЫБОР
		|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ДоходыПоФизлицам.ВидДохода.ВходитВБазуФСС_НС
		|			ТОГДА ДоходыПоФизлицам.Сумма - ВЫБОР
		|					КОГДА ДоходыПоФизлицам.ВидДохода.АвторскиеВознаграждения
		|						ТОГДА 0
		|					ИНАЧЕ ДоходыПоФизлицам.Скидка
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БазаФСС_НС,
		|	ЕСТЬNULL(ДоходыПоФизлицам.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор
		|ПОМЕСТИТЬ ВТДанныеУчета
		|ИЗ
		|	ВТПериодыФизЛицОрганизаций КАК СписокФизЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК ДоходыПоФизлицам
		|		ПО СписокФизЛиц.ГоловнаяОрганизация = ДоходыПоФизлицам.ГоловнаяОрганизация
		|			И СписокФизЛиц.ФизическоеЛицо = ДоходыПоФизлицам.ФизическоеЛицо
		|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДоходыПоФизлицам.Период, МЕСЯЦ))
		|			И (ДоходыПоФизлицам.Организация = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносовСрезПоследних
		|		ПО СписокФизЛиц.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ГоловнаяОрганизация
		|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.Период, МЕСЯЦ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних КАК ДанныеОбИнвалидности
		|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДанныеОбИнвалидности.Период, МЕСЯЦ))
		|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОбИнвалидности.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
		|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияОДоходах.Организация КАК Организация,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Инвалид КАК Инвалид,
		|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияОДоходах.ВидДохода КАК ВидДохода,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	СУММА(СведенияОДоходах.Сумма) КАК Сумма,
		|	СУММА(СведенияОДоходах.Скидка) КАК Скидка,
		|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаФСС_НС,
		|	СведенияОДоходах.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	ВТДанныеУчета КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.ГоловнаяОрганизация,
		|	СведенияОДоходах.Организация,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Инвалид,
		|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияОДоходах.ВидДохода,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.ВходитВБазуФСС_НС,
		|	СведенияОДоходах.Регистратор
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходах.Сумма) <> 0
		|		ИЛИ СУММА(СведенияОДоходах.Скидка) <> 0
		|		ИЛИ СУММА(СведенияОДоходах.БазаФСС_НС) <> 0)";
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации
		|ПОМЕСТИТЬ ВТМесяцыБезОблагаемойБазы
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И СведенияОДоходах.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ПериодРегистрации
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.БазаФСС_НС) < 0";
		Результат = Запрос.Выполнить();
		
		Если Результат.Выгрузить()[0].Количество = 0 Тогда
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
			|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы";
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
			|ИЗ
			|	ВТСведенияОДоходах КАК СведенияОДоходах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМесяцыБезОблагаемойБазы КАК МесяцыБезОблагаемойБазы
			|		ПО СведенияОДоходах.ПериодРегистрации = МесяцыБезОблагаемойБазы.ПериодРегистрации
			|ГДЕ
			|	СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.ПериодРегистрации
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходах.БазаФСС_НС) < 0
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизическоеЛицо";
		КонецЕсли;
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ПериодРегистрации КАК Период,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода В (&НеЯвляетсяОбъектом)
		|				ТОГДА 0
		|			КОГДА НЕ СведенияОДоходах.ВходитВБазуФСС_НС
		|				ТОГДА СведенияОДоходах.Сумма
		|			ИНАЧЕ СведенияОДоходах.Скидка
		|		КОНЕЦ) КАК НеОблагаетсяНС_ПЗ,
		|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаНС_ПЗ,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС
		|				ТОГДА СведенияОДоходах.БазаФСС_НС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК БазаИнвалидаНС_ПЗ
		|ПОМЕСТИТЬ ВТОблагаемыеБазыПоМесяцам
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаБезОблагаемойБазы КАК ФизлицаБезОблагаемойБазы
		|		ПО СведенияОДоходах.ФизическоеЛицо = ФизлицаБезОблагаемойБазы.ФизическоеЛицо
		|			И СведенияОДоходах.ПериодРегистрации = ФизлицаБезОблагаемойБазы.ПериодРегистрации
		|ГДЕ
		|	СведенияОДоходах.Организация = &Организация
		|	И СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
		|	И ФизлицаБезОблагаемойБазы.ФизическоеЛицо ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";
		Запрос.Выполнить();
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000103,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаИнвалидаНС_ПЗ), 0) КАК П000010000403,
		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000203,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000104,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000105,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000106,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000404,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000405,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000406,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000204,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000205,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК П000010000206,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор
		|ИЗ
		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СведенияОДоходах.ФизическоеЛицо,", "");
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.Доходы2017 = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолей)

	Значение = Неопределено;
	
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			ТипПоля = ТипЗнч(СтруктураПолей[КлючИЗначение.Ключ]);
			Если ТипПоля = Тип("Строка") Тогда
				СтруктураПолей[КлючИЗначение.Ключ] = ""
			ИначеЕсли ТипПоля = Тип("Дата") Тогда
				СтруктураПолей[КлючИЗначение.Ключ] = '00010101'
			Иначе
				СтруктураПолей[КлючИЗначение.Ключ] = 0
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьПереданныеДанныеОтчета2020(Организация, ДатаОкончания, МенеджерВременныхТаблиц, НомерКорректировки)
	
	Данные = ИнтерфейсыВзаимодействияБРО.ПерсонифицированныеСведенияОЗастрахованныхЛицахИзРасчетовПоСтраховымВзносам(Новый Структура("Организация, ДатаОкончания, ИмяФормыОтчета", Организация, ДатаОкончания, "ФормаОтчета2020Кв1"));
	
	Если Данные.Количество() > 0 Тогда
		
		Физлица = Новый ТаблицаЗначений;
		Физлица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		Физлица.Колонки.Добавить("НомерСведения", Новый ОписаниеТипов("Число"));
		Физлица.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		Физлица.Колонки.Добавить("П000310002001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
		Физлица.Колонки.Добавить("П000310003001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(14)));
		Физлица.Колонки.Добавить("П000310004001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310005001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310006001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310007001", Новый ОписаниеТипов("Дата,Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310008001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310009001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310010001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310011001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("П000310011002", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		ДоходыВзносов = Новый ТаблицаЗначений;
		ДоходыВзносов.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ДоходыВзносов.Колонки.Добавить("НомерСведения", Новый ОписаниеТипов("Число"));
		ДоходыВзносов.Колонки.Добавить("П00321М112001", Новый ОписаниеТипов("Строка,Число", , Новый КвалификаторыСтроки(2)));
		ДоходыВзносов.Колонки.Добавить("П00321М113001", Новый ОписаниеТипов("Строка,ПеречислениеСсылка.КатегорииЗастрахованныхЛицДляПФР", , Новый КвалификаторыСтроки(4)));
		ДоходыВзносов.Колонки.Добавить("П00321М114001", Новый ОписаниеТипов("Число"));
		ДоходыВзносов.Колонки.Добавить("П00321М115001", Новый ОписаниеТипов("Число"));
		ДоходыВзносов.Колонки.Добавить("П00321М116001", Новый ОписаниеТипов("Число"));
		ДоходыВзносов.Колонки.Добавить("П00321М117001", Новый ОписаниеТипов("Число"));
		ДоходыВредныхВзносов = Новый ТаблицаЗначений;
		ДоходыВредныхВзносов.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ДоходыВредныхВзносов.Колонки.Добавить("НомерСведения", Новый ОписаниеТипов("Число"));
		ДоходыВредныхВзносов.Колонки.Добавить("П00322М118001", Новый ОписаниеТипов("Число"));
		ДоходыВредныхВзносов.Колонки.Добавить("П00322М119001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3)));
		ДоходыВредныхВзносов.Колонки.Добавить("П00322М120001", Новый ОписаниеТипов("Число"));
		ДоходыВредныхВзносов.Колонки.Добавить("П00322М121001", Новый ОписаниеТипов("Число"));
		
		СоответствиеИменЗначений = Новый Соответствие;
		Для каждого Ссылка Из Перечисления.КатегорииЗастрахованныхЛицДляПФР Цикл
			СоответствиеИменЗначений.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(Ссылка), Ссылка)
		КонецЦикла;
		
		НомерСведения = 0;
		Для каждого ДанныеОтчета Из Данные Цикл
			Если ДанныеОтчета.НомерКорректировки >= НомерКорректировки Тогда
				Прервать;
			КонецЕсли;
			Для каждого СтрокаРаздела3 Из ДанныеОтчета.ПерсонифицированныеСведенияОЗастрахованныхЛицах.Строки Цикл
				
				Если ЗначениеЗаполнено(СтрокаРаздела3.Данные.П000030001001) Тогда
					Продолжить;
				КонецЕсли;
				 
				СтрокаДанных = Физлица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаРаздела3.Данные);
				СтрокаДанных.НомерСведения = НомерСведения;
				СтрокаДанных.НомерКорректировки = ДанныеОтчета.НомерКорректировки;
				Если ТипЗнч(СтрокаДанных.П000310007001) <> Тип("Дата") Тогда
					Если ЗначениеЗаполнено(СтрокаДанных.П000310007001) И СтрокаДанных.П000310007001 <> "0" Тогда
						СтрокаДанных.П000310007001 = Дата(СтрокаДанных.П000310007001);
					Иначе
						СтрокаДанных.П000310007001 = '00010101'
					КонецЕсли;
				КонецЕсли;
				
				Для каждого СтрокаПодраздела321 Из СтрокаРаздела3.ДанныеМногострочныхЧастей.П00321М1.Строки Цикл
					Если ЗначениеЗаполнено(СтрокаПодраздела321.Данные.П00321М112001) Тогда
						СтрокаДанных = ДоходыВзносов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаПодраздела321.Данные);
						СтрокаДанных.НомерСведения = НомерСведения;
						СтрокаДанных.П00321М112001 = Число(СтрокаДанных.П00321М112001);
						Если ЗначениеЗаполнено(СтрокаДанных.П00321М113001) Тогда
							СтрокаДанных.П00321М113001 = СоответствиеИменЗначений[СтрокаДанных.П00321М113001]
						Иначе
							СтрокаДанных.П00321М113001 = Перечисления.КатегорииЗастрахованныхЛицДляПФР.ПустаяСсылка()
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Для каждого СтрокаПодраздела322 Из СтрокаРаздела3.ДанныеМногострочныхЧастей.П00322М1.Строки Цикл
					Если ЗначениеЗаполнено(СтрокаПодраздела322.Данные.П00322М118001) Тогда
						СтрокаДанных = ДоходыВредныхВзносов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаПодраздела322.Данные);
						СтрокаДанных.НомерСведения = НомерСведения;
					КонецЕсли;
				КонецЦикла;
				
				НомерСведения = НомерСведения + 1;
			КонецЦикла;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Физлица, "ВТВременнаяТаблица");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблица.П000310003001 КАК П000310003001,
		|	МАКСИМУМ(ВременнаяТаблица.НомерКорректировки) КАК НомерКорректировки
		|ПОМЕСТИТЬ ВТПоследниеКорректировки
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.П000310003001
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ФизическиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) КАК ФизическоеЛицо,
		|	ВременнаяТаблица.НомерСведения КАК НомерСведения,
		|	"""" КАК П000030001001,
		|	ВременнаяТаблица.П000310002001 КАК П000310002001,
		|	ВременнаяТаблица.П000310003001 КАК П000310003001,
		|	ВременнаяТаблица.П000310004001 КАК П000310004001,
		|	ВременнаяТаблица.П000310005001 КАК П000310005001,
		|	ВременнаяТаблица.П000310006001 КАК П000310006001,
		|	ВременнаяТаблица.П000310007001 КАК П000310007001,
		|	ВременнаяТаблица.П000310008001 КАК П000310008001,
		|	ВременнаяТаблица.П000310009001 КАК П000310009001,
		|	ВременнаяТаблица.П000310010001 КАК П000310010001,
		|	ВременнаяТаблица.П000310011001 КАК П000310011001,
		|	ВременнаяТаблица.П000310011002 КАК П000310011002
		|ПОМЕСТИТЬ ВТФизлицаПереданные
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ВременнаяТаблица.П000310003001 = ФизическиеЛица.СтраховойНомерПФР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследниеКорректировки КАК ПоследниеКорректировки
		|		ПО ВременнаяТаблица.НомерКорректировки = ПоследниеКорректировки.НомерКорректировки
		|			И ВременнаяТаблица.П000310003001 = ПоследниеКорректировки.П000310003001
		|ГДЕ
		|	ПоследниеКорректировки.НомерКорректировки ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.НомерСведения,
		|	ВременнаяТаблица.НомерКорректировки,
		|	ВременнаяТаблица.П000310002001,
		|	ВременнаяТаблица.П000310003001,
		|	ВременнаяТаблица.П000310004001,
		|	ВременнаяТаблица.П000310005001,
		|	ВременнаяТаблица.П000310006001,
		|	ВременнаяТаблица.П000310007001,
		|	ВременнаяТаблица.П000310008001,
		|	ВременнаяТаблица.П000310009001,
		|	ВременнаяТаблица.П000310010001,
		|	ВременнаяТаблица.П000310011001,
		|	ВременнаяТаблица.П000310011002";
		Запрос.Выполнить(); 
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
		
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ДоходыВзносов, "ВТВременнаяТаблица");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВременнаяТаблица.П00321М112001 КАК П00321М112001,
		|	ВременнаяТаблица.П00321М113001 КАК П00321М113001,
		|	ВременнаяТаблица.П00321М114001 КАК П00321М114001,
		|	ВременнаяТаблица.П00321М115001 КАК П00321М115001,
		|	ВременнаяТаблица.П00321М116001 КАК П00321М116001,
		|	ВременнаяТаблица.П00321М117001 КАК П00321М117001
		|ПОМЕСТИТЬ ВТДоходыВзносовПереданные
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизическиеЛица
		|		ПО ВременнаяТаблица.НомерСведения = ФизическиеЛица.НомерСведения";
		Запрос.Выполнить(); 
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
		
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ДоходыВредныхВзносов, "ВТВременнаяТаблица");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВременнаяТаблица.П00322М118001 КАК П00322М118001,
		|	ВременнаяТаблица.П00322М119001 КАК П00322М119001,
		|	ВременнаяТаблица.П00322М120001 КАК П00322М120001,
		|	ВременнаяТаблица.П00322М121001 КАК П00322М121001
		|ПОМЕСТИТЬ ВТДоходыВредныхВзносовПереданные
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПереданные КАК ФизическиеЛица
		|		ПО ВременнаяТаблица.НомерСведения = ФизическиеЛица.НомерСведения";
		Запрос.Выполнить(); 
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
		
	Иначе
		СоздатьПустыеВТПереданныхДанныхОтчета2020(МенеджерВременныхТаблиц)
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьВТФизЛицаОрганизаций(МенеджерВременныхТаблиц, МассивФизическихЛиц, ГоловнаяОрганизация)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В(&МассивФизическихЛиц)";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьПустыеВТПереданныхДанныхОтчета2020(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	"""" КАК П000030001001,
	|	"""" КАК П000310002001,
	|	"""" КАК П000310003001,
	|	"""" КАК П000310004001,
	|	"""" КАК П000310005001,
	|	"""" КАК П000310006001,
	|	"""" КАК П000310007001,
	|	"""" КАК П000310008001,
	|	"""" КАК П000310009001,
	|	"""" КАК П000310010001,
	|	"""" КАК П000310011001,
	|	"""" КАК П000310011002
	|ПОМЕСТИТЬ ВТФизлицаПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК П00321М112001,
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицДляПФР.ПустаяСсылка) КАК П00321М113001,
	|	0 КАК П00321М114001,
	|	0 КАК П00321М115001,
	|	0 КАК П00321М116001,
	|	0 КАК П00321М117001
	|ПОМЕСТИТЬ ВТДоходыВзносовПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК П00322М118001,
	|	"""" КАК П00322М119001,
	|	0 КАК П00322М120001,
	|	0 КАК П00322М121001
	|ПОМЕСТИТЬ ВТДоходыВредныхВзносовПереданные
	|ГДЕ
	|	ЛОЖЬ";
	Запрос.Выполнить(); 
	
КонецПроцедуры

Функция НовоеПустоеДеревоДляРСВ()
	
	ПустоеДерево = Новый ДеревоЗначений;
	ПустоеДерево.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	ПустоеДерево.Колонки.Добавить("ДанныеМногострочныхЧастей", Новый ОписаниеТипов("Структура"));
	
	Возврат ПустоеДерево
	
КонецФункции


Функция УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, ИмяТаблицы = "СведенияОДоходах")
	
	Для каждого ПолеРасшифровки Из МассивПолей Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,ИмяТаблицы + "." + ПолеРасшифровки,"Неопределено");
	КонецЦикла;
	
	Возврат ТекстЗапроса
	
КонецФункции	

#КонецОбласти

