
#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПредставлениеТелефона(Телефон) Экспорт
		
	Представление = "";
	ТекстДляОбработки = СокрЛП(Телефон); 
	ТолькоЦифры = "";
	Для Индекс = 1 По СтрДлина(ТекстДляОбработки) Цикл
		ТекущийСимвол = Сред(ТекстДляОбработки, Индекс, 1);
		Если СтрНайти("0123456789", ТекущийСимвол) Тогда
			ТолькоЦифры = ТолькоЦифры + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(ТолькоЦифры) = 11 Тогда
		ТолькоЦифры = Сред(ТолькоЦифры, 2);
	КонецЕсли;

	Если СтрДлина(ТолькоЦифры) = 10 Тогда
		Представление = СтрШаблон(
			"+7-%1-%2-%3%4", 
			Сред(ТолькоЦифры, 1, 3), 
			Сред(ТолькоЦифры, 4, 3),
			Сред(ТолькоЦифры, 7, 2),
			Сред(ТолькоЦифры, 9));		
	КонецЕсли;
	
	Возврат Представление;	

КонецФункции

Функция ИДНовостей() Экспорт
	
	Возврат "БРО.Документ.ЗаявкиНаЛьготныйКредит";
	
КонецФункции

Функция НастройкиОтображенияНовостей() Экспорт
	
	Возврат НСтр("ru='Новости: Льготные кредиты'");
	
КонецФункции

Функция ЗаявкиПринимаются() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти