////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиРасширениеКлиент: обход ошибки компиляции модуля на платформе ниже 8.3.18.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура вызывается только в 8.3.18, необходимо добавить в список исключений при выполнении синтаксической проверки.
Процедура ПодключитьРасширениеПолученияИнформацииОКомпьютере(Оповещение) Экспорт
	
	НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере(Оповещение)
	
КонецПроцедуры

// Процедура вызывается только в 8.3.18, необходимо добавить в список исключений при выполнении синтаксической проверки.
Процедура УстановитьРасширениеПолученияИнформацииОКомпьютере(Оповещение) Экспорт
	
	НачатьУстановкуРасширенияПолученияИнформацииОКомпьютере(Оповещение)
	
КонецПроцедуры

// Процедура вызывается только в 8.3.18, необходимо добавить в список исключений при выполнении синтаксической проверки.
Процедура ПолучениеИнформацииОСетевыхАдаптерах(Оповещение) Экспорт
	
	НачатьПолучениеИнформацииОСетевыхАдаптерах(Оповещение)
	
КонецПроцедуры

#КонецОбласти