// Создает площадку по переданной структуре
//
// Параметры:
//  - ДанныеЗаполнения - Структура - структура свойств площадки
//
// Возвращаемое значение:
//  - Ссылка - ссылка на созданный элемент справочника
//
Функция СоздатьЭТП (ДанныеЗаполнения) Экспорт
	
	СуществующаяПлощадка = ГЗ_РаботаСПлощадками.НайтиПлощадкуПоКодуГЗ(ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(СуществующаяПлощадка) Тогда
		Площадка = Справочники.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка.СоздатьЭлемент();
	//Иначе
	//	Площадка = СуществующаяПлощадка.ПолучитьОбъект();
	//	Площадка.Заблокировать();
	ЗаполнитьЗначенияСвойств(Площадка, ДанныеЗаполнения);
	
	Площадка.Заполнить(ДанныеЗаполнения);
	
	Если Площадка.ЭтоНовый() Тогда
		Площадка.Записать();
	КонецЕсли;
	
	СуществующаяПлощадка = Площадка.Ссылка;

	КонецЕсли;
	
		
	Возврат СуществующаяПлощадка;
	
КонецФункции
