#Область СлужебныеПроцедурыИФункции

Функция МенеджерДокументаПоВидуМестаВыплаты(ВидМестаВыплаты) Экспорт
	Возврат ВедомостьНаВыплатуЗарплатыБазовый.МенеджерДокументаПоВидуМестаВыплаты(ВидМестаВыплаты)
КонецФункции

Процедура ДобавитьКомандыПечатиПриВыплатеНаКарточки(КомандыПечати) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ДобавитьКомандыПечатиПриВыплатеНаКарточки(КомандыПечати);
КонецПроцедуры

Процедура ПечатьПриВыплатеНаКарточки(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ПечатьПриВыплатеНаКарточки(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
КонецПроцедуры

Процедура ДобавитьКомандыПечатиПриВыплатеНаличными(КомандыПечати) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ДобавитьКомандыПечатиПриВыплатеНаличными(КомандыПечати);
КонецПроцедуры

Процедура ПечатьПриВыплатеНаличными(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ПечатьПриВыплатеНаличными(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
КонецПроцедуры

Функция МестоВыплатыКасса(Ведомость) Экспорт
	Возврат ВедомостьНаВыплатуЗарплатыБазовый.МестоВыплатыКасса(Ведомость);
КонецФункции

Процедура УстановитьМестоВыплатыКасса(Ведомость, Значение) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.УстановитьМестоВыплатыКасса(Ведомость, Значение)
КонецПроцедуры

/// Обработчики событий модуля объекта документов Ведомости.

Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ЗарегистрироватьВыплатуВУчетеНДФЛ(Ведомость, Отказ) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.ЗарегистрироватьВыплатуВУчетеНДФЛ(Ведомость, Отказ);
КонецПроцедуры

/// Заполнение и расчет документа.

Процедура СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников)
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица, ОписаниеОперации, ОтборСотрудников) Экспорт
	ВедомостьНаВыплатуЗарплатыБазовый.СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица, ОписаниеОперации, ОтборСотрудников)
КонецПроцедуры	

Функция МожноЗаполнитьЗарплату(Ведомость) Экспорт
	Возврат ВедомостьНаВыплатуЗарплатыБазовый.МожноЗаполнитьЗарплату(Ведомость)
КонецФункции

#Область ДанныеДляЗаполнения

Функция ПараметрыЗаполненияПоОбъекту(Объект) Экспорт
	Возврат ВедомостьНаВыплатуЗарплатыБазовый.ПараметрыЗаполненияПоОбъекту(Объект)
КонецФункции

#КонецОбласти

#КонецОбласти
