////////////////////////////////////////////////////////////////////////////////
// Подсистема "Расчет имущественных налогов".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область РасчетНалогаНаИмущество

Процедура ДобавитьТекстЗапросаКоэффициентыЕНВД_ПоОС(СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаКоэффициентыЕНВД_ПоОС(СписокЗапросов);
	
КонецПроцедуры

Процедура СоздатьВТКоэффициентыЕНВД(ПараметрыРасчета) Экспорт

	РасчетИмущественныхНалоговБП.СоздатьВТКоэффициентыЕНВД(ПараметрыРасчета);
	
КонецПроцедуры
 
Процедура СоздатьВТДвижимоеИмуществоПринятоеКУчетуПосле2013(ПараметрыРасчета) Экспорт

	РасчетИмущественныхНалоговБП.СоздатьВТДвижимоеИмуществоПринятоеКУчетуПосле2013(ПараметрыРасчета);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаОССостоящиеНаУчете(ПараметрыРасчета, СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаОССостоящиеНаУчете(ПараметрыРасчета, СписокЗапросов);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСписокОС(СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаСписокОС(СписокЗапросов);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСчетаБухгалтерскогоУчета(СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаСчетаБухгалтерскогоУчета(СписокЗапросов);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСтоимостьИАмортизация(Период, ПараметрыРасчета, СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаСтоимостьИАмортизация(Период, ПараметрыРасчета, СписокЗапросов);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаМестонахождениеОС(Период, ПараметрыРасчета, СписокЗапросов) Экспорт

	РасчетИмущественныхНалоговБП.ДобавитьТекстЗапросаМестонахождениеОС(Период, ПараметрыРасчета, СписокЗапросов);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетТранспортногоНалога

Функция ПолучитьРасчетПоТранспортномуНалогу(Организация, ПериодРасчета, ДополнительныеПараметры) Экспорт
	
	Возврат РасчетИмущественныхНалоговБП.ПолучитьРасчетПоТранспортномуНалогу(Организация, ПериодРасчета, ДополнительныеПараметры);

КонецФункции

Функция ПолучитьРасходыНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога) Экспорт

	Возврат РасчетИмущественныхНалоговБП.ПолучитьРасходыНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога);
	
КонецФункции

#КонецОбласти

#Область ПрочиеЭкспортныеПроцедуры

Процедура УточнитьПараметрыРегистрацииОрганизацииВФНС(Параметры, Организация, Период) Экспорт

	РасчетИмущественныхНалоговБП.УточнитьПараметрыРегистрацииОрганизацииВФНС(Параметры, Организация, Период);
	
КонецПроцедуры

Процедура УточнитьПараметрыОсвобожденияОтУплатыНалогов(Параметры, ТаблицаРеквизиты) Экспорт

	РасчетИмущественныхНалоговБП.УточнитьПараметрыОсвобожденияОтУплатыНалогов(Параметры, ТаблицаРеквизиты);
	
КонецПроцедуры

Процедура СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(МенеджерВременныхТаблиц, СписокОрганизаций, Период, Налог) Экспорт

	РегистрыСведений.ПорядокУплатыНалоговНаМестах.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
		МенеджерВременныхТаблиц, 
		СписокОрганизаций, 
		Период, 
		Налог);
	
КонецПроцедуры

Функция ПодготовитьТаблицыРасчетНалога(ТаблицаРеквизиты, Отказ, ДополнительныеПараметры) Экспорт
	
	Возврат РасчетИмущественныхНалоговБП.ПодготовитьТаблицыРасчетНалога(ТаблицаРеквизиты, Отказ, ДополнительныеПараметры);
	
КонецФункции

Процедура СформироватьДвиженияРасчетНалога(ТаблицыНачислениеНалога, ТаблицаРеквизитов, Движения, Отказ) Экспорт

	РасчетИмущественныхНалоговБП.СформироватьДвиженияРасчетНалога(ТаблицыНачислениеНалога, ТаблицаРеквизитов, Движения, Отказ);
	
КонецПроцедуры

Функция ПустаяСправкаРасчет(ИмяРегистраСведений) Экспорт

	Возврат УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет(ИмяРегистраСведений);

КонецФункции

Процедура ДополнитьПараметрыРасчетаНалогаНаИмущество(ПараметрыРасчета, Организация, ПериодРасчета, ДополнительныеПараметрыРасчета) Экспорт

	
КонецПроцедуры

Процедура ДополнитьПараметрыРасчетаСтоимостиДвижимогоИмущества(ПараметрыРасчета) Экспорт 

	
КонецПроцедуры
 
Процедура УстановитьПараметрыЗапросаПриРасчетеНалогаЗаПериод(Период, Запрос) Экспорт
	
	
КонецПроцедуры

Функция ОрганизацииУплачивающиеАвансы(Организация, Период, Налог, ОднаОрганизация = Истина) Экспорт
	
	Возврат РасчетИмущественныхНалоговБП.ОрганизацииУплачивающиеАвансы(Организация, Период, Налог, ОднаОрганизация);
	
КонецФункции

Процедура ДополнитьПараметрыДвиженийСправкаРасчет(Реквизиты, СписокОбязательныхКолонок) Экспорт

	
КонецПроцедуры

#КонецОбласти

#КонецОбласти